
/home/vbesnard/Doctorat/Recherche/code/gits/uml-interpreter-c/samples/ButtonLeds/ButtonLedDeployment/ButtonLedGpioEnv.emi/build/stm32f4discovery/.build//model.o:     file format elf32-littlearm

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x5a68 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x1d63): GNU C99 5.4.1 20160919 -mcpu=cortex-m4 -mthumb -mfloat-abi=soft -g -O0 -std=c99
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x819b): model.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x1dd6): /home/vbesnard/Doctorat/Recherche/code/gits/uml-interpreter-c/samples/ButtonLeds/ButtonLedDeployment/ButtonLedGpioEnv.emi/src
    <19>   DW_AT_low_pc      : 0x0
    <1d>   DW_AT_high_pc     : 0x38e
    <21>   DW_AT_stmt_list   : 0x0
 <1><25>: Abbrev Number: 2 (DW_TAG_base_type)
    <26>   DW_AT_byte_size   : 4
    <27>   DW_AT_encoding    : 7	(unsigned)
    <28>   DW_AT_name        : (indirect string, offset: 0x48c8): unsigned int
 <1><2c>: Abbrev Number: 3 (DW_TAG_base_type)
    <2d>   DW_AT_byte_size   : 4
    <2e>   DW_AT_encoding    : 5	(signed)
    <2f>   DW_AT_name        : int
 <1><33>: Abbrev Number: 4 (DW_TAG_typedef)
    <34>   DW_AT_name        : (indirect string, offset: 0x592c): __int8_t
    <38>   DW_AT_decl_file   : 2

    <231>   DW_AT_name        : (indirect string, offset: 0x796f): DESC_TYPE_UML_Connector
    <235>   DW_AT_const_value : 6
 <2><236>: Abbrev Number: 8 (DW_TAG_enumerator)
    <237>   DW_AT_name        : (indirect string, offset: 0x4072): DESC_TYPE_UML_InterfaceRealization
    <23b>   DW_AT_const_value : 7
 <2><23c>: Abbrev Number: 8 (DW_TAG_enumerator)
    <23d>   DW_AT_name        : (indirect string, offset: 0x138b): DESC_TYPE_UML_OpaqueExpression
    <241>   DW_AT_const_value : 8
 <2><242>: Abbrev Number: 8 (DW_TAG_enumerator)
    <243>   DW_AT_name        : (indirect string, offset: 0x8237): DESC_TYPE_UML_Interface
    <247>   DW_AT_const_value : 9
 <2><248>: Abbrev Number: 8 (DW_TAG_enumerator)
    <249>   DW_AT_name        : (indirect string, offset: 0x1423): DESC_TYPE_UML_Reception
    <24d>   DW_AT_const_value : 10
 <2><24e>: Abbrev Number: 8 (DW_TAG_enumerator)
    <24f>   DW_AT_name        : (indirect string, offset: 0x16ff): DESC_TYPE_UML_Pseudostate
    <253>   DW_AT_const_value : 11
 <2><254>: Abbrev Number: 8 (DW_TAG_enumerator)
    <255>   DW_AT_name        : (indirect string, offset: 0x79b0): DESC_TYPE_UML_Vertex
    <259>   DW_AT_const_value : 12
 <2><25a>: Abbrev Number: 8 (DW_TAG_enumerator)
    <25b>   DW_AT_name        : (indirect string, offset: 0x57b6): DESC_TYPE_UML_Association
    <25f>   DW_AT_const_value : 13
 <2><260>: Abbrev Number: 8 (DW_TAG_enumerator)
    <261>   DW_AT_name        : (indirect string, offset: 0x477f): DESC_TYPE_UML_ValueSpecification
    <265>   DW_AT_const_value : 14
 <2><266>: Abbrev Number: 8 (DW_TAG_enumerator)
    <267>   DW_AT_name        : (indirect string, offset: 0x2877): DESC_TYPE_UML_Transition
    <26b>   DW_AT_const_value : 15
 <2><26c>: Abbrev Number: 8 (DW_TAG_enumerator)
    <26d>   DW_AT_name        : (indirect string, offset: 0x63b): DESC_TYPE_UML_StructuredClassifier
    <271>   DW_AT_const_value : 16
 <2><272>: Abbrev Number: 8 (DW_TAG_enumerator)
    <273>   DW_AT_name        : (indirect string, offset: 0x5d8): DESC_TYPE_UML_TypedElement
    <277>   DW_AT_const_value : 17
 <2><278>: Abbrev Number: 8 (DW_TAG_enumerator)
    <279>   DW_AT_name        : (indirect string, offset: 0x696f): DESC_TYPE_UML_PrimitiveType
    <27d>   DW_AT_const_value : 18
 <2><27e>: Abbrev Number: 8 (DW_TAG_enumerator)
    <27f>   DW_AT_name        : (indirect string, offset: 0x12fc): DESC_TYPE_UML_StateMachine
    <283>   DW_AT_const_value : 19
 <2><284>: Abbrev Number: 8 (DW_TAG_enumerator)
    <285>   DW_AT_name        : (indirect string, offset: 0x5ea0): DESC_TYPE_UML_BehavioralFeature
    <289>   DW_AT_const_value : 20
 <2><28a>: Abbrev Number: 8 (DW_TAG_enumerator)
    <28b>   DW_AT_name        : (indirect string, offset: 0x5d72): DESC_TYPE_UML_MultiplicityElement
    <28f>   DW_AT_const_value : 21
 <2><290>: Abbrev Number: 8 (DW_TAG_enumerator)
    <291>   DW_AT_name        : (indirect string, offset: 0x18a2): DESC_TYPE_UML_Behavior
    <295>   DW_AT_const_value : 22
 <2><296>: Abbrev Number: 8 (DW_TAG_enumerator)
    <297>   DW_AT_name        : (indirect string, offset: 0x2e4f): DESC_TYPE_UML_OpaqueBehavior
    <29b>   DW_AT_const_value : 23
 <2><29c>: Abbrev Number: 8 (DW_TAG_enumerator)
    <29d>   DW_AT_name        : (indirect string, offset: 0x83f4): DESC_TYPE_UML_State
    <2a1>   DW_AT_const_value : 24
 <2><2a2>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x69a4): DESC_TYPE_UML_Trigger
    <2a7>   DW_AT_const_value : 25
 <2><2a8>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x9d9): DESC_TYPE_UML_NamedElement
    <2ad>   DW_AT_const_value : 26
 <2><2ae>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2af>   DW_AT_name        : (indirect string, offset: 0x47a6): DESC_TYPE_UML_Signal
    <2b3>   DW_AT_const_value : 27
 <2><2b4>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x440d): DESC_TYPE_UML_EncapsulatedClassifier
    <2b9>   DW_AT_const_value : 28
 <2><2ba>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x5935): DESC_TYPE_UML_Region
    <2bf>   DW_AT_const_value : 29
 <2><2c0>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x77e4): DESC_TYPE_UML_Enumeration
    <2c5>   DW_AT_const_value : 30
 <2><2c6>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x5e7f): DESC_TYPE_UML_EnumerationLiteral
    <2cb>   DW_AT_const_value : 31
 <2><2cc>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x4601): DESC_TYPE_UML_Operation
    <2d1>   DW_AT_const_value : 32
 <2><2d2>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x3879): DESC_TYPE_UML_BehavioredClassifier
    <2d7>   DW_AT_const_value : 33
 <2><2d8>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x1ce5): DESC_TYPE_UML_ConnectableElement
    <2dd>   DW_AT_const_value : 34
 <2><2de>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2df>   DW_AT_name        : (indirect string, offset: 0x3a29): NB_DESC_TYPE
    <2e3>   DW_AT_const_value : 35
 <2><2e4>: Abbrev Number: 0
 <1><2e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x2745): C_UML_Model
    <2ea>   DW_AT_decl_file   : 6
    <2eb>   DW_AT_decl_line   : 159
    <2ec>   DW_AT_type        : <0x2f0>
 <1><2f0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x2745): C_UML_Model
    <2f5>   DW_AT_byte_size   : 20
    <2f6>   DW_AT_decl_file   : 6
    <2f7>   DW_AT_decl_line   : 442
    <2f9>   DW_AT_sibling     : <0x33f>
 <2><2fd>: Abbrev Number: 11 (DW_TAG_member)
    <2fe>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <302>   DW_AT_decl_file   : 6
    <303>   DW_AT_decl_line   : 443
    <305>   DW_AT_type        : <0xa0>
    <309>   DW_AT_data_member_location: 0
 <2><30a>: Abbrev Number: 11 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x7e22): uml_signal
    <30f>   DW_AT_decl_file   : 6
    <310>   DW_AT_decl_line   : 444
    <312>   DW_AT_type        : <0xded>
    <316>   DW_AT_data_member_location: 4
 <2><317>: Abbrev Number: 11 (DW_TAG_member)
    <318>   DW_AT_name        : (indirect string, offset: 0x73f8): uml_signal_event
    <31c>   DW_AT_decl_file   : 6
    <31d>   DW_AT_decl_line   : 445
    <31f>   DW_AT_type        : <0xdf9>
    <323>   DW_AT_data_member_location: 8
 <2><324>: Abbrev Number: 11 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x1ea7): uml_class
    <329>   DW_AT_decl_file   : 6
    <32a>   DW_AT_decl_line   : 446
    <32c>   DW_AT_type        : <0xe05>
    <330>   DW_AT_data_member_location: 12
 <2><331>: Abbrev Number: 11 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x145): uml_association
    <336>   DW_AT_decl_file   : 6
    <337>   DW_AT_decl_line   : 447
    <339>   DW_AT_type        : <0xe11>
    <33d>   DW_AT_data_member_location: 16
 <2><33e>: Abbrev Number: 0
 <1><33f>: Abbrev Number: 4 (DW_TAG_typedef)
    <340>   DW_AT_name        : (indirect string, offset: 0x4dcb): UML_VisibilityKind
    <344>   DW_AT_decl_file   : 6
    <345>   DW_AT_decl_line   : 160
    <346>   DW_AT_type        : <0x34a>
 <1><34a>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <34b>   DW_AT_name        : (indirect string, offset: 0x4dcb): UML_VisibilityKind
    <34f>   DW_AT_byte_size   : 4
    <350>   DW_AT_type        : <0x25>
    <354>   DW_AT_decl_file   : 6
    <355>   DW_AT_decl_line   : 160
    <356>   DW_AT_sibling     : <0x373>
 <2><35a>: Abbrev Number: 8 (DW_TAG_enumerator)
    <35b>   DW_AT_name        : (indirect string, offset: 0x4edc): UML_PUBLIC
    <35f>   DW_AT_const_value : 0
 <2><360>: Abbrev Number: 8 (DW_TAG_enumerator)
    <361>   DW_AT_name        : (indirect string, offset: 0x10af): UML_PRIVATE
    <365>   DW_AT_const_value : 1
 <2><366>: Abbrev Number: 8 (DW_TAG_enumerator)
    <367>   DW_AT_name        : (indirect string, offset: 0x2fdf): UML_PROTECTED
    <36b>   DW_AT_const_value : 2
 <2><36c>: Abbrev Number: 8 (DW_TAG_enumerator)
    <36d>   DW_AT_name        : (indirect string, offset: 0x57d0): UML_PACKAGE
    <371>   DW_AT_const_value : 3
 <2><372>: Abbrev Number: 0
 <1><373>: Abbrev Number: 4 (DW_TAG_typedef)
    <374>   DW_AT_name        : (indirect string, offset: 0x2688): UML_PseudostateKind
    <378>   DW_AT_decl_file   : 6
    <379>   DW_AT_decl_line   : 161
    <37a>   DW_AT_type        : <0x37e>
 <1><37e>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <37f>   DW_AT_name        : (indirect string, offset: 0x2688): UML_PseudostateKind
    <383>   DW_AT_byte_size   : 4
    <384>   DW_AT_type        : <0x25>
    <388>   DW_AT_decl_file   : 6
    <389>   DW_AT_decl_line   : 161
    <38a>   DW_AT_sibling     : <0x3cb>
 <2><38e>: Abbrev Number: 8 (DW_TAG_enumerator)
    <38f>   DW_AT_name        : (indirect string, offset: 0x55aa): UML_INITIAL
    <393>   DW_AT_const_value : 0
 <2><394>: Abbrev Number: 8 (DW_TAG_enumerator)
    <395>   DW_AT_name        : (indirect string, offset: 0x8227): UML_DEEPHISTORY
    <399>   DW_AT_const_value : 1
 <2><39a>: Abbrev Number: 8 (DW_TAG_enumerator)
    <39b>   DW_AT_name        : (indirect string, offset: 0x766): UML_SHALLOWHISTORY
    <39f>   DW_AT_const_value : 2
 <2><3a0>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x599b): UML_JOIN
    <3a5>   DW_AT_const_value : 3
 <2><3a6>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x7f18): UML_FORK
    <3ab>   DW_AT_const_value : 4
 <2><3ac>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x2fd2): UML_JUNCTION
    <3b1>   DW_AT_const_value : 5
 <2><3b2>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3b3>   DW_AT_name        : (indirect string, offset: 0xb3a): UML_CHOICE
    <3b7>   DW_AT_const_value : 6
 <2><3b8>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3b9>   DW_AT_name        : (indirect string, offset: 0x8270): UML_ENTRYPOINT
    <3bd>   DW_AT_const_value : 7
 <2><3be>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x76b9): UML_EXITPOINT
    <3c3>   DW_AT_const_value : 8
 <2><3c4>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x112a): UML_TERMINATE
    <3c9>   DW_AT_const_value : 9
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 4 (DW_TAG_typedef)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x38f0): UML_AggregationKind
    <3d0>   DW_AT_decl_file   : 6
    <3d1>   DW_AT_decl_line   : 162
    <3d2>   DW_AT_type        : <0x3d6>
 <1><3d6>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <3d7>   DW_AT_name        : (indirect string, offset: 0x38f0): UML_AggregationKind
    <3db>   DW_AT_byte_size   : 4
    <3dc>   DW_AT_type        : <0x25>
    <3e0>   DW_AT_decl_file   : 6
    <3e1>   DW_AT_decl_line   : 162
    <3e2>   DW_AT_sibling     : <0x3f9>
 <2><3e6>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3e7>   DW_AT_name        : (indirect string, offset: 0x71f4): UML_NONE
    <3eb>   DW_AT_const_value : 0
 <2><3ec>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3ed>   DW_AT_name        : (indirect string, offset: 0x2d8c): UML_SHARED
    <3f1>   DW_AT_const_value : 1
 <2><3f2>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3f3>   DW_AT_name        : (indirect string, offset: 0x1a13): UML_COMPOSITE
    <3f7>   DW_AT_const_value : 2
 <2><3f8>: Abbrev Number: 0
 <1><3f9>: Abbrev Number: 4 (DW_TAG_typedef)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x2bf5): UML_Constraint
    <3fe>   DW_AT_decl_file   : 6
    <3ff>   DW_AT_decl_line   : 163
    <400>   DW_AT_type        : <0x404>
 <1><404>: Abbrev Number: 10 (DW_TAG_structure_type)
    <405>   DW_AT_name        : (indirect string, offset: 0x2bf5): UML_Constraint
    <409>   DW_AT_byte_size   : 16
    <40a>   DW_AT_decl_file   : 6
    <40b>   DW_AT_decl_line   : 485
    <40d>   DW_AT_sibling     : <0x446>
 <2><411>: Abbrev Number: 11 (DW_TAG_member)
    <412>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <416>   DW_AT_decl_file   : 6
    <417>   DW_AT_decl_line   : 486
    <419>   DW_AT_type        : <0x1f1>
    <41d>   DW_AT_data_member_location: 0
 <2><41e>: Abbrev Number: 11 (DW_TAG_member)
    <41f>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <423>   DW_AT_decl_file   : 6
    <424>   DW_AT_decl_line   : 487
    <426>   DW_AT_type        : <0x33f>
    <42a>   DW_AT_data_member_location: 4
 <2><42b>: Abbrev Number: 11 (DW_TAG_member)
    <42c>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <430>   DW_AT_decl_file   : 6
    <431>   DW_AT_decl_line   : 487
    <433>   DW_AT_type        : <0xa0>
    <437>   DW_AT_data_member_location: 8
 <2><438>: Abbrev Number: 11 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0xf34): specification
    <43d>   DW_AT_decl_file   : 6
    <43e>   DW_AT_decl_line   : 488
    <440>   DW_AT_type        : <0xe1d>
    <444>   DW_AT_data_member_location: 12
 <2><445>: Abbrev Number: 0
 <1><446>: Abbrev Number: 4 (DW_TAG_typedef)
    <447>   DW_AT_name        : (indirect string, offset: 0x4692): UML_ConnectorEnd
    <44b>   DW_AT_decl_file   : 6
    <44c>   DW_AT_decl_line   : 164
    <44d>   DW_AT_type        : <0x451>
 <1><451>: Abbrev Number: 10 (DW_TAG_structure_type)
    <452>   DW_AT_name        : (indirect string, offset: 0x4692): UML_ConnectorEnd
    <456>   DW_AT_byte_size   : 16
    <457>   DW_AT_decl_file   : 6
    <458>   DW_AT_decl_line   : 498
    <45a>   DW_AT_sibling     : <0x493>
 <2><45e>: Abbrev Number: 11 (DW_TAG_member)
    <45f>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <463>   DW_AT_decl_file   : 6
    <464>   DW_AT_decl_line   : 499
    <466>   DW_AT_type        : <0x1f1>
    <46a>   DW_AT_data_member_location: 0
 <2><46b>: Abbrev Number: 11 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0x21f4): lower
    <470>   DW_AT_decl_file   : 6
    <471>   DW_AT_decl_line   : 500
    <473>   DW_AT_type        : <0x2c>
    <477>   DW_AT_data_member_location: 4
 <2><478>: Abbrev Number: 11 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x7aa2): role
    <47d>   DW_AT_decl_file   : 6
    <47e>   DW_AT_decl_line   : 501
    <480>   DW_AT_type        : <0xe23>
    <484>   DW_AT_data_member_location: 8
 <2><485>: Abbrev Number: 11 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x6b9): partWithPort
    <48a>   DW_AT_decl_file   : 6
    <48b>   DW_AT_decl_line   : 501
    <48d>   DW_AT_type        : <0xe23>
    <491>   DW_AT_data_member_location: 12
 <2><492>: Abbrev Number: 0
 <1><493>: Abbrev Number: 4 (DW_TAG_typedef)
    <494>   DW_AT_name        : (indirect string, offset: 0x1190): UML_SignalEvent
    <498>   DW_AT_decl_file   : 6
    <499>   DW_AT_decl_line   : 165
    <49a>   DW_AT_type        : <0x49e>
 <1><49e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <49f>   DW_AT_name        : (indirect string, offset: 0x1190): UML_SignalEvent
    <4a3>   DW_AT_byte_size   : 20
    <4a4>   DW_AT_decl_file   : 6
    <4a5>   DW_AT_decl_line   : 511
    <4a7>   DW_AT_sibling     : <0x4ed>
 <2><4ab>: Abbrev Number: 11 (DW_TAG_member)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <4b0>   DW_AT_decl_file   : 6
    <4b1>   DW_AT_decl_line   : 512
    <4b3>   DW_AT_type        : <0x1f1>
    <4b7>   DW_AT_data_member_location: 0
 <2><4b8>: Abbrev Number: 11 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <4bd>   DW_AT_decl_file   : 6
    <4be>   DW_AT_decl_line   : 513
    <4c0>   DW_AT_type        : <0x33f>
    <4c4>   DW_AT_data_member_location: 4
 <2><4c5>: Abbrev Number: 11 (DW_TAG_member)
    <4c6>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <4ca>   DW_AT_decl_file   : 6
    <4cb>   DW_AT_decl_line   : 513
    <4cd>   DW_AT_type        : <0xa0>
    <4d1>   DW_AT_data_member_location: 8
 <2><4d2>: Abbrev Number: 11 (DW_TAG_member)
    <4d3>   DW_AT_name        : (indirect string, offset: 0x57fd): c_index
    <4d7>   DW_AT_decl_file   : 6
    <4d8>   DW_AT_decl_line   : 514
    <4da>   DW_AT_type        : <0xd9>
    <4de>   DW_AT_data_member_location: 12
 <2><4df>: Abbrev Number: 11 (DW_TAG_member)
    <4e0>   DW_AT_name        : (indirect string, offset: 0x26c0): signal
    <4e4>   DW_AT_decl_file   : 6
    <4e5>   DW_AT_decl_line   : 514
    <4e7>   DW_AT_type        : <0xdf3>
    <4eb>   DW_AT_data_member_location: 16
 <2><4ec>: Abbrev Number: 0
 <1><4ed>: Abbrev Number: 4 (DW_TAG_typedef)
    <4ee>   DW_AT_name        : (indirect string, offset: 0xc95): UML_Connector
    <4f2>   DW_AT_decl_file   : 6
    <4f3>   DW_AT_decl_line   : 166
    <4f4>   DW_AT_type        : <0x4f8>
 <1><4f8>: Abbrev Number: 10 (DW_TAG_structure_type)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xc95): UML_Connector
    <4fd>   DW_AT_byte_size   : 20
    <4fe>   DW_AT_decl_file   : 6
    <4ff>   DW_AT_decl_line   : 524
    <501>   DW_AT_sibling     : <0x547>
 <2><505>: Abbrev Number: 11 (DW_TAG_member)
    <506>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <50a>   DW_AT_decl_file   : 6
    <50b>   DW_AT_decl_line   : 525
    <50d>   DW_AT_type        : <0x1f1>
    <511>   DW_AT_data_member_location: 0
 <2><512>: Abbrev Number: 11 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <517>   DW_AT_decl_file   : 6
    <518>   DW_AT_decl_line   : 526
    <51a>   DW_AT_type        : <0x33f>
    <51e>   DW_AT_data_member_location: 4
 <2><51f>: Abbrev Number: 11 (DW_TAG_member)
    <520>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <524>   DW_AT_decl_file   : 6
    <525>   DW_AT_decl_line   : 526
    <527>   DW_AT_type        : <0xa0>
    <52b>   DW_AT_data_member_location: 8
 <2><52c>: Abbrev Number: 12 (DW_TAG_member)
    <52d>   DW_AT_name        : end
    <531>   DW_AT_decl_file   : 6
    <532>   DW_AT_decl_line   : 527
    <534>   DW_AT_type        : <0xe29>
    <538>   DW_AT_data_member_location: 12
 <2><539>: Abbrev Number: 11 (DW_TAG_member)
    <53a>   DW_AT_name        : (indirect string, offset: 0xc82): type
    <53e>   DW_AT_decl_file   : 6
    <53f>   DW_AT_decl_line   : 527
    <541>   DW_AT_type        : <0xe17>
    <545>   DW_AT_data_member_location: 16
 <2><546>: Abbrev Number: 0
 <1><547>: Abbrev Number: 4 (DW_TAG_typedef)
    <548>   DW_AT_name        : (indirect string, offset: 0x77a3): UML_InterfaceRealization
    <54c>   DW_AT_decl_file   : 6
    <54d>   DW_AT_decl_line   : 167
    <54e>   DW_AT_type        : <0x552>
 <1><552>: Abbrev Number: 10 (DW_TAG_structure_type)
    <553>   DW_AT_name        : (indirect string, offset: 0x77a3): UML_InterfaceRealization
    <557>   DW_AT_byte_size   : 8
    <558>   DW_AT_decl_file   : 6
    <559>   DW_AT_decl_line   : 537
    <55b>   DW_AT_sibling     : <0x57a>
 <2><55f>: Abbrev Number: 11 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <564>   DW_AT_decl_file   : 6
    <565>   DW_AT_decl_line   : 538
    <567>   DW_AT_type        : <0x1f1>
    <56b>   DW_AT_data_member_location: 0
 <2><56c>: Abbrev Number: 11 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0x4514): contract
    <571>   DW_AT_decl_file   : 6
    <572>   DW_AT_decl_line   : 539
    <574>   DW_AT_type        : <0xe2f>
    <578>   DW_AT_data_member_location: 4
 <2><579>: Abbrev Number: 0
 <1><57a>: Abbrev Number: 4 (DW_TAG_typedef)
    <57b>   DW_AT_name        : (indirect string, offset: 0x779): UML_OpaqueExpression
    <57f>   DW_AT_decl_file   : 6
    <580>   DW_AT_decl_line   : 168
    <581>   DW_AT_type        : <0x585>
 <1><585>: Abbrev Number: 10 (DW_TAG_structure_type)
    <586>   DW_AT_name        : (indirect string, offset: 0x779): UML_OpaqueExpression
    <58a>   DW_AT_byte_size   : 24
    <58b>   DW_AT_decl_file   : 6
    <58c>   DW_AT_decl_line   : 549
    <58e>   DW_AT_sibling     : <0x5e1>
 <2><592>: Abbrev Number: 11 (DW_TAG_member)
    <593>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <597>   DW_AT_decl_file   : 6
    <598>   DW_AT_decl_line   : 550
    <59a>   DW_AT_type        : <0x1f1>
    <59e>   DW_AT_data_member_location: 0
 <2><59f>: Abbrev Number: 11 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <5a4>   DW_AT_decl_file   : 6
    <5a5>   DW_AT_decl_line   : 551
    <5a7>   DW_AT_type        : <0x33f>
    <5ab>   DW_AT_data_member_location: 4
 <2><5ac>: Abbrev Number: 11 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <5b1>   DW_AT_decl_file   : 6
    <5b2>   DW_AT_decl_line   : 551
    <5b4>   DW_AT_type        : <0xa0>
    <5b8>   DW_AT_data_member_location: 8
 <2><5b9>: Abbrev Number: 11 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x4bd2): c_function
    <5be>   DW_AT_decl_file   : 6
    <5bf>   DW_AT_decl_line   : 552
    <5c1>   DW_AT_type        : <0x9e>
    <5c5>   DW_AT_data_member_location: 12
 <2><5c6>: Abbrev Number: 11 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x1d5a): language
    <5cb>   DW_AT_decl_file   : 6
    <5cc>   DW_AT_decl_line   : 552
    <5ce>   DW_AT_type        : <0xe35>
    <5d2>   DW_AT_data_member_location: 16
 <2><5d3>: Abbrev Number: 11 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x2539): body
    <5d8>   DW_AT_decl_file   : 6
    <5d9>   DW_AT_decl_line   : 552
    <5db>   DW_AT_type        : <0xe35>
    <5df>   DW_AT_data_member_location: 20
 <2><5e0>: Abbrev Number: 0
 <1><5e1>: Abbrev Number: 4 (DW_TAG_typedef)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x6eec): UML_Interface
    <5e6>   DW_AT_decl_file   : 6
    <5e7>   DW_AT_decl_line   : 169
    <5e8>   DW_AT_type        : <0x5ec>
 <1><5ec>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5ed>   DW_AT_name        : (indirect string, offset: 0x6eec): UML_Interface
    <5f1>   DW_AT_byte_size   : 24
    <5f2>   DW_AT_decl_file   : 6
    <5f3>   DW_AT_decl_line   : 562
    <5f5>   DW_AT_sibling     : <0x648>
 <2><5f9>: Abbrev Number: 11 (DW_TAG_member)
    <5fa>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <5fe>   DW_AT_decl_file   : 6
    <5ff>   DW_AT_decl_line   : 563
    <601>   DW_AT_type        : <0x1f1>
    <605>   DW_AT_data_member_location: 0
 <2><606>: Abbrev Number: 11 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <60b>   DW_AT_decl_file   : 6
    <60c>   DW_AT_decl_line   : 564
    <60e>   DW_AT_type        : <0x33f>
    <612>   DW_AT_data_member_location: 4
 <2><613>: Abbrev Number: 11 (DW_TAG_member)
    <614>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <618>   DW_AT_decl_file   : 6
    <619>   DW_AT_decl_line   : 564
    <61b>   DW_AT_type        : <0xa0>
    <61f>   DW_AT_data_member_location: 8
 <2><620>: Abbrev Number: 11 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <625>   DW_AT_decl_file   : 6
    <626>   DW_AT_decl_line   : 565
    <628>   DW_AT_type        : <0x198>
    <62c>   DW_AT_data_member_location: 12
 <2><62d>: Abbrev Number: 11 (DW_TAG_member)
    <62e>   DW_AT_name        : (indirect string, offset: 0x1b88): ownedAttribute
    <632>   DW_AT_decl_file   : 6
    <633>   DW_AT_decl_line   : 565
    <635>   DW_AT_type        : <0xe3b>
    <639>   DW_AT_data_member_location: 16
 <2><63a>: Abbrev Number: 11 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x5ce5): ownedReception
    <63f>   DW_AT_decl_file   : 6
    <640>   DW_AT_decl_line   : 565
    <642>   DW_AT_type        : <0xe41>
    <646>   DW_AT_data_member_location: 20
 <2><647>: Abbrev Number: 0
 <1><648>: Abbrev Number: 4 (DW_TAG_typedef)
    <649>   DW_AT_name        : (indirect string, offset: 0x76): UML_Reception
    <64d>   DW_AT_decl_file   : 6
    <64e>   DW_AT_decl_line   : 170
    <64f>   DW_AT_type        : <0x653>
 <1><653>: Abbrev Number: 10 (DW_TAG_structure_type)
    <654>   DW_AT_name        : (indirect string, offset: 0x76): UML_Reception
    <658>   DW_AT_byte_size   : 16
    <659>   DW_AT_decl_file   : 6
    <65a>   DW_AT_decl_line   : 575
    <65c>   DW_AT_sibling     : <0x695>
 <2><660>: Abbrev Number: 11 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <665>   DW_AT_decl_file   : 6
    <666>   DW_AT_decl_line   : 576
    <668>   DW_AT_type        : <0x1f1>
    <66c>   DW_AT_data_member_location: 0
 <2><66d>: Abbrev Number: 11 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <672>   DW_AT_decl_file   : 6
    <673>   DW_AT_decl_line   : 577
    <675>   DW_AT_type        : <0x33f>
    <679>   DW_AT_data_member_location: 4
 <2><67a>: Abbrev Number: 11 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <67f>   DW_AT_decl_file   : 6
    <680>   DW_AT_decl_line   : 577
    <682>   DW_AT_type        : <0xa0>
    <686>   DW_AT_data_member_location: 8
 <2><687>: Abbrev Number: 11 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0x26c0): signal
    <68c>   DW_AT_decl_file   : 6
    <68d>   DW_AT_decl_line   : 578
    <68f>   DW_AT_type        : <0xdf3>
    <693>   DW_AT_data_member_location: 12
 <2><694>: Abbrev Number: 0
 <1><695>: Abbrev Number: 4 (DW_TAG_typedef)
    <696>   DW_AT_name        : (indirect string, offset: 0x7fcf): UML_Pseudostate
    <69a>   DW_AT_decl_file   : 6
    <69b>   DW_AT_decl_line   : 171
    <69c>   DW_AT_type        : <0x6a0>
 <1><6a0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x7fcf): UML_Pseudostate
    <6a5>   DW_AT_byte_size   : 28
    <6a6>   DW_AT_decl_file   : 6
    <6a7>   DW_AT_decl_line   : 588
    <6a9>   DW_AT_sibling     : <0x709>
 <2><6ad>: Abbrev Number: 11 (DW_TAG_member)
    <6ae>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <6b2>   DW_AT_decl_file   : 6
    <6b3>   DW_AT_decl_line   : 589
    <6b5>   DW_AT_type        : <0x1f1>
    <6b9>   DW_AT_data_member_location: 0
 <2><6ba>: Abbrev Number: 11 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <6bf>   DW_AT_decl_file   : 6
    <6c0>   DW_AT_decl_line   : 590
    <6c2>   DW_AT_type        : <0x33f>
    <6c6>   DW_AT_data_member_location: 4
 <2><6c7>: Abbrev Number: 11 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <6cc>   DW_AT_decl_file   : 6
    <6cd>   DW_AT_decl_line   : 590
    <6cf>   DW_AT_type        : <0xa0>
    <6d3>   DW_AT_data_member_location: 8
 <2><6d4>: Abbrev Number: 11 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <6d9>   DW_AT_decl_file   : 6
    <6da>   DW_AT_decl_line   : 591
    <6dc>   DW_AT_type        : <0x1bc>
    <6e0>   DW_AT_data_member_location: 12
 <2><6e1>: Abbrev Number: 11 (DW_TAG_member)
    <6e2>   DW_AT_name        : (indirect string, offset: 0x632d): incoming
    <6e6>   DW_AT_decl_file   : 6
    <6e7>   DW_AT_decl_line   : 591
    <6e9>   DW_AT_type        : <0xe4d>
    <6ed>   DW_AT_data_member_location: 16
 <2><6ee>: Abbrev Number: 11 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0x4f14): outgoing
    <6f3>   DW_AT_decl_file   : 6
    <6f4>   DW_AT_decl_line   : 591
    <6f6>   DW_AT_type        : <0xe4d>
    <6fa>   DW_AT_data_member_location: 20
 <2><6fb>: Abbrev Number: 11 (DW_TAG_member)
    <6fc>   DW_AT_name        : (indirect string, offset: 0xfbd): kind
    <700>   DW_AT_decl_file   : 6
    <701>   DW_AT_decl_line   : 592
    <703>   DW_AT_type        : <0x373>
    <707>   DW_AT_data_member_location: 24
 <2><708>: Abbrev Number: 0
 <1><709>: Abbrev Number: 4 (DW_TAG_typedef)
    <70a>   DW_AT_name        : (indirect string, offset: 0x5b85): UML_Vertex
    <70e>   DW_AT_decl_file   : 6
    <70f>   DW_AT_decl_line   : 172
    <710>   DW_AT_type        : <0x714>
 <1><714>: Abbrev Number: 10 (DW_TAG_structure_type)
    <715>   DW_AT_name        : (indirect string, offset: 0x5b85): UML_Vertex
    <719>   DW_AT_byte_size   : 24
    <71a>   DW_AT_decl_file   : 6
    <71b>   DW_AT_decl_line   : 602
    <71d>   DW_AT_sibling     : <0x770>
 <2><721>: Abbrev Number: 11 (DW_TAG_member)
    <722>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <726>   DW_AT_decl_file   : 6
    <727>   DW_AT_decl_line   : 603
    <729>   DW_AT_type        : <0x1f1>
    <72d>   DW_AT_data_member_location: 0
 <2><72e>: Abbrev Number: 11 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <733>   DW_AT_decl_file   : 6
    <734>   DW_AT_decl_line   : 604
    <736>   DW_AT_type        : <0x33f>
    <73a>   DW_AT_data_member_location: 4
 <2><73b>: Abbrev Number: 11 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <740>   DW_AT_decl_file   : 6
    <741>   DW_AT_decl_line   : 604
    <743>   DW_AT_type        : <0xa0>
    <747>   DW_AT_data_member_location: 8
 <2><748>: Abbrev Number: 11 (DW_TAG_member)
    <749>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <74d>   DW_AT_decl_file   : 6
    <74e>   DW_AT_decl_line   : 605
    <750>   DW_AT_type        : <0x1bc>
    <754>   DW_AT_data_member_location: 12
 <2><755>: Abbrev Number: 11 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x632d): incoming
    <75a>   DW_AT_decl_file   : 6
    <75b>   DW_AT_decl_line   : 605
    <75d>   DW_AT_type        : <0xe4d>
    <761>   DW_AT_data_member_location: 16
 <2><762>: Abbrev Number: 11 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x4f14): outgoing
    <767>   DW_AT_decl_file   : 6
    <768>   DW_AT_decl_line   : 605
    <76a>   DW_AT_type        : <0xe4d>
    <76e>   DW_AT_data_member_location: 20
 <2><76f>: Abbrev Number: 0
 <1><770>: Abbrev Number: 4 (DW_TAG_typedef)
    <771>   DW_AT_name        : (indirect string, offset: 0x3e0c): UML_Association
    <775>   DW_AT_decl_file   : 6
    <776>   DW_AT_decl_line   : 173
    <777>   DW_AT_type        : <0x77b>
 <1><77b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <77c>   DW_AT_name        : (indirect string, offset: 0x3e0c): UML_Association
    <780>   DW_AT_byte_size   : 24
    <781>   DW_AT_decl_file   : 6
    <782>   DW_AT_decl_line   : 615
    <784>   DW_AT_sibling     : <0x7d7>
 <2><788>: Abbrev Number: 11 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <78d>   DW_AT_decl_file   : 6
    <78e>   DW_AT_decl_line   : 616
    <790>   DW_AT_type        : <0x1f1>
    <794>   DW_AT_data_member_location: 0
 <2><795>: Abbrev Number: 11 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <79a>   DW_AT_decl_file   : 6
    <79b>   DW_AT_decl_line   : 617
    <79d>   DW_AT_type        : <0x33f>
    <7a1>   DW_AT_data_member_location: 4
 <2><7a2>: Abbrev Number: 11 (DW_TAG_member)
    <7a3>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <7a7>   DW_AT_decl_file   : 6
    <7a8>   DW_AT_decl_line   : 617
    <7aa>   DW_AT_type        : <0xa0>
    <7ae>   DW_AT_data_member_location: 8
 <2><7af>: Abbrev Number: 11 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <7b4>   DW_AT_decl_file   : 6
    <7b5>   DW_AT_decl_line   : 618
    <7b7>   DW_AT_type        : <0x198>
    <7bb>   DW_AT_data_member_location: 12
 <2><7bc>: Abbrev Number: 11 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x13bc): memberEnd
    <7c1>   DW_AT_decl_file   : 6
    <7c2>   DW_AT_decl_line   : 618
    <7c4>   DW_AT_type        : <0xe3b>
    <7c8>   DW_AT_data_member_location: 16
 <2><7c9>: Abbrev Number: 11 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x6efa): ownedEnd
    <7ce>   DW_AT_decl_file   : 6
    <7cf>   DW_AT_decl_line   : 618
    <7d1>   DW_AT_type        : <0xe3b>
    <7d5>   DW_AT_data_member_location: 20
 <2><7d6>: Abbrev Number: 0
 <1><7d7>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x2c1e): UML_ValueSpecification
    <7dc>   DW_AT_decl_file   : 6
    <7dd>   DW_AT_decl_line   : 174
    <7de>   DW_AT_type        : <0x7e2>
 <1><7e2>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7e3>   DW_AT_name        : (indirect string, offset: 0x2c1e): UML_ValueSpecification
    <7e7>   DW_AT_byte_size   : 4
    <7e8>   DW_AT_decl_file   : 6
    <7e9>   DW_AT_decl_line   : 628
    <7eb>   DW_AT_sibling     : <0x7fd>
 <2><7ef>: Abbrev Number: 11 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <7f4>   DW_AT_decl_file   : 6
    <7f5>   DW_AT_decl_line   : 629
    <7f7>   DW_AT_type        : <0x1f1>
    <7fb>   DW_AT_data_member_location: 0
 <2><7fc>: Abbrev Number: 0
 <1><7fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x253e): UML_Property
    <802>   DW_AT_decl_file   : 6
    <803>   DW_AT_decl_line   : 175
    <804>   DW_AT_type        : <0x808>
 <1><808>: Abbrev Number: 10 (DW_TAG_structure_type)
    <809>   DW_AT_name        : (indirect string, offset: 0x253e): UML_Property
    <80d>   DW_AT_byte_size   : 32
    <80e>   DW_AT_decl_file   : 6
    <80f>   DW_AT_decl_line   : 640
    <811>   DW_AT_sibling     : <0x87e>
 <2><815>: Abbrev Number: 11 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <81a>   DW_AT_decl_file   : 6
    <81b>   DW_AT_decl_line   : 641
    <81d>   DW_AT_type        : <0x1f1>
    <821>   DW_AT_data_member_location: 0
 <2><822>: Abbrev Number: 11 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <827>   DW_AT_decl_file   : 6
    <828>   DW_AT_decl_line   : 642
    <82a>   DW_AT_type        : <0x33f>
    <82e>   DW_AT_data_member_location: 4
 <2><82f>: Abbrev Number: 11 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <834>   DW_AT_decl_file   : 6
    <835>   DW_AT_decl_line   : 642
    <837>   DW_AT_type        : <0xa0>
    <83b>   DW_AT_data_member_location: 8
 <2><83c>: Abbrev Number: 11 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0xc82): type
    <841>   DW_AT_decl_file   : 6
    <842>   DW_AT_decl_line   : 643
    <844>   DW_AT_type        : <0xe0b>
    <848>   DW_AT_data_member_location: 12
 <2><849>: Abbrev Number: 11 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x21f4): lower
    <84e>   DW_AT_decl_file   : 6
    <84f>   DW_AT_decl_line   : 644
    <851>   DW_AT_type        : <0x2c>
    <855>   DW_AT_data_member_location: 16
 <2><856>: Abbrev Number: 11 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x77fe): association
    <85b>   DW_AT_decl_file   : 6
    <85c>   DW_AT_decl_line   : 645
    <85e>   DW_AT_type        : <0xe17>
    <862>   DW_AT_data_member_location: 20
 <2><863>: Abbrev Number: 11 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x447f): aggregation
    <868>   DW_AT_decl_file   : 6
    <869>   DW_AT_decl_line   : 645
    <86b>   DW_AT_type        : <0x3cb>
    <86f>   DW_AT_data_member_location: 24
 <2><870>: Abbrev Number: 11 (DW_TAG_member)
    <871>   DW_AT_name        : (indirect string, offset: 0x1593): class
    <875>   DW_AT_decl_file   : 6
    <876>   DW_AT_decl_line   : 645
    <878>   DW_AT_type        : <0xe0b>
    <87c>   DW_AT_data_member_location: 28
 <2><87d>: Abbrev Number: 0
 <1><87e>: Abbrev Number: 4 (DW_TAG_typedef)
    <87f>   DW_AT_name        : (indirect string, offset: 0x44d1): UML_Transition
    <883>   DW_AT_decl_file   : 6
    <884>   DW_AT_decl_line   : 176
    <885>   DW_AT_type        : <0x889>
 <1><889>: Abbrev Number: 10 (DW_TAG_structure_type)
    <88a>   DW_AT_name        : (indirect string, offset: 0x44d1): UML_Transition
    <88e>   DW_AT_byte_size   : 32
    <88f>   DW_AT_decl_file   : 6
    <890>   DW_AT_decl_line   : 655
    <892>   DW_AT_sibling     : <0x8ff>
 <2><896>: Abbrev Number: 11 (DW_TAG_member)
    <897>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <89b>   DW_AT_decl_file   : 6
    <89c>   DW_AT_decl_line   : 656
    <89e>   DW_AT_type        : <0x1f1>
    <8a2>   DW_AT_data_member_location: 0
 <2><8a3>: Abbrev Number: 11 (DW_TAG_member)
    <8a4>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <8a8>   DW_AT_decl_file   : 6
    <8a9>   DW_AT_decl_line   : 657
    <8ab>   DW_AT_type        : <0x33f>
    <8af>   DW_AT_data_member_location: 4
 <2><8b0>: Abbrev Number: 11 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <8b5>   DW_AT_decl_file   : 6
    <8b6>   DW_AT_decl_line   : 657
    <8b8>   DW_AT_type        : <0xa0>
    <8bc>   DW_AT_data_member_location: 8
 <2><8bd>: Abbrev Number: 11 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0x6c6): guard
    <8c2>   DW_AT_decl_file   : 6
    <8c3>   DW_AT_decl_line   : 658
    <8c5>   DW_AT_type        : <0xe59>
    <8c9>   DW_AT_data_member_location: 12
 <2><8ca>: Abbrev Number: 11 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x4d70): effect
    <8cf>   DW_AT_decl_file   : 6
    <8d0>   DW_AT_decl_line   : 658
    <8d2>   DW_AT_type        : <0xe5f>
    <8d6>   DW_AT_data_member_location: 16
 <2><8d7>: Abbrev Number: 11 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x471f): trigger
    <8dc>   DW_AT_decl_file   : 6
    <8dd>   DW_AT_decl_line   : 658
    <8df>   DW_AT_type        : <0xe65>
    <8e3>   DW_AT_data_member_location: 20
 <2><8e4>: Abbrev Number: 11 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x27b0): source
    <8e9>   DW_AT_decl_file   : 6
    <8ea>   DW_AT_decl_line   : 658
    <8ec>   DW_AT_type        : <0xe6b>
    <8f0>   DW_AT_data_member_location: 24
 <2><8f1>: Abbrev Number: 11 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x36e3): target
    <8f6>   DW_AT_decl_file   : 6
    <8f7>   DW_AT_decl_line   : 658
    <8f9>   DW_AT_type        : <0xe6b>
    <8fd>   DW_AT_data_member_location: 28
 <2><8fe>: Abbrev Number: 0
 <1><8ff>: Abbrev Number: 4 (DW_TAG_typedef)
    <900>   DW_AT_name        : (indirect string, offset: 0x329f): UML_PrimitiveType
    <904>   DW_AT_decl_file   : 6
    <905>   DW_AT_decl_line   : 179
    <906>   DW_AT_type        : <0x90a>
 <1><90a>: Abbrev Number: 10 (DW_TAG_structure_type)
    <90b>   DW_AT_name        : (indirect string, offset: 0x329f): UML_PrimitiveType
    <90f>   DW_AT_byte_size   : 16
    <910>   DW_AT_decl_file   : 6
    <911>   DW_AT_decl_line   : 692
    <913>   DW_AT_sibling     : <0x94c>
 <2><917>: Abbrev Number: 11 (DW_TAG_member)
    <918>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <91c>   DW_AT_decl_file   : 6
    <91d>   DW_AT_decl_line   : 693
    <91f>   DW_AT_type        : <0x1f1>
    <923>   DW_AT_data_member_location: 0
 <2><924>: Abbrev Number: 11 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <929>   DW_AT_decl_file   : 6
    <92a>   DW_AT_decl_line   : 694
    <92c>   DW_AT_type        : <0x33f>
    <930>   DW_AT_data_member_location: 4
 <2><931>: Abbrev Number: 11 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <936>   DW_AT_decl_file   : 6
    <937>   DW_AT_decl_line   : 694
    <939>   DW_AT_type        : <0xa0>
    <93d>   DW_AT_data_member_location: 8
 <2><93e>: Abbrev Number: 11 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <943>   DW_AT_decl_file   : 6
    <944>   DW_AT_decl_line   : 695
    <946>   DW_AT_type        : <0x198>
    <94a>   DW_AT_data_member_location: 12
 <2><94b>: Abbrev Number: 0
 <1><94c>: Abbrev Number: 4 (DW_TAG_typedef)
    <94d>   DW_AT_name        : (indirect string, offset: 0x5a59): UML_StateMachine
    <951>   DW_AT_decl_file   : 6
    <952>   DW_AT_decl_line   : 180
    <953>   DW_AT_type        : <0x957>
 <1><957>: Abbrev Number: 10 (DW_TAG_structure_type)
    <958>   DW_AT_name        : (indirect string, offset: 0x5a59): UML_StateMachine
    <95c>   DW_AT_byte_size   : 16
    <95d>   DW_AT_decl_file   : 6
    <95e>   DW_AT_decl_line   : 705
    <960>   DW_AT_sibling     : <0x999>
 <2><964>: Abbrev Number: 11 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <969>   DW_AT_decl_file   : 6
    <96a>   DW_AT_decl_line   : 706
    <96c>   DW_AT_type        : <0x1f1>
    <970>   DW_AT_data_member_location: 0
 <2><971>: Abbrev Number: 11 (DW_TAG_member)
    <972>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <976>   DW_AT_decl_file   : 6
    <977>   DW_AT_decl_line   : 707
    <979>   DW_AT_type        : <0x33f>
    <97d>   DW_AT_data_member_location: 4
 <2><97e>: Abbrev Number: 11 (DW_TAG_member)
    <97f>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <983>   DW_AT_decl_file   : 6
    <984>   DW_AT_decl_line   : 707
    <986>   DW_AT_type        : <0xa0>
    <98a>   DW_AT_data_member_location: 8
 <2><98b>: Abbrev Number: 11 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0x5ef8): region
    <990>   DW_AT_decl_file   : 6
    <991>   DW_AT_decl_line   : 708
    <993>   DW_AT_type        : <0xe7d>
    <997>   DW_AT_data_member_location: 12
 <2><998>: Abbrev Number: 0
 <1><999>: Abbrev Number: 4 (DW_TAG_typedef)
    <99a>   DW_AT_name        : (indirect string, offset: 0x5c6f): UML_Behavior
    <99e>   DW_AT_decl_file   : 6
    <99f>   DW_AT_decl_line   : 183
    <9a0>   DW_AT_type        : <0x9a4>
 <1><9a4>: Abbrev Number: 10 (DW_TAG_structure_type)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x5c6f): UML_Behavior
    <9a9>   DW_AT_byte_size   : 8
    <9aa>   DW_AT_decl_file   : 6
    <9ab>   DW_AT_decl_line   : 742
    <9ad>   DW_AT_sibling     : <0x9cc>
 <2><9b1>: Abbrev Number: 11 (DW_TAG_member)
    <9b2>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <9b6>   DW_AT_decl_file   : 6
    <9b7>   DW_AT_decl_line   : 743
    <9b9>   DW_AT_type        : <0x1f1>
    <9bd>   DW_AT_data_member_location: 0
 <2><9be>: Abbrev Number: 11 (DW_TAG_member)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <9c3>   DW_AT_decl_file   : 6
    <9c4>   DW_AT_decl_line   : 744
    <9c6>   DW_AT_type        : <0x1e6>
    <9ca>   DW_AT_data_member_location: 4
 <2><9cb>: Abbrev Number: 0
 <1><9cc>: Abbrev Number: 4 (DW_TAG_typedef)
    <9cd>   DW_AT_name        : (indirect string, offset: 0x3c8): UML_OpaqueBehavior
    <9d1>   DW_AT_decl_file   : 6
    <9d2>   DW_AT_decl_line   : 184
    <9d3>   DW_AT_type        : <0x9d7>
 <1><9d7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <9d8>   DW_AT_name        : (indirect string, offset: 0x3c8): UML_OpaqueBehavior
    <9dc>   DW_AT_byte_size   : 28
    <9dd>   DW_AT_decl_file   : 6
    <9de>   DW_AT_decl_line   : 754
    <9e0>   DW_AT_sibling     : <0xa40>
 <2><9e4>: Abbrev Number: 11 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <9e9>   DW_AT_decl_file   : 6
    <9ea>   DW_AT_decl_line   : 755
    <9ec>   DW_AT_type        : <0x1f1>
    <9f0>   DW_AT_data_member_location: 0
 <2><9f1>: Abbrev Number: 11 (DW_TAG_member)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <9f6>   DW_AT_decl_file   : 6
    <9f7>   DW_AT_decl_line   : 756
    <9f9>   DW_AT_type        : <0x33f>
    <9fd>   DW_AT_data_member_location: 4
 <2><9fe>: Abbrev Number: 11 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <a03>   DW_AT_decl_file   : 6
    <a04>   DW_AT_decl_line   : 756
    <a06>   DW_AT_type        : <0xa0>
    <a0a>   DW_AT_data_member_location: 8
 <2><a0b>: Abbrev Number: 11 (DW_TAG_member)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <a10>   DW_AT_decl_file   : 6
    <a11>   DW_AT_decl_line   : 757
    <a13>   DW_AT_type        : <0x1e6>
    <a17>   DW_AT_data_member_location: 12
 <2><a18>: Abbrev Number: 11 (DW_TAG_member)
    <a19>   DW_AT_name        : (indirect string, offset: 0x4bd2): c_function
    <a1d>   DW_AT_decl_file   : 6
    <a1e>   DW_AT_decl_line   : 757
    <a20>   DW_AT_type        : <0x9e>
    <a24>   DW_AT_data_member_location: 16
 <2><a25>: Abbrev Number: 11 (DW_TAG_member)
    <a26>   DW_AT_name        : (indirect string, offset: 0x1d5a): language
    <a2a>   DW_AT_decl_file   : 6
    <a2b>   DW_AT_decl_line   : 757
    <a2d>   DW_AT_type        : <0xe35>
    <a31>   DW_AT_data_member_location: 20
 <2><a32>: Abbrev Number: 11 (DW_TAG_member)
    <a33>   DW_AT_name        : (indirect string, offset: 0x2539): body
    <a37>   DW_AT_decl_file   : 6
    <a38>   DW_AT_decl_line   : 757
    <a3a>   DW_AT_type        : <0xe35>
    <a3e>   DW_AT_data_member_location: 24
 <2><a3f>: Abbrev Number: 0
 <1><a40>: Abbrev Number: 4 (DW_TAG_typedef)
    <a41>   DW_AT_name        : (indirect string, offset: 0x677a): UML_State
    <a45>   DW_AT_decl_file   : 6
    <a46>   DW_AT_decl_line   : 185
    <a47>   DW_AT_type        : <0xa4b>
 <1><a4b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x677a): UML_State
    <a50>   DW_AT_byte_size   : 36
    <a51>   DW_AT_decl_file   : 6
    <a52>   DW_AT_decl_line   : 767
    <a54>   DW_AT_sibling     : <0xace>
 <2><a58>: Abbrev Number: 11 (DW_TAG_member)
    <a59>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <a5d>   DW_AT_decl_file   : 6
    <a5e>   DW_AT_decl_line   : 768
    <a60>   DW_AT_type        : <0x1f1>
    <a64>   DW_AT_data_member_location: 0
 <2><a65>: Abbrev Number: 11 (DW_TAG_member)
    <a66>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <a6a>   DW_AT_decl_file   : 6
    <a6b>   DW_AT_decl_line   : 769
    <a6d>   DW_AT_type        : <0x33f>
    <a71>   DW_AT_data_member_location: 4
 <2><a72>: Abbrev Number: 11 (DW_TAG_member)
    <a73>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <a77>   DW_AT_decl_file   : 6
    <a78>   DW_AT_decl_line   : 769
    <a7a>   DW_AT_type        : <0xa0>
    <a7e>   DW_AT_data_member_location: 8
 <2><a7f>: Abbrev Number: 11 (DW_TAG_member)
    <a80>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <a84>   DW_AT_decl_file   : 6
    <a85>   DW_AT_decl_line   : 770
    <a87>   DW_AT_type        : <0x1bc>
    <a8b>   DW_AT_data_member_location: 12
 <2><a8c>: Abbrev Number: 11 (DW_TAG_member)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x632d): incoming
    <a91>   DW_AT_decl_file   : 6
    <a92>   DW_AT_decl_line   : 770
    <a94>   DW_AT_type        : <0xe4d>
    <a98>   DW_AT_data_member_location: 16
 <2><a99>: Abbrev Number: 11 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x4f14): outgoing
    <a9e>   DW_AT_decl_file   : 6
    <a9f>   DW_AT_decl_line   : 770
    <aa1>   DW_AT_type        : <0xe4d>
    <aa5>   DW_AT_data_member_location: 20
 <2><aa6>: Abbrev Number: 11 (DW_TAG_member)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x579d): entry
    <aab>   DW_AT_decl_file   : 6
    <aac>   DW_AT_decl_line   : 771
    <aae>   DW_AT_type        : <0xe5f>
    <ab2>   DW_AT_data_member_location: 24
 <2><ab3>: Abbrev Number: 11 (DW_TAG_member)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x628e): exit
    <ab8>   DW_AT_decl_file   : 6
    <ab9>   DW_AT_decl_line   : 771
    <abb>   DW_AT_type        : <0xe5f>
    <abf>   DW_AT_data_member_location: 28
 <2><ac0>: Abbrev Number: 11 (DW_TAG_member)
    <ac1>   DW_AT_name        : (indirect string, offset: 0x5fd7): deferrableTrigger
    <ac5>   DW_AT_decl_file   : 6
    <ac6>   DW_AT_decl_line   : 771
    <ac8>   DW_AT_type        : <0xe65>
    <acc>   DW_AT_data_member_location: 32
 <2><acd>: Abbrev Number: 0
 <1><ace>: Abbrev Number: 4 (DW_TAG_typedef)
    <acf>   DW_AT_name        : (indirect string, offset: 0x1171): UML_Trigger
    <ad3>   DW_AT_decl_file   : 6
    <ad4>   DW_AT_decl_line   : 186
    <ad5>   DW_AT_type        : <0xad9>
 <1><ad9>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ada>   DW_AT_name        : (indirect string, offset: 0x1171): UML_Trigger
    <ade>   DW_AT_byte_size   : 20
    <adf>   DW_AT_decl_file   : 6
    <ae0>   DW_AT_decl_line   : 781
    <ae2>   DW_AT_sibling     : <0xb28>
 <2><ae6>: Abbrev Number: 11 (DW_TAG_member)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <aeb>   DW_AT_decl_file   : 6
    <aec>   DW_AT_decl_line   : 782
    <aee>   DW_AT_type        : <0x1f1>
    <af2>   DW_AT_data_member_location: 0
 <2><af3>: Abbrev Number: 11 (DW_TAG_member)
    <af4>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <af8>   DW_AT_decl_file   : 6
    <af9>   DW_AT_decl_line   : 783
    <afb>   DW_AT_type        : <0x33f>
    <aff>   DW_AT_data_member_location: 4
 <2><b00>: Abbrev Number: 11 (DW_TAG_member)
    <b01>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <b05>   DW_AT_decl_file   : 6
    <b06>   DW_AT_decl_line   : 783
    <b08>   DW_AT_type        : <0xa0>
    <b0c>   DW_AT_data_member_location: 8
 <2><b0d>: Abbrev Number: 11 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x67ce): port
    <b12>   DW_AT_decl_file   : 6
    <b13>   DW_AT_decl_line   : 784
    <b15>   DW_AT_type        : <0xe89>
    <b19>   DW_AT_data_member_location: 12
 <2><b1a>: Abbrev Number: 11 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x47a0): event
    <b1f>   DW_AT_decl_file   : 6
    <b20>   DW_AT_decl_line   : 784
    <b22>   DW_AT_type        : <0xdff>
    <b26>   DW_AT_data_member_location: 16
 <2><b27>: Abbrev Number: 0
 <1><b28>: Abbrev Number: 4 (DW_TAG_typedef)
    <b29>   DW_AT_name        : (indirect string, offset: 0x2d3): UML_Signal
    <b2d>   DW_AT_decl_file   : 6
    <b2e>   DW_AT_decl_line   : 188
    <b2f>   DW_AT_type        : <0xb33>
 <1><b33>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b34>   DW_AT_name        : (indirect string, offset: 0x2d3): UML_Signal
    <b38>   DW_AT_byte_size   : 16
    <b39>   DW_AT_decl_file   : 6
    <b3a>   DW_AT_decl_line   : 806
    <b3c>   DW_AT_sibling     : <0xb75>
 <2><b40>: Abbrev Number: 11 (DW_TAG_member)
    <b41>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <b45>   DW_AT_decl_file   : 6
    <b46>   DW_AT_decl_line   : 807
    <b48>   DW_AT_type        : <0x1f1>
    <b4c>   DW_AT_data_member_location: 0
 <2><b4d>: Abbrev Number: 11 (DW_TAG_member)
    <b4e>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <b52>   DW_AT_decl_file   : 6
    <b53>   DW_AT_decl_line   : 808
    <b55>   DW_AT_type        : <0x33f>
    <b59>   DW_AT_data_member_location: 4
 <2><b5a>: Abbrev Number: 11 (DW_TAG_member)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <b5f>   DW_AT_decl_file   : 6
    <b60>   DW_AT_decl_line   : 808
    <b62>   DW_AT_type        : <0xa0>
    <b66>   DW_AT_data_member_location: 8
 <2><b67>: Abbrev Number: 11 (DW_TAG_member)
    <b68>   DW_AT_name        : (indirect string, offset: 0x1b88): ownedAttribute
    <b6c>   DW_AT_decl_file   : 6
    <b6d>   DW_AT_decl_line   : 809
    <b6f>   DW_AT_type        : <0xe3b>
    <b73>   DW_AT_data_member_location: 12
 <2><b74>: Abbrev Number: 0
 <1><b75>: Abbrev Number: 4 (DW_TAG_typedef)
    <b76>   DW_AT_name        : (indirect string, offset: 0x1cbb): UML_Class
    <b7a>   DW_AT_decl_file   : 6
    <b7b>   DW_AT_decl_line   : 189
    <b7c>   DW_AT_type        : <0xb80>
 <1><b80>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b81>   DW_AT_name        : (indirect string, offset: 0x1cbb): UML_Class
    <b85>   DW_AT_byte_size   : 48
    <b86>   DW_AT_decl_file   : 6
    <b87>   DW_AT_decl_line   : 819
    <b89>   DW_AT_sibling     : <0xc2a>
 <2><b8d>: Abbrev Number: 11 (DW_TAG_member)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <b92>   DW_AT_decl_file   : 6
    <b93>   DW_AT_decl_line   : 820
    <b95>   DW_AT_type        : <0x1f1>
    <b99>   DW_AT_data_member_location: 0
 <2><b9a>: Abbrev Number: 11 (DW_TAG_member)
    <b9b>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <b9f>   DW_AT_decl_file   : 6
    <ba0>   DW_AT_decl_line   : 821
    <ba2>   DW_AT_type        : <0x33f>
    <ba6>   DW_AT_data_member_location: 4
 <2><ba7>: Abbrev Number: 11 (DW_TAG_member)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <bac>   DW_AT_decl_file   : 6
    <bad>   DW_AT_decl_line   : 821
    <baf>   DW_AT_type        : <0xa0>
    <bb3>   DW_AT_data_member_location: 8
 <2><bb4>: Abbrev Number: 11 (DW_TAG_member)
    <bb5>   DW_AT_name        : (indirect string, offset: 0x698b): ownedConnector
    <bb9>   DW_AT_decl_file   : 6
    <bba>   DW_AT_decl_line   : 822
    <bbc>   DW_AT_type        : <0xe71>
    <bc0>   DW_AT_data_member_location: 12
 <2><bc1>: Abbrev Number: 11 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x1b88): ownedAttribute
    <bc6>   DW_AT_decl_file   : 6
    <bc7>   DW_AT_decl_line   : 822
    <bc9>   DW_AT_type        : <0xe3b>
    <bcd>   DW_AT_data_member_location: 16
 <2><bce>: Abbrev Number: 11 (DW_TAG_member)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x1ee5): classifierBehavior
    <bd3>   DW_AT_decl_file   : 6
    <bd4>   DW_AT_decl_line   : 823
    <bd6>   DW_AT_type        : <0xe5f>
    <bda>   DW_AT_data_member_location: 20
 <2><bdb>: Abbrev Number: 11 (DW_TAG_member)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x71df): interfaceRealization
    <be0>   DW_AT_decl_file   : 6
    <be1>   DW_AT_decl_line   : 823
    <be3>   DW_AT_type        : <0xe95>
    <be7>   DW_AT_data_member_location: 24
 <2><be8>: Abbrev Number: 11 (DW_TAG_member)
    <be9>   DW_AT_name        : (indirect string, offset: 0x4432): ownedPort
    <bed>   DW_AT_decl_file   : 6
    <bee>   DW_AT_decl_line   : 824
    <bf0>   DW_AT_type        : <0xe89>
    <bf4>   DW_AT_data_member_location: 28
 <2><bf5>: Abbrev Number: 11 (DW_TAG_member)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x67c7): c_kind
    <bfa>   DW_AT_decl_file   : 6
    <bfb>   DW_AT_decl_line   : 825
    <bfd>   DW_AT_type        : <0x198>
    <c01>   DW_AT_data_member_location: 32
 <2><c02>: Abbrev Number: 11 (DW_TAG_member)
    <c03>   DW_AT_name        : (indirect string, offset: 0x30d): superClass
    <c07>   DW_AT_decl_file   : 6
    <c08>   DW_AT_decl_line   : 825
    <c0a>   DW_AT_type        : <0xe05>
    <c0e>   DW_AT_data_member_location: 36
 <2><c0f>: Abbrev Number: 11 (DW_TAG_member)
    <c10>   DW_AT_name        : (indirect string, offset: 0x42df): isActive
    <c14>   DW_AT_decl_file   : 6
    <c15>   DW_AT_decl_line   : 825
    <c17>   DW_AT_type        : <0xea1>
    <c1b>   DW_AT_data_member_location: 40
 <2><c1c>: Abbrev Number: 11 (DW_TAG_member)
    <c1d>   DW_AT_name        : (indirect string, offset: 0x5ce5): ownedReception
    <c21>   DW_AT_decl_file   : 6
    <c22>   DW_AT_decl_line   : 825
    <c24>   DW_AT_type        : <0xe41>
    <c28>   DW_AT_data_member_location: 44
 <2><c29>: Abbrev Number: 0
 <1><c2a>: Abbrev Number: 4 (DW_TAG_typedef)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x3ff9): UML_Region
    <c2f>   DW_AT_decl_file   : 6
    <c30>   DW_AT_decl_line   : 191
    <c31>   DW_AT_type        : <0xc35>
 <1><c35>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c36>   DW_AT_name        : (indirect string, offset: 0x3ff9): UML_Region
    <c3a>   DW_AT_byte_size   : 20
    <c3b>   DW_AT_decl_file   : 6
    <c3c>   DW_AT_decl_line   : 847
    <c3e>   DW_AT_sibling     : <0xc84>
 <2><c42>: Abbrev Number: 11 (DW_TAG_member)
    <c43>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <c47>   DW_AT_decl_file   : 6
    <c48>   DW_AT_decl_line   : 848
    <c4a>   DW_AT_type        : <0x1f1>
    <c4e>   DW_AT_data_member_location: 0
 <2><c4f>: Abbrev Number: 11 (DW_TAG_member)
    <c50>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <c54>   DW_AT_decl_file   : 6
    <c55>   DW_AT_decl_line   : 849
    <c57>   DW_AT_type        : <0x33f>
    <c5b>   DW_AT_data_member_location: 4
 <2><c5c>: Abbrev Number: 11 (DW_TAG_member)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <c61>   DW_AT_decl_file   : 6
    <c62>   DW_AT_decl_line   : 849
    <c64>   DW_AT_type        : <0xa0>
    <c68>   DW_AT_data_member_location: 8
 <2><c69>: Abbrev Number: 11 (DW_TAG_member)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x1dcc): subvertex
    <c6e>   DW_AT_decl_file   : 6
    <c6f>   DW_AT_decl_line   : 850
    <c71>   DW_AT_type        : <0xea8>
    <c75>   DW_AT_data_member_location: 12
 <2><c76>: Abbrev Number: 11 (DW_TAG_member)
    <c77>   DW_AT_name        : (indirect string, offset: 0x13a): transition
    <c7b>   DW_AT_decl_file   : 6
    <c7c>   DW_AT_decl_line   : 850
    <c7e>   DW_AT_type        : <0xe4d>
    <c82>   DW_AT_data_member_location: 16
 <2><c83>: Abbrev Number: 0
 <1><c84>: Abbrev Number: 4 (DW_TAG_typedef)
    <c85>   DW_AT_name        : (indirect string, offset: 0x32d2): UML_Enumeration
    <c89>   DW_AT_decl_file   : 6
    <c8a>   DW_AT_decl_line   : 192
    <c8b>   DW_AT_type        : <0xc8f>
 <1><c8f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c90>   DW_AT_name        : (indirect string, offset: 0x32d2): UML_Enumeration
    <c94>   DW_AT_byte_size   : 16
    <c95>   DW_AT_decl_file   : 6
    <c96>   DW_AT_decl_line   : 860
    <c98>   DW_AT_sibling     : <0xcd1>
 <2><c9c>: Abbrev Number: 11 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <ca1>   DW_AT_decl_file   : 6
    <ca2>   DW_AT_decl_line   : 861
    <ca4>   DW_AT_type        : <0x1f1>
    <ca8>   DW_AT_data_member_location: 0
 <2><ca9>: Abbrev Number: 11 (DW_TAG_member)
    <caa>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <cae>   DW_AT_decl_file   : 6
    <caf>   DW_AT_decl_line   : 862
    <cb1>   DW_AT_type        : <0x33f>
    <cb5>   DW_AT_data_member_location: 4
 <2><cb6>: Abbrev Number: 11 (DW_TAG_member)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <cbb>   DW_AT_decl_file   : 6
    <cbc>   DW_AT_decl_line   : 862
    <cbe>   DW_AT_type        : <0xa0>
    <cc2>   DW_AT_data_member_location: 8
 <2><cc3>: Abbrev Number: 11 (DW_TAG_member)
    <cc4>   DW_AT_name        : (indirect string, offset: 0x5a97): ownedLiteral
    <cc8>   DW_AT_decl_file   : 6
    <cc9>   DW_AT_decl_line   : 863
    <ccb>   DW_AT_type        : <0xeae>
    <ccf>   DW_AT_data_member_location: 12
 <2><cd0>: Abbrev Number: 0
 <1><cd1>: Abbrev Number: 4 (DW_TAG_typedef)
    <cd2>   DW_AT_name        : (indirect string, offset: 0x45d0): UML_Port
    <cd6>   DW_AT_decl_file   : 6
    <cd7>   DW_AT_decl_line   : 193
    <cd8>   DW_AT_type        : <0xcdc>
 <1><cdc>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x45d0): UML_Port
    <ce1>   DW_AT_byte_size   : 52
    <ce2>   DW_AT_decl_file   : 6
    <ce3>   DW_AT_decl_line   : 873
    <ce5>   DW_AT_sibling     : <0xda0>
 <2><ce9>: Abbrev Number: 11 (DW_TAG_member)
    <cea>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <cee>   DW_AT_decl_file   : 6
    <cef>   DW_AT_decl_line   : 874
    <cf1>   DW_AT_type        : <0x1f1>
    <cf5>   DW_AT_data_member_location: 0
 <2><cf6>: Abbrev Number: 11 (DW_TAG_member)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <cfb>   DW_AT_decl_file   : 6
    <cfc>   DW_AT_decl_line   : 875
    <cfe>   DW_AT_type        : <0x33f>
    <d02>   DW_AT_data_member_location: 4
 <2><d03>: Abbrev Number: 11 (DW_TAG_member)
    <d04>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <d08>   DW_AT_decl_file   : 6
    <d09>   DW_AT_decl_line   : 875
    <d0b>   DW_AT_type        : <0xa0>
    <d0f>   DW_AT_data_member_location: 8
 <2><d10>: Abbrev Number: 11 (DW_TAG_member)
    <d11>   DW_AT_name        : (indirect string, offset: 0x77fe): association
    <d15>   DW_AT_decl_file   : 6
    <d16>   DW_AT_decl_line   : 876
    <d18>   DW_AT_type        : <0xe17>
    <d1c>   DW_AT_data_member_location: 12
 <2><d1d>: Abbrev Number: 11 (DW_TAG_member)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x447f): aggregation
    <d22>   DW_AT_decl_file   : 6
    <d23>   DW_AT_decl_line   : 876
    <d25>   DW_AT_type        : <0x3cb>
    <d29>   DW_AT_data_member_location: 16
 <2><d2a>: Abbrev Number: 11 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x1593): class
    <d2f>   DW_AT_decl_file   : 6
    <d30>   DW_AT_decl_line   : 876
    <d32>   DW_AT_type        : <0xe0b>
    <d36>   DW_AT_data_member_location: 20
 <2><d37>: Abbrev Number: 11 (DW_TAG_member)
    <d38>   DW_AT_name        : (indirect string, offset: 0xc82): type
    <d3c>   DW_AT_decl_file   : 6
    <d3d>   DW_AT_decl_line   : 877
    <d3f>   DW_AT_type        : <0xe0b>
    <d43>   DW_AT_data_member_location: 24
 <2><d44>: Abbrev Number: 12 (DW_TAG_member)
    <d45>   DW_AT_name        : end
    <d49>   DW_AT_decl_file   : 6
    <d4a>   DW_AT_decl_line   : 878
    <d4c>   DW_AT_type        : <0xe29>
    <d50>   DW_AT_data_member_location: 28
 <2><d51>: Abbrev Number: 11 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0x21f4): lower
    <d56>   DW_AT_decl_file   : 6
    <d57>   DW_AT_decl_line   : 879
    <d59>   DW_AT_type        : <0x2c>
    <d5d>   DW_AT_data_member_location: 32
 <2><d5e>: Abbrev Number: 11 (DW_TAG_member)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x57fd): c_index
    <d63>   DW_AT_decl_file   : 6
    <d64>   DW_AT_decl_line   : 880
    <d66>   DW_AT_type        : <0xd9>
    <d6a>   DW_AT_data_member_location: 36
 <2><d6b>: Abbrev Number: 11 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x17b1): isConjugated
    <d70>   DW_AT_decl_file   : 6
    <d71>   DW_AT_decl_line   : 880
    <d73>   DW_AT_type        : <0xea1>
    <d77>   DW_AT_data_member_location: 37
 <2><d78>: Abbrev Number: 11 (DW_TAG_member)
    <d79>   DW_AT_name        : (indirect string, offset: 0x2de): provided
    <d7d>   DW_AT_decl_file   : 6
    <d7e>   DW_AT_decl_line   : 880
    <d80>   DW_AT_type        : <0xeba>
    <d84>   DW_AT_data_member_location: 40
 <2><d85>: Abbrev Number: 11 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0x2162): isBehavior
    <d8a>   DW_AT_decl_file   : 6
    <d8b>   DW_AT_decl_line   : 880
    <d8d>   DW_AT_type        : <0xea1>
    <d91>   DW_AT_data_member_location: 44
 <2><d92>: Abbrev Number: 11 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0x704c): required
    <d97>   DW_AT_decl_file   : 6
    <d98>   DW_AT_decl_line   : 880
    <d9a>   DW_AT_type        : <0xeba>
    <d9e>   DW_AT_data_member_location: 48
 <2><d9f>: Abbrev Number: 0
 <1><da0>: Abbrev Number: 4 (DW_TAG_typedef)
    <da1>   DW_AT_name        : (indirect string, offset: 0x44fd): UML_EnumerationLiteral
    <da5>   DW_AT_decl_file   : 6
    <da6>   DW_AT_decl_line   : 194
    <da7>   DW_AT_type        : <0xdab>
 <1><dab>: Abbrev Number: 10 (DW_TAG_structure_type)
    <dac>   DW_AT_name        : (indirect string, offset: 0x44fd): UML_EnumerationLiteral
    <db0>   DW_AT_byte_size   : 16
    <db1>   DW_AT_decl_file   : 6
    <db2>   DW_AT_decl_line   : 890
    <db4>   DW_AT_sibling     : <0xded>
 <2><db8>: Abbrev Number: 11 (DW_TAG_member)
    <db9>   DW_AT_name        : (indirect string, offset: 0x5475): c_type
    <dbd>   DW_AT_decl_file   : 6
    <dbe>   DW_AT_decl_line   : 891
    <dc0>   DW_AT_type        : <0x1f1>
    <dc4>   DW_AT_data_member_location: 0
 <2><dc5>: Abbrev Number: 11 (DW_TAG_member)
    <dc6>   DW_AT_name        : (indirect string, offset: 0x1eb1): visibility
    <dca>   DW_AT_decl_file   : 6
    <dcb>   DW_AT_decl_line   : 892
    <dcd>   DW_AT_type        : <0x33f>
    <dd1>   DW_AT_data_member_location: 4
 <2><dd2>: Abbrev Number: 11 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <dd7>   DW_AT_decl_file   : 6
    <dd8>   DW_AT_decl_line   : 892
    <dda>   DW_AT_type        : <0xa0>
    <dde>   DW_AT_data_member_location: 8
 <2><ddf>: Abbrev Number: 11 (DW_TAG_member)
    <de0>   DW_AT_name        : (indirect string, offset: 0x57fd): c_index
    <de4>   DW_AT_decl_file   : 6
    <de5>   DW_AT_decl_line   : 893
    <de7>   DW_AT_type        : <0xd9>
    <deb>   DW_AT_data_member_location: 12
 <2><dec>: Abbrev Number: 0
 <1><ded>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dee>   DW_AT_byte_size   : 4
    <def>   DW_AT_type        : <0xdf3>
 <1><df3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <df4>   DW_AT_byte_size   : 4
    <df5>   DW_AT_type        : <0xb28>
 <1><df9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dfa>   DW_AT_byte_size   : 4
    <dfb>   DW_AT_type        : <0xdff>
 <1><dff>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e00>   DW_AT_byte_size   : 4
    <e01>   DW_AT_type        : <0x493>
 <1><e05>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e06>   DW_AT_byte_size   : 4
    <e07>   DW_AT_type        : <0xe0b>
 <1><e0b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e0c>   DW_AT_byte_size   : 4
    <e0d>   DW_AT_type        : <0xb75>
 <1><e11>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e12>   DW_AT_byte_size   : 4
    <e13>   DW_AT_type        : <0xe17>
 <1><e17>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e18>   DW_AT_byte_size   : 4
    <e19>   DW_AT_type        : <0x770>
 <1><e1d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e1e>   DW_AT_byte_size   : 4
    <e1f>   DW_AT_type        : <0x7d7>
 <1><e23>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e24>   DW_AT_byte_size   : 4
    <e25>   DW_AT_type        : <0x7fd>
 <1><e29>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e2a>   DW_AT_byte_size   : 4
    <e2b>   DW_AT_type        : <0x446>
 <1><e2f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e30>   DW_AT_byte_size   : 4
    <e31>   DW_AT_type        : <0x5e1>
 <1><e35>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e36>   DW_AT_byte_size   : 4
    <e37>   DW_AT_type        : <0xa0>
 <1><e3b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e3c>   DW_AT_byte_size   : 4
    <e3d>   DW_AT_type        : <0xe23>
 <1><e41>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e42>   DW_AT_byte_size   : 4
    <e43>   DW_AT_type        : <0xe47>
 <1><e47>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e48>   DW_AT_byte_size   : 4
    <e49>   DW_AT_type        : <0x648>
 <1><e4d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e4e>   DW_AT_byte_size   : 4
    <e4f>   DW_AT_type        : <0xe53>
 <1><e53>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e54>   DW_AT_byte_size   : 4
    <e55>   DW_AT_type        : <0x87e>
 <1><e59>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e5a>   DW_AT_byte_size   : 4
    <e5b>   DW_AT_type        : <0x3f9>
 <1><e5f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e60>   DW_AT_byte_size   : 4
    <e61>   DW_AT_type        : <0x999>
 <1><e65>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e66>   DW_AT_byte_size   : 4
    <e67>   DW_AT_type        : <0xace>
 <1><e6b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e6c>   DW_AT_byte_size   : 4
    <e6d>   DW_AT_type        : <0x709>
 <1><e71>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e72>   DW_AT_byte_size   : 4
    <e73>   DW_AT_type        : <0xe77>
 <1><e77>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e78>   DW_AT_byte_size   : 4
    <e79>   DW_AT_type        : <0x4ed>
 <1><e7d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e7e>   DW_AT_byte_size   : 4
    <e7f>   DW_AT_type        : <0xe83>
 <1><e83>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e84>   DW_AT_byte_size   : 4
    <e85>   DW_AT_type        : <0xc2a>
 <1><e89>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e8a>   DW_AT_byte_size   : 4
    <e8b>   DW_AT_type        : <0xe8f>
 <1><e8f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e90>   DW_AT_byte_size   : 4
    <e91>   DW_AT_type        : <0xcd1>
 <1><e95>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e96>   DW_AT_byte_size   : 4
    <e97>   DW_AT_type        : <0xe9b>
 <1><e9b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e9c>   DW_AT_byte_size   : 4
    <e9d>   DW_AT_type        : <0x547>
 <1><ea1>: Abbrev Number: 2 (DW_TAG_base_type)
    <ea2>   DW_AT_byte_size   : 1
    <ea3>   DW_AT_encoding    : 2	(boolean)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x216d): _Bool
 <1><ea8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ea9>   DW_AT_byte_size   : 4
    <eaa>   DW_AT_type        : <0xe6b>
 <1><eae>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <eaf>   DW_AT_byte_size   : 4
    <eb0>   DW_AT_type        : <0xeb4>
 <1><eb4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <eb5>   DW_AT_byte_size   : 4
    <eb6>   DW_AT_type        : <0xda0>
 <1><eba>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ebb>   DW_AT_byte_size   : 4
    <ebc>   DW_AT_type        : <0xe2f>
 <1><ec0>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec1>   DW_AT_name        : (indirect string, offset: 0x5f6f): Fifo
    <ec5>   DW_AT_decl_file   : 7
    <ec6>   DW_AT_decl_line   : 16
    <ec7>   DW_AT_type        : <0xecb>
 <1><ecb>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x5f6f): Fifo
    <ed0>   DW_AT_byte_size   : 24
    <ed1>   DW_AT_decl_file   : 7
    <ed2>   DW_AT_decl_line   : 19
    <ed3>   DW_AT_sibling     : <0xf2b>
 <2><ed7>: Abbrev Number: 14 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x802e): data
    <edc>   DW_AT_decl_file   : 7
    <edd>   DW_AT_decl_line   : 20
    <ede>   DW_AT_type        : <0xf2b>
    <ee2>   DW_AT_data_member_location: 0
 <2><ee3>: Abbrev Number: 14 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x2bae): nb_layers
    <ee8>   DW_AT_decl_file   : 7
    <ee9>   DW_AT_decl_line   : 21
    <eea>   DW_AT_type        : <0xb8>
    <eee>   DW_AT_data_member_location: 4
 <2><eef>: Abbrev Number: 14 (DW_TAG_member)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x7f9): element_size
    <ef4>   DW_AT_decl_file   : 7
    <ef5>   DW_AT_decl_line   : 22
    <ef6>   DW_AT_type        : <0xf31>
    <efa>   DW_AT_data_member_location: 8
 <2><efb>: Abbrev Number: 15 (DW_TAG_member)
    <efc>   DW_AT_name        : nb
    <eff>   DW_AT_decl_file   : 7
    <f00>   DW_AT_decl_line   : 23
    <f01>   DW_AT_type        : <0xf37>
    <f05>   DW_AT_data_member_location: 12
 <2><f06>: Abbrev Number: 14 (DW_TAG_member)
    <f07>   DW_AT_name        : (indirect string, offset: 0x59a4): size
    <f0b>   DW_AT_decl_file   : 7
    <f0c>   DW_AT_decl_line   : 24
    <f0d>   DW_AT_type        : <0x147>
    <f11>   DW_AT_data_member_location: 16
 <2><f12>: Abbrev Number: 14 (DW_TAG_member)
    <f13>   DW_AT_name        : (indirect string, offset: 0x61f0): writing
    <f17>   DW_AT_decl_file   : 7
    <f18>   DW_AT_decl_line   : 25
    <f19>   DW_AT_type        : <0x147>
    <f1d>   DW_AT_data_member_location: 17
 <2><f1e>: Abbrev Number: 14 (DW_TAG_member)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x5009): reorganize_buffer
    <f23>   DW_AT_decl_file   : 7
    <f24>   DW_AT_decl_line   : 26
    <f25>   DW_AT_type        : <0x9e>
    <f29>   DW_AT_data_member_location: 20
 <2><f2a>: Abbrev Number: 0
 <1><f2b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f2c>   DW_AT_byte_size   : 4
    <f2d>   DW_AT_type        : <0x9e>
 <1><f31>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f32>   DW_AT_byte_size   : 4
    <f33>   DW_AT_type        : <0xce>
 <1><f37>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f38>   DW_AT_byte_size   : 4
    <f39>   DW_AT_type        : <0x147>
 <1><f3d>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x5f74): EventPool
    <f42>   DW_AT_decl_file   : 8
    <f43>   DW_AT_decl_line   : 21
    <f44>   DW_AT_type        : <0xf48>
 <1><f48>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f49>   DW_AT_name        : (indirect string, offset: 0x5f74): EventPool
    <f4d>   DW_AT_byte_size   : 40
    <f4e>   DW_AT_decl_file   : 8
    <f4f>   DW_AT_decl_line   : 100
    <f50>   DW_AT_sibling     : <0xf6d>
 <2><f54>: Abbrev Number: 14 (DW_TAG_member)
    <f55>   DW_AT_name        : (indirect string, offset: 0x43c2): fifo
    <f59>   DW_AT_decl_file   : 8
    <f5a>   DW_AT_decl_line   : 101
    <f5b>   DW_AT_type        : <0xec0>
    <f5f>   DW_AT_data_member_location: 0
 <2><f60>: Abbrev Number: 14 (DW_TAG_member)
    <f61>   DW_AT_name        : (indirect string, offset: 0x2b5c): meta
    <f65>   DW_AT_decl_file   : 8
    <f66>   DW_AT_decl_line   : 102
    <f67>   DW_AT_type        : <0xf9d>
    <f6b>   DW_AT_data_member_location: 24
 <2><f6c>: Abbrev Number: 0
 <1><f6d>: Abbrev Number: 4 (DW_TAG_typedef)
    <f6e>   DW_AT_name        : (indirect string, offset: 0x3566): EventPoolStore
    <f72>   DW_AT_decl_file   : 8
    <f73>   DW_AT_decl_line   : 22
    <f74>   DW_AT_type        : <0xf78>
 <1><f78>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f79>   DW_AT_name        : (indirect string, offset: 0x3566): EventPoolStore
    <f7d>   DW_AT_byte_size   : 9
    <f7e>   DW_AT_decl_file   : 8
    <f7f>   DW_AT_decl_line   : 73
    <f80>   DW_AT_sibling     : <0xf9d>
 <2><f84>: Abbrev Number: 14 (DW_TAG_member)
    <f85>   DW_AT_name        : (indirect string, offset: 0x5dbd): nbEvents
    <f89>   DW_AT_decl_file   : 8
    <f8a>   DW_AT_decl_line   : 74
    <f8b>   DW_AT_type        : <0x15d>
    <f8f>   DW_AT_data_member_location: 0
 <2><f90>: Abbrev Number: 14 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0x1938): eventOccurred
    <f95>   DW_AT_decl_file   : 8
    <f96>   DW_AT_decl_line   : 75
    <f97>   DW_AT_type        : <0x1015>
    <f9b>   DW_AT_data_member_location: 1
 <2><f9c>: Abbrev Number: 0
 <1><f9d>: Abbrev Number: 4 (DW_TAG_typedef)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x834): EventPoolMeta
    <fa2>   DW_AT_decl_file   : 8
    <fa3>   DW_AT_decl_line   : 23
    <fa4>   DW_AT_type        : <0xfa8>
 <1><fa8>: Abbrev Number: 13 (DW_TAG_structure_type)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x834): EventPoolMeta
    <fad>   DW_AT_byte_size   : 16
    <fae>   DW_AT_decl_file   : 8
    <faf>   DW_AT_decl_line   : 83
    <fb0>   DW_AT_sibling     : <0xfe5>
 <2><fb4>: Abbrev Number: 14 (DW_TAG_member)
    <fb5>   DW_AT_name        : (indirect string, offset: 0x8001): eventSetSize
    <fb9>   DW_AT_decl_file   : 8
    <fba>   DW_AT_decl_line   : 84
    <fbb>   DW_AT_type        : <0x168>
    <fbf>   DW_AT_data_member_location: 0
 <2><fc0>: Abbrev Number: 14 (DW_TAG_member)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x13aa): eventSet
    <fc5>   DW_AT_decl_file   : 8
    <fc6>   DW_AT_decl_line   : 85
    <fc7>   DW_AT_type        : <0xded>
    <fcb>   DW_AT_data_member_location: 4
 <2><fcc>: Abbrev Number: 14 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x224f): paramsSize
    <fd1>   DW_AT_decl_file   : 8
    <fd2>   DW_AT_decl_line   : 86
    <fd3>   DW_AT_type        : <0xce>
    <fd7>   DW_AT_data_member_location: 8
 <2><fd8>: Abbrev Number: 14 (DW_TAG_member)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x13c6): nbDeferred
    <fdd>   DW_AT_decl_file   : 8
    <fde>   DW_AT_decl_line   : 87
    <fdf>   DW_AT_type        : <0x15d>
    <fe3>   DW_AT_data_member_location: 12
 <2><fe4>: Abbrev Number: 0
 <1><fe5>: Abbrev Number: 4 (DW_TAG_typedef)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x73df): EventId
    <fea>   DW_AT_decl_file   : 8
    <feb>   DW_AT_decl_line   : 24
    <fec>   DW_AT_type        : <0xff0>
 <1><ff0>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x73df): EventId
    <ff5>   DW_AT_byte_size   : 2
    <ff6>   DW_AT_decl_file   : 8
    <ff7>   DW_AT_decl_line   : 44
    <ff8>   DW_AT_sibling     : <0x1015>
 <2><ffc>: Abbrev Number: 14 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x7dbe): signalEventId
    <1001>   DW_AT_decl_file   : 8
    <1002>   DW_AT_decl_line   : 45
    <1003>   DW_AT_type        : <0xe4>
    <1007>   DW_AT_data_member_location: 0
 <2><1008>: Abbrev Number: 14 (DW_TAG_member)
    <1009>   DW_AT_name        : (indirect string, offset: 0x154e): portId
    <100d>   DW_AT_decl_file   : 8
    <100e>   DW_AT_decl_line   : 47
    <100f>   DW_AT_type        : <0xef>
    <1013>   DW_AT_data_member_location: 1
 <2><1014>: Abbrev Number: 0
 <1><1015>: Abbrev Number: 16 (DW_TAG_array_type)
    <1016>   DW_AT_type        : <0xfe5>
    <101a>   DW_AT_sibling     : <0x1025>
 <2><101e>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <101f>   DW_AT_type        : <0x97>
    <1023>   DW_AT_upper_bound : 3
 <2><1024>: Abbrev Number: 0
 <1><1025>: Abbrev Number: 4 (DW_TAG_typedef)
    <1026>   DW_AT_name        : (indirect string, offset: 0x23a4): ClassInfo
    <102a>   DW_AT_decl_file   : 9
    <102b>   DW_AT_decl_line   : 20
    <102c>   DW_AT_type        : <0x1030>
 <1><1030>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1031>   DW_AT_name        : (indirect string, offset: 0x23a4): ClassInfo
    <1035>   DW_AT_byte_size   : 4
    <1036>   DW_AT_decl_file   : 9
    <1037>   DW_AT_decl_line   : 28
    <1038>   DW_AT_sibling     : <0x1049>
 <2><103c>: Abbrev Number: 14 (DW_TAG_member)
    <103d>   DW_AT_name        : (indirect string, offset: 0xc82): type
    <1041>   DW_AT_decl_file   : 9
    <1042>   DW_AT_decl_line   : 29
    <1043>   DW_AT_type        : <0xe0b>
    <1047>   DW_AT_data_member_location: 0
 <2><1048>: Abbrev Number: 0
 <1><1049>: Abbrev Number: 4 (DW_TAG_typedef)
    <104a>   DW_AT_name        : (indirect string, offset: 0x35f8): Object
    <104e>   DW_AT_decl_file   : 9
    <104f>   DW_AT_decl_line   : 21
    <1050>   DW_AT_type        : <0x1054>
 <1><1054>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1055>   DW_AT_name        : (indirect string, offset: 0x35f8): Object
    <1059>   DW_AT_byte_size   : 32
    <105a>   DW_AT_decl_file   : 9
    <105b>   DW_AT_decl_line   : 76
    <105c>   DW_AT_sibling     : <0x10c1>
 <2><1060>: Abbrev Number: 14 (DW_TAG_member)
    <1061>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <1065>   DW_AT_decl_file   : 9
    <1066>   DW_AT_decl_line   : 77
    <1067>   DW_AT_type        : <0xa0>
    <106b>   DW_AT_data_member_location: 0
 <2><106c>: Abbrev Number: 14 (DW_TAG_member)
    <106d>   DW_AT_name        : (indirect string, offset: 0x2d34): classInfo
    <1071>   DW_AT_decl_file   : 9
    <1072>   DW_AT_decl_line   : 77
    <1073>   DW_AT_type        : <0x10c1>
    <1077>   DW_AT_data_member_location: 4
 <2><1078>: Abbrev Number: 14 (DW_TAG_member)
    <1079>   DW_AT_name        : (indirect string, offset: 0x81a3): part
    <107d>   DW_AT_decl_file   : 9
    <107e>   DW_AT_decl_line   : 77
    <107f>   DW_AT_type        : <0xe23>
    <1083>   DW_AT_data_member_location: 8
 <2><1084>: Abbrev Number: 14 (DW_TAG_member)
    <1085>   DW_AT_name        : (indirect string, offset: 0x365f): properties_ro
    <1089>   DW_AT_decl_file   : 9
    <108a>   DW_AT_decl_line   : 77
    <108b>   DW_AT_type        : <0x9e>
    <108f>   DW_AT_data_member_location: 12
 <2><1090>: Abbrev Number: 14 (DW_TAG_member)
    <1091>   DW_AT_name        : (indirect string, offset: 0x4277): nb_properties_ro
    <1095>   DW_AT_decl_file   : 9
    <1096>   DW_AT_decl_line   : 77
    <1097>   DW_AT_type        : <0x13c>
    <109b>   DW_AT_data_member_location: 16
 <2><109c>: Abbrev Number: 14 (DW_TAG_member)
    <109d>   DW_AT_name        : (indirect string, offset: 0x6cbf): store
    <10a1>   DW_AT_decl_file   : 9
    <10a2>   DW_AT_decl_line   : 77
    <10a3>   DW_AT_type        : <0x9e>
    <10a7>   DW_AT_data_member_location: 20
 <2><10a8>: Abbrev Number: 14 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x380b): operations
    <10ad>   DW_AT_decl_file   : 9
    <10ae>   DW_AT_decl_line   : 77
    <10af>   DW_AT_type        : <0x9e>
    <10b3>   DW_AT_data_member_location: 24
 <2><10b4>: Abbrev Number: 14 (DW_TAG_member)
    <10b5>   DW_AT_name        : (indirect string, offset: 0x7055): multiplicity_id
    <10b9>   DW_AT_decl_file   : 9
    <10ba>   DW_AT_decl_line   : 77
    <10bb>   DW_AT_type        : <0x152>
    <10bf>   DW_AT_data_member_location: 28
 <2><10c0>: Abbrev Number: 0
 <1><10c1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10c2>   DW_AT_byte_size   : 4
    <10c3>   DW_AT_type        : <0x1025>
 <1><10c7>: Abbrev Number: 4 (DW_TAG_typedef)
    <10c8>   DW_AT_name        : (indirect string, offset: 0x4b72): PassiveObject
    <10cc>   DW_AT_decl_file   : 10
    <10cd>   DW_AT_decl_line   : 19
    <10ce>   DW_AT_type        : <0x10d2>
 <1><10d2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <10d3>   DW_AT_name        : (indirect string, offset: 0x4b72): PassiveObject
    <10d7>   DW_AT_byte_size   : 44
    <10d8>   DW_AT_decl_file   : 10
    <10d9>   DW_AT_decl_line   : 39
    <10da>   DW_AT_sibling     : <0x1163>
 <2><10de>: Abbrev Number: 14 (DW_TAG_member)
    <10df>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <10e3>   DW_AT_decl_file   : 10
    <10e4>   DW_AT_decl_line   : 40
    <10e5>   DW_AT_type        : <0xa0>
    <10e9>   DW_AT_data_member_location: 0
 <2><10ea>: Abbrev Number: 14 (DW_TAG_member)
    <10eb>   DW_AT_name        : (indirect string, offset: 0x2d34): classInfo
    <10ef>   DW_AT_decl_file   : 10
    <10f0>   DW_AT_decl_line   : 40
    <10f1>   DW_AT_type        : <0x10c1>
    <10f5>   DW_AT_data_member_location: 4
 <2><10f6>: Abbrev Number: 14 (DW_TAG_member)
    <10f7>   DW_AT_name        : (indirect string, offset: 0x81a3): part
    <10fb>   DW_AT_decl_file   : 10
    <10fc>   DW_AT_decl_line   : 40
    <10fd>   DW_AT_type        : <0xe23>
    <1101>   DW_AT_data_member_location: 8
 <2><1102>: Abbrev Number: 14 (DW_TAG_member)
    <1103>   DW_AT_name        : (indirect string, offset: 0x365f): properties_ro
    <1107>   DW_AT_decl_file   : 10
    <1108>   DW_AT_decl_line   : 40
    <1109>   DW_AT_type        : <0x9e>
    <110d>   DW_AT_data_member_location: 12
 <2><110e>: Abbrev Number: 14 (DW_TAG_member)
    <110f>   DW_AT_name        : (indirect string, offset: 0x4277): nb_properties_ro
    <1113>   DW_AT_decl_file   : 10
    <1114>   DW_AT_decl_line   : 40
    <1115>   DW_AT_type        : <0x13c>
    <1119>   DW_AT_data_member_location: 16
 <2><111a>: Abbrev Number: 14 (DW_TAG_member)
    <111b>   DW_AT_name        : (indirect string, offset: 0x6cbf): store
    <111f>   DW_AT_decl_file   : 10
    <1120>   DW_AT_decl_line   : 40
    <1121>   DW_AT_type        : <0x9e>
    <1125>   DW_AT_data_member_location: 20
 <2><1126>: Abbrev Number: 14 (DW_TAG_member)
    <1127>   DW_AT_name        : (indirect string, offset: 0x380b): operations
    <112b>   DW_AT_decl_file   : 10
    <112c>   DW_AT_decl_line   : 40
    <112d>   DW_AT_type        : <0x9e>
    <1131>   DW_AT_data_member_location: 24
 <2><1132>: Abbrev Number: 14 (DW_TAG_member)
    <1133>   DW_AT_name        : (indirect string, offset: 0x7055): multiplicity_id
    <1137>   DW_AT_decl_file   : 10
    <1138>   DW_AT_decl_line   : 40
    <1139>   DW_AT_type        : <0x152>
    <113d>   DW_AT_data_member_location: 28
 <2><113e>: Abbrev Number: 14 (DW_TAG_member)
    <113f>   DW_AT_name        : (indirect string, offset: 0x6cc): instance
    <1143>   DW_AT_decl_file   : 10
    <1144>   DW_AT_decl_line   : 40
    <1145>   DW_AT_type        : <0x9e>
    <1149>   DW_AT_data_member_location: 32
 <2><114a>: Abbrev Number: 14 (DW_TAG_member)
    <114b>   DW_AT_name        : (indirect string, offset: 0xaab): instanceSize
    <114f>   DW_AT_decl_file   : 10
    <1150>   DW_AT_decl_line   : 40
    <1151>   DW_AT_type        : <0xce>
    <1155>   DW_AT_data_member_location: 36
 <2><1156>: Abbrev Number: 14 (DW_TAG_member)
    <1157>   DW_AT_name        : (indirect string, offset: 0xc87): properties_rw
    <115b>   DW_AT_decl_file   : 10
    <115c>   DW_AT_decl_line   : 40
    <115d>   DW_AT_type        : <0x9e>
    <1161>   DW_AT_data_member_location: 40
 <2><1162>: Abbrev Number: 0
 <1><1163>: Abbrev Number: 4 (DW_TAG_typedef)
    <1164>   DW_AT_name        : (indirect string, offset: 0x703f): ActiveObject
    <1168>   DW_AT_decl_file   : 11
    <1169>   DW_AT_decl_line   : 24
    <116a>   DW_AT_type        : <0x116e>
 <1><116e>: Abbrev Number: 13 (DW_TAG_structure_type)
    <116f>   DW_AT_name        : (indirect string, offset: 0x703f): ActiveObject
    <1173>   DW_AT_byte_size   : 80
    <1174>   DW_AT_decl_file   : 11
    <1175>   DW_AT_decl_line   : 66
    <1176>   DW_AT_sibling     : <0x128f>
 <2><117a>: Abbrev Number: 14 (DW_TAG_member)
    <117b>   DW_AT_name        : (indirect string, offset: 0x67c2): name
    <117f>   DW_AT_decl_file   : 11
    <1180>   DW_AT_decl_line   : 67
    <1181>   DW_AT_type        : <0xa0>
    <1185>   DW_AT_data_member_location: 0
 <2><1186>: Abbrev Number: 14 (DW_TAG_member)
    <1187>   DW_AT_name        : (indirect string, offset: 0x2d34): classInfo
    <118b>   DW_AT_decl_file   : 11
    <118c>   DW_AT_decl_line   : 67
    <118d>   DW_AT_type        : <0x10c1>
    <1191>   DW_AT_data_member_location: 4
 <2><1192>: Abbrev Number: 14 (DW_TAG_member)
    <1193>   DW_AT_name        : (indirect string, offset: 0x81a3): part
    <1197>   DW_AT_decl_file   : 11
    <1198>   DW_AT_decl_line   : 67
    <1199>   DW_AT_type        : <0xe23>
    <119d>   DW_AT_data_member_location: 8
 <2><119e>: Abbrev Number: 14 (DW_TAG_member)
    <119f>   DW_AT_name        : (indirect string, offset: 0x365f): properties_ro
    <11a3>   DW_AT_decl_file   : 11
    <11a4>   DW_AT_decl_line   : 67
    <11a5>   DW_AT_type        : <0x9e>
    <11a9>   DW_AT_data_member_location: 12
 <2><11aa>: Abbrev Number: 14 (DW_TAG_member)
    <11ab>   DW_AT_name        : (indirect string, offset: 0x4277): nb_properties_ro
    <11af>   DW_AT_decl_file   : 11
    <11b0>   DW_AT_decl_line   : 67
    <11b1>   DW_AT_type        : <0x13c>
    <11b5>   DW_AT_data_member_location: 16
 <2><11b6>: Abbrev Number: 14 (DW_TAG_member)
    <11b7>   DW_AT_name        : (indirect string, offset: 0x6cbf): store
    <11bb>   DW_AT_decl_file   : 11
    <11bc>   DW_AT_decl_line   : 67
    <11bd>   DW_AT_type        : <0x9e>
    <11c1>   DW_AT_data_member_location: 20
 <2><11c2>: Abbrev Number: 14 (DW_TAG_member)
    <11c3>   DW_AT_name        : (indirect string, offset: 0x380b): operations
    <11c7>   DW_AT_decl_file   : 11
    <11c8>   DW_AT_decl_line   : 67
    <11c9>   DW_AT_type        : <0x9e>
    <11cd>   DW_AT_data_member_location: 24
 <2><11ce>: Abbrev Number: 14 (DW_TAG_member)
    <11cf>   DW_AT_name        : (indirect string, offset: 0x7055): multiplicity_id
    <11d3>   DW_AT_decl_file   : 11
    <11d4>   DW_AT_decl_line   : 67
    <11d5>   DW_AT_type        : <0x152>
    <11d9>   DW_AT_data_member_location: 28
 <2><11da>: Abbrev Number: 14 (DW_TAG_member)
    <11db>   DW_AT_name        : (indirect string, offset: 0x6cc): instance
    <11df>   DW_AT_decl_file   : 11
    <11e0>   DW_AT_decl_line   : 67
    <11e1>   DW_AT_type        : <0x9e>
    <11e5>   DW_AT_data_member_location: 32
 <2><11e6>: Abbrev Number: 14 (DW_TAG_member)
    <11e7>   DW_AT_name        : (indirect string, offset: 0xaab): instanceSize
    <11eb>   DW_AT_decl_file   : 11
    <11ec>   DW_AT_decl_line   : 67
    <11ed>   DW_AT_type        : <0xce>
    <11f1>   DW_AT_data_member_location: 36
 <2><11f2>: Abbrev Number: 14 (DW_TAG_member)
    <11f3>   DW_AT_name        : (indirect string, offset: 0xc87): properties_rw
    <11f7>   DW_AT_decl_file   : 11
    <11f8>   DW_AT_decl_line   : 67
    <11f9>   DW_AT_type        : <0x9e>
    <11fd>   DW_AT_data_member_location: 40
 <2><11fe>: Abbrev Number: 14 (DW_TAG_member)
    <11ff>   DW_AT_name        : (indirect string, offset: 0x36d6): stateMachine
    <1203>   DW_AT_decl_file   : 11
    <1204>   DW_AT_decl_line   : 68
    <1205>   DW_AT_type        : <0x128f>
    <1209>   DW_AT_data_member_location: 44
 <2><120a>: Abbrev Number: 14 (DW_TAG_member)
    <120b>   DW_AT_name        : (indirect string, offset: 0x52cf): eventParamsSize
    <120f>   DW_AT_decl_file   : 11
    <1210>   DW_AT_decl_line   : 69
    <1211>   DW_AT_type        : <0xce>
    <1215>   DW_AT_data_member_location: 48
 <2><1216>: Abbrev Number: 14 (DW_TAG_member)
    <1217>   DW_AT_name        : (indirect string, offset: 0x6d1a): eventPool
    <121b>   DW_AT_decl_file   : 11
    <121c>   DW_AT_decl_line   : 70
    <121d>   DW_AT_type        : <0x1295>
    <1221>   DW_AT_data_member_location: 52
 <2><1222>: Abbrev Number: 14 (DW_TAG_member)
    <1223>   DW_AT_name        : (indirect string, offset: 0x5009): reorganize_buffer
    <1227>   DW_AT_decl_file   : 11
    <1228>   DW_AT_decl_line   : 71
    <1229>   DW_AT_type        : <0x9e>
    <122d>   DW_AT_data_member_location: 56
 <2><122e>: Abbrev Number: 14 (DW_TAG_member)
    <122f>   DW_AT_name        : (indirect string, offset: 0x52df): fireables
    <1233>   DW_AT_decl_file   : 11
    <1234>   DW_AT_decl_line   : 72
    <1235>   DW_AT_type        : <0x129b>
    <1239>   DW_AT_data_member_location: 60
 <2><123a>: Abbrev Number: 14 (DW_TAG_member)
    <123b>   DW_AT_name        : (indirect string, offset: 0x3c81): nbFireables
    <123f>   DW_AT_decl_file   : 11
    <1240>   DW_AT_decl_line   : 73
    <1241>   DW_AT_type        : <0x110>
    <1245>   DW_AT_data_member_location: 64
 <2><1246>: Abbrev Number: 14 (DW_TAG_member)
    <1247>   DW_AT_name        : (indirect string, offset: 0xdf1): maxOutgoings
    <124b>   DW_AT_decl_file   : 11
    <124c>   DW_AT_decl_line   : 74
    <124d>   DW_AT_type        : <0x11b>
    <1251>   DW_AT_data_member_location: 65
 <2><1252>: Abbrev Number: 14 (DW_TAG_member)
    <1253>   DW_AT_name        : (indirect string, offset: 0x5b1): fireablesMax
    <1257>   DW_AT_decl_file   : 11
    <1258>   DW_AT_decl_line   : 75
    <1259>   DW_AT_type        : <0x110>
    <125d>   DW_AT_data_member_location: 66
 <2><125e>: Abbrev Number: 14 (DW_TAG_member)
    <125f>   DW_AT_name        : (indirect string, offset: 0x4288): fireablesLength
    <1263>   DW_AT_decl_file   : 11
    <1264>   DW_AT_decl_line   : 76
    <1265>   DW_AT_type        : <0x126>
    <1269>   DW_AT_data_member_location: 67
 <2><126a>: Abbrev Number: 14 (DW_TAG_member)
    <126b>   DW_AT_name        : (indirect string, offset: 0x49cd): store_cs
    <126f>   DW_AT_decl_file   : 11
    <1270>   DW_AT_decl_line   : 77
    <1271>   DW_AT_type        : <0xf31>
    <1275>   DW_AT_data_member_location: 68
 <2><1276>: Abbrev Number: 14 (DW_TAG_member)
    <1277>   DW_AT_name        : (indirect string, offset: 0x81c2): store_ep_params
    <127b>   DW_AT_decl_file   : 11
    <127c>   DW_AT_decl_line   : 78
    <127d>   DW_AT_type        : <0x9e>
    <1281>   DW_AT_data_member_location: 72
 <2><1282>: Abbrev Number: 14 (DW_TAG_member)
    <1283>   DW_AT_name        : (indirect string, offset: 0x219): in_environment
    <1287>   DW_AT_decl_file   : 11
    <1288>   DW_AT_decl_line   : 79
    <1289>   DW_AT_type        : <0xea1>
    <128d>   DW_AT_data_member_location: 76
 <2><128e>: Abbrev Number: 0
 <1><128f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1290>   DW_AT_byte_size   : 4
    <1291>   DW_AT_type        : <0x94c>
 <1><1295>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1296>   DW_AT_byte_size   : 4
    <1297>   DW_AT_type        : <0xf3d>
 <1><129b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <129c>   DW_AT_byte_size   : 4
    <129d>   DW_AT_type        : <0x11b>
 <1><12a1>: Abbrev Number: 4 (DW_TAG_typedef)
    <12a2>   DW_AT_name        : (indirect string, offset: 0x26c7): lightOn_signal_parameters
    <12a6>   DW_AT_decl_file   : 12
    <12a7>   DW_AT_decl_line   : 28
    <12a8>   DW_AT_type        : <0x12ac>
 <1><12ac>: Abbrev Number: 18 (DW_TAG_structure_type)
    <12ad>   DW_AT_name        : (indirect string, offset: 0x26c7): lightOn_signal_parameters
    <12b1>   DW_AT_byte_size   : 0
    <12b2>   DW_AT_decl_file   : 12
    <12b3>   DW_AT_decl_line   : 269
 <1><12b5>: Abbrev Number: 4 (DW_TAG_typedef)
    <12b6>   DW_AT_name        : (indirect string, offset: 0x3e65): lightOff_signal_parameters
    <12ba>   DW_AT_decl_file   : 12
    <12bb>   DW_AT_decl_line   : 29
    <12bc>   DW_AT_type        : <0x12c0>
 <1><12c0>: Abbrev Number: 18 (DW_TAG_structure_type)
    <12c1>   DW_AT_name        : (indirect string, offset: 0x3e65): lightOff_signal_parameters
    <12c5>   DW_AT_byte_size   : 0
    <12c6>   DW_AT_decl_file   : 12
    <12c7>   DW_AT_decl_line   : 274
 <1><12c9>: Abbrev Number: 4 (DW_TAG_typedef)
    <12ca>   DW_AT_name        : (indirect string, offset: 0x4c5d): buttonPressed_signal_parameters
    <12ce>   DW_AT_decl_file   : 12
    <12cf>   DW_AT_decl_line   : 30
    <12d0>   DW_AT_type        : <0x12d4>
 <1><12d4>: Abbrev Number: 18 (DW_TAG_structure_type)
    <12d5>   DW_AT_name        : (indirect string, offset: 0x4c5d): buttonPressed_signal_parameters
    <12d9>   DW_AT_byte_size   : 0
    <12da>   DW_AT_decl_file   : 12
    <12db>   DW_AT_decl_line   : 279
 <1><12dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <12de>   DW_AT_name        : (indirect string, offset: 0x11a0): buttonReleased_signal_parameters
    <12e2>   DW_AT_decl_file   : 12
    <12e3>   DW_AT_decl_line   : 31
    <12e4>   DW_AT_type        : <0x12e8>
 <1><12e8>: Abbrev Number: 18 (DW_TAG_structure_type)
    <12e9>   DW_AT_name        : (indirect string, offset: 0x11a0): buttonReleased_signal_parameters
    <12ed>   DW_AT_byte_size   : 0
    <12ee>   DW_AT_decl_file   : 12
    <12ef>   DW_AT_decl_line   : 284
 <1><12f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f2>   DW_AT_name        : (indirect string, offset: 0x1e97): LightPort_store
    <12f6>   DW_AT_decl_file   : 12
    <12f7>   DW_AT_decl_line   : 42
    <12f8>   DW_AT_type        : <0x12fc>
 <1><12fc>: Abbrev Number: 18 (DW_TAG_structure_type)
    <12fd>   DW_AT_name        : (indirect string, offset: 0x1e97): LightPort_store
    <1301>   DW_AT_byte_size   : 0
    <1302>   DW_AT_decl_file   : 12
    <1303>   DW_AT_decl_line   : 307
 <1><1305>: Abbrev Number: 4 (DW_TAG_typedef)
    <1306>   DW_AT_name        : (indirect string, offset: 0x55b6): LightPort_od
    <130a>   DW_AT_decl_file   : 12
    <130b>   DW_AT_decl_line   : 43
    <130c>   DW_AT_type        : <0x1310>
 <1><1310>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1311>   DW_AT_name        : (indirect string, offset: 0x55b6): LightPort_od
    <1315>   DW_AT_byte_size   : 0
    <1316>   DW_AT_decl_file   : 12
    <1317>   DW_AT_decl_line   : 299
 <1><1319>: Abbrev Number: 4 (DW_TAG_typedef)
    <131a>   DW_AT_name        : (indirect string, offset: 0x27fc): ButtonPort_store
    <131e>   DW_AT_decl_file   : 12
    <131f>   DW_AT_decl_line   : 44
    <1320>   DW_AT_type        : <0x1324>
 <1><1324>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1325>   DW_AT_name        : (indirect string, offset: 0x27fc): ButtonPort_store
    <1329>   DW_AT_byte_size   : 0
    <132a>   DW_AT_decl_file   : 12
    <132b>   DW_AT_decl_line   : 320
 <1><132d>: Abbrev Number: 4 (DW_TAG_typedef)
    <132e>   DW_AT_name        : (indirect string, offset: 0x5805): ButtonPort_od
    <1332>   DW_AT_decl_file   : 12
    <1333>   DW_AT_decl_line   : 45
    <1334>   DW_AT_type        : <0x1338>
 <1><1338>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1339>   DW_AT_name        : (indirect string, offset: 0x5805): ButtonPort_od
    <133d>   DW_AT_byte_size   : 0
    <133e>   DW_AT_decl_file   : 12
    <133f>   DW_AT_decl_line   : 312
 <1><1341>: Abbrev Number: 4 (DW_TAG_typedef)
    <1342>   DW_AT_name        : (indirect string, offset: 0x3559): System_store
    <1346>   DW_AT_decl_file   : 12
    <1347>   DW_AT_decl_line   : 46
    <1348>   DW_AT_type        : <0x134c>
 <1><134c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <134d>   DW_AT_name        : (indirect string, offset: 0x3559): System_store
    <1351>   DW_AT_byte_size   : 0
    <1352>   DW_AT_decl_file   : 12
    <1353>   DW_AT_decl_line   : 333
 <1><1355>: Abbrev Number: 4 (DW_TAG_typedef)
    <1356>   DW_AT_name        : (indirect string, offset: 0x1a21): System_od
    <135a>   DW_AT_decl_file   : 12
    <135b>   DW_AT_decl_line   : 47
    <135c>   DW_AT_type        : <0x1360>
 <1><1360>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1361>   DW_AT_name        : (indirect string, offset: 0x1a21): System_od
    <1365>   DW_AT_byte_size   : 0
    <1366>   DW_AT_decl_file   : 12
    <1367>   DW_AT_decl_line   : 325
 <1><1369>: Abbrev Number: 4 (DW_TAG_typedef)
    <136a>   DW_AT_name        : (indirect string, offset: 0x6784): Controller_store
    <136e>   DW_AT_decl_file   : 12
    <136f>   DW_AT_decl_line   : 48
    <1370>   DW_AT_type        : <0x1374>
 <1><1374>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1375>   DW_AT_name        : (indirect string, offset: 0x6784): Controller_store
    <1379>   DW_AT_byte_size   : 16
    <137a>   DW_AT_decl_file   : 12
    <137b>   DW_AT_decl_line   : 346
    <137d>   DW_AT_sibling     : <0x139a>
 <2><1381>: Abbrev Number: 12 (DW_TAG_member)
    <1382>   DW_AT_name        : cs
    <1385>   DW_AT_decl_file   : 12
    <1386>   DW_AT_decl_line   : 347
    <1388>   DW_AT_type        : <0xce>
