
/home/vbesnard/Doctorat/Recherche/code/gits/uml-interpreter-c/samples/ButtonLeds/ButtonLedDeployment/ButtonLedSimulatedEnv.emi/build/host/.build//model.o:     file format elf64-x86-64

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x55a1 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x458): GNU C99 6.3.0 20170516 -mtune=generic -march=x86-64 -g -O0 -std=c99
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x761e): model.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x137): /home/vbesnard/Doctorat/Recherche/code/gits/uml-interpreter-c/samples/ButtonLeds/ButtonLedDeployment/ButtonLedSimulatedEnv.emi/src
    <19>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_high_pc     : 0x25e
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x130): size_t
    <32>   DW_AT_decl_file   : 2
    <33>   DW_AT_decl_line   : 216
    <34>   DW_AT_type        : <0x38>
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 7	(unsigned)
    <3b>   DW_AT_name        : (indirect string, offset: 0x32ad): long unsigned int
 <1><3f>: Abbrev Number: 4 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 4
    <41>   DW_AT_encoding    : 5	(signed)
    <42>   DW_AT_name        : int
 <1><46>: Abbrev Number: 3 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 4
    <48>   DW_AT_encoding    : 7	(unsigned)
    <49>   DW_AT_name        : (indirect string, offset: 0x420c): unsigned int
 <1><4d>: Abbrev Number: 3 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 8
    <4f>   DW_AT_encoding    : 5	(signed)
    <50>   DW_AT_name        : (indirect string, offset: 0x132e): long int
 <1><54>: Abbrev Number: 3 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 8
    <56>   DW_AT_encoding    : 5	(signed)
    <57>   DW_AT_name        : (indirect string, offset: 0x3c9a): long long int
 <1><5b>: Abbrev Number: 3 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 8
    <5d>   DW_AT_encoding    : 7	(unsigned)
    <5e>   DW_AT_name        : (indirect string, offset: 0x1da): sizetype
 <1><62>: Abbrev Number: 3 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 2
    <64>   DW_AT_encoding    : 7	(unsigned)
    <65>   DW_AT_name        : (indirect string, offset: 0x70d7): short unsigned int
 <1><69>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <6a>   DW_AT_byte_size   : 8
    <6b>   DW_AT_type        : <0x7b>
 <1><6f>: Abbrev Number: 6 (DW_TAG_const_type)
    <70>   DW_AT_type        : <0x69>
 <1><74>: Abbrev Number: 3 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 1
    <76>   DW_AT_encoding    : 6	(signed char)
    <77>   DW_AT_name        : (indirect string, offset: 0x215c): char
 <1><7b>: Abbrev Number: 6 (DW_TAG_const_type)
    <7c>   DW_AT_type        : <0x74>
 <1><80>: Abbrev Number: 3 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 1
    <82>   DW_AT_encoding    : 8	(unsigned char)
    <83>   DW_AT_name        : (indirect string, offset: 0x1c06): unsigned char
 <1><87>: Abbrev Number: 3 (DW_TAG_base_type)
    <88>   DW_AT_byte_size   : 1
    <89>   DW_AT_encoding    : 6	(signed char)
    <8a>   DW_AT_name        : (indirect string, offset: 0x1951): signed char
 <1><8e>: Abbrev Number: 3 (DW_TAG_base_type)
    <8f>   DW_AT_byte_size   : 2
    <90>   DW_AT_encoding    : 5	(signed)
    <91>   DW_AT_name        : (indirect string, offset: 0x61f5): short int
 <1><95>: Abbrev Number: 2 (DW_TAG_typedef)
    <96>   DW_AT_name        : (indirect string, offset: 0x53ab): __off_t
    <9a>   DW_AT_decl_file   : 3
    <9b>   DW_AT_decl_line   : 131
    <9c>   DW_AT_type        : <0x4d>
 <1><a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x5c65): __off64_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 132
    <a7>   DW_AT_type        : <0x4d>
 <1><ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ac>   DW_AT_byte_size   : 8
 <1><ad>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ae>   DW_AT_byte_size   : 8
    <af>   DW_AT_type        : <0x74>
 <1><b3>: Abbrev Number: 2 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0x7b): int8_t
    <b8>   DW_AT_decl_file   : 4
    <b9>   DW_AT_decl_line   : 194
    <ba>   DW_AT_type        : <0x87>
 <1><be>: Abbrev Number: 3 (DW_TAG_base_type)
    <bf>   DW_AT_byte_size   : 8
    <c0>   DW_AT_encoding    : 7	(unsigned)
    <c1>   DW_AT_name        : (indirect string, offset: 0x52ed): long long unsigned int
 <1><c5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c6>   DW_AT_name        : (indirect string, offset: 0x19a6): _IO_FILE
    <ca>   DW_AT_byte_size   : 216
    <cb>   DW_AT_decl_file   : 5
    <cc>   DW_AT_decl_line   : 241
    <cd>   DW_AT_sibling     : <0x242>
 <2><d1>: Abbrev Number: 9 (DW_TAG_member)
    <d2>   DW_AT_name        : (indirect string, offset: 0x4846): _flags
    <d6>   DW_AT_decl_file   : 5
    <d7>   DW_AT_decl_line   : 242
    <d8>   DW_AT_type        : <0x3f>
    <dc>   DW_AT_data_member_location: 0
 <2><dd>: Abbrev Number: 9 (DW_TAG_member)
    <de>   DW_AT_name        : (indirect string, offset: 0x265a): _IO_read_ptr
    <e2>   DW_AT_decl_file   : 5
    <e3>   DW_AT_decl_line   : 247
    <e4>   DW_AT_type        : <0xad>
    <e8>   DW_AT_data_member_location: 8
 <2><e9>: Abbrev Number: 9 (DW_TAG_member)
    <ea>   DW_AT_name        : (indirect string, offset: 0x6a5c): _IO_read_end
    <ee>   DW_AT_decl_file   : 5
    <ef>   DW_AT_decl_line   : 248
    <f0>   DW_AT_type        : <0xad>
    <f4>   DW_AT_data_member_location: 16
 <2><f5>: Abbrev Number: 9 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x3460): _IO_read_base
    <fa>   DW_AT_decl_file   : 5
    <fb>   DW_AT_decl_line   : 249
    <fc>   DW_AT_type        : <0xad>
    <100>   DW_AT_data_member_location: 24
 <2><101>: Abbrev Number: 9 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0x826): _IO_write_base
    <106>   DW_AT_decl_file   : 5
    <107>   DW_AT_decl_line   : 250
    <108>   DW_AT_type        : <0xad>
    <10c>   DW_AT_data_member_location: 32
 <2><10d>: Abbrev Number: 9 (DW_TAG_member)
    <10e>   DW_AT_name        : (indirect string, offset: 0x72f8): _IO_write_ptr
    <112>   DW_AT_decl_file   : 5
    <113>   DW_AT_decl_line   : 251
    <114>   DW_AT_type        : <0xad>
    <118>   DW_AT_data_member_location: 40
 <2><119>: Abbrev Number: 9 (DW_TAG_member)
    <11a>   DW_AT_name        : (indirect string, offset: 0x3e1d): _IO_write_end
    <11e>   DW_AT_decl_file   : 5
    <11f>   DW_AT_decl_line   : 252
    <120>   DW_AT_type        : <0xad>
    <124>   DW_AT_data_member_location: 48
 <2><125>: Abbrev Number: 9 (DW_TAG_member)
    <126>   DW_AT_name        : (indirect string, offset: 0x41d3): _IO_buf_base
    <12a>   DW_AT_decl_file   : 5
    <12b>   DW_AT_decl_line   : 253
    <12c>   DW_AT_type        : <0xad>
    <130>   DW_AT_data_member_location: 56
 <2><131>: Abbrev Number: 9 (DW_TAG_member)
    <132>   DW_AT_name        : (indirect string, offset: 0x5f29): _IO_buf_end
    <136>   DW_AT_decl_file   : 5
    <137>   DW_AT_decl_line   : 254
    <138>   DW_AT_type        : <0xad>
    <13c>   DW_AT_data_member_location: 64
 <2><13d>: Abbrev Number: 10 (DW_TAG_member)
    <13e>   DW_AT_name        : (indirect string, offset: 0xb53): _IO_save_base
    <142>   DW_AT_decl_file   : 5
    <143>   DW_AT_decl_line   : 256
    <145>   DW_AT_type        : <0xad>
    <149>   DW_AT_data_member_location: 72
 <2><14a>: Abbrev Number: 10 (DW_TAG_member)
    <14b>   DW_AT_name        : (indirect string, offset: 0x5a67): _IO_backup_base
    <14f>   DW_AT_decl_file   : 5
    <150>   DW_AT_decl_line   : 257
    <152>   DW_AT_type        : <0xad>
    <156>   DW_AT_data_member_location: 80
 <2><157>: Abbrev Number: 10 (DW_TAG_member)
    <158>   DW_AT_name        : (indirect string, offset: 0x4f3): _IO_save_end
    <15c>   DW_AT_decl_file   : 5
    <15d>   DW_AT_decl_line   : 258
    <15f>   DW_AT_type        : <0xad>
    <163>   DW_AT_data_member_location: 88
 <2><164>: Abbrev Number: 10 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0x2a25): _markers
    <169>   DW_AT_decl_file   : 5
    <16a>   DW_AT_decl_line   : 260
    <16c>   DW_AT_type        : <0x27a>
    <170>   DW_AT_data_member_location: 96
 <2><171>: Abbrev Number: 10 (DW_TAG_member)
    <172>   DW_AT_name        : (indirect string, offset: 0xda7): _chain
    <176>   DW_AT_decl_file   : 5
    <177>   DW_AT_decl_line   : 262
    <179>   DW_AT_type        : <0x280>
    <17d>   DW_AT_data_member_location: 104
 <2><17e>: Abbrev Number: 10 (DW_TAG_member)
    <17f>   DW_AT_name        : (indirect string, offset: 0x6df3): _fileno
    <183>   DW_AT_decl_file   : 5
    <184>   DW_AT_decl_line   : 264
    <186>   DW_AT_type        : <0x3f>
    <18a>   DW_AT_data_member_location: 112
 <2><18b>: Abbrev Number: 10 (DW_TAG_member)
    <18c>   DW_AT_name        : (indirect string, offset: 0x3379): _flags2
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 268
    <193>   DW_AT_type        : <0x3f>
    <197>   DW_AT_data_member_location: 116
 <2><198>: Abbrev Number: 10 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x39ab): _old_offset
    <19d>   DW_AT_decl_file   : 5
    <19e>   DW_AT_decl_line   : 270
    <1a0>   DW_AT_type        : <0x95>
    <1a4>   DW_AT_data_member_location: 120
 <2><1a5>: Abbrev Number: 10 (DW_TAG_member)
    <1a6>   DW_AT_name        : (indirect string, offset: 0xe87): _cur_column
    <1aa>   DW_AT_decl_file   : 5
    <1ab>   DW_AT_decl_line   : 274
    <1ad>   DW_AT_type        : <0x62>
    <1b1>   DW_AT_data_member_location: 128
 <2><1b2>: Abbrev Number: 10 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x64f6): _vtable_offset
    <1b7>   DW_AT_decl_file   : 5
    <1b8>   DW_AT_decl_line   : 275
    <1ba>   DW_AT_type        : <0x87>
    <1be>   DW_AT_data_member_location: 130
 <2><1bf>: Abbrev Number: 10 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0x5a77): _shortbuf
    <1c4>   DW_AT_decl_file   : 5
    <1c5>   DW_AT_decl_line   : 276
    <1c7>   DW_AT_type        : <0x286>
    <1cb>   DW_AT_data_member_location: 131
 <2><1cc>: Abbrev Number: 10 (DW_TAG_member)
    <1cd>   DW_AT_name        : (indirect string, offset: 0xa28): _lock
    <1d1>   DW_AT_decl_file   : 5
    <1d2>   DW_AT_decl_line   : 280
    <1d4>   DW_AT_type        : <0x296>
    <1d8>   DW_AT_data_member_location: 136
 <2><1d9>: Abbrev Number: 10 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0x2ede): _offset
    <1de>   DW_AT_decl_file   : 5
    <1df>   DW_AT_decl_line   : 289
    <1e1>   DW_AT_type        : <0xa0>
    <1e5>   DW_AT_data_member_location: 144
 <2><1e6>: Abbrev Number: 10 (DW_TAG_member)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x4535): __pad1
    <1eb>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 297
    <1ee>   DW_AT_type        : <0xab>
    <1f2>   DW_AT_data_member_location: 152
 <2><1f3>: Abbrev Number: 10 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x453c): __pad2
    <1f8>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 298
    <1fb>   DW_AT_type        : <0xab>
    <1ff>   DW_AT_data_member_location: 160
 <2><200>: Abbrev Number: 10 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x4543): __pad3
    <205>   DW_AT_decl_file   : 5
    <206>   DW_AT_decl_line   : 299
    <208>   DW_AT_type        : <0xab>
    <20c>   DW_AT_data_member_location: 168
 <2><20d>: Abbrev Number: 10 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x454a): __pad4
    <212>   DW_AT_decl_file   : 5
    <213>   DW_AT_decl_line   : 300
    <215>   DW_AT_type        : <0xab>
    <219>   DW_AT_data_member_location: 176
 <2><21a>: Abbrev Number: 10 (DW_TAG_member)
    <21b>   DW_AT_name        : (indirect string, offset: 0x4551): __pad5
    <21f>   DW_AT_decl_file   : 5
    <220>   DW_AT_decl_line   : 302
    <222>   DW_AT_type        : <0x2d>
    <226>   DW_AT_data_member_location: 184
 <2><227>: Abbrev Number: 10 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x4a3a): _mode
    <22c>   DW_AT_decl_file   : 5
    <22d>   DW_AT_decl_line   : 303
    <22f>   DW_AT_type        : <0x3f>
    <233>   DW_AT_data_member_location: 192
 <2><234>: Abbrev Number: 10 (DW_TAG_member)
    <235>   DW_AT_name        : (indirect string, offset: 0x357e): _unused2
    <239>   DW_AT_decl_file   : 5
    <23a>   DW_AT_decl_line   : 305
    <23c>   DW_AT_type        : <0x29c>
    <240>   DW_AT_data_member_location: 196
 <2><241>: Abbrev Number: 0
 <1><242>: Abbrev Number: 11 (DW_TAG_typedef)
    <243>   DW_AT_name        : (indirect string, offset: 0x22ec): _IO_lock_t
    <247>   DW_AT_decl_file   : 5
    <248>   DW_AT_decl_line   : 150
 <1><249>: Abbrev Number: 8 (DW_TAG_structure_type)
    <24a>   DW_AT_name        : (indirect string, offset: 0x1436): _IO_marker
    <24e>   DW_AT_byte_size   : 24
    <24f>   DW_AT_decl_file   : 5
    <250>   DW_AT_decl_line   : 156
    <251>   DW_AT_sibling     : <0x27a>
 <2><255>: Abbrev Number: 9 (DW_TAG_member)
    <256>   DW_AT_name        : (indirect string, offset: 0x5c24): _next
    <25a>   DW_AT_decl_file   : 5
    <25b>   DW_AT_decl_line   : 157
    <25c>   DW_AT_type        : <0x27a>
    <260>   DW_AT_data_member_location: 0
 <2><261>: Abbrev Number: 9 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x459d): _sbuf
    <266>   DW_AT_decl_file   : 5
    <267>   DW_AT_decl_line   : 158
    <268>   DW_AT_type        : <0x280>
    <26c>   DW_AT_data_member_location: 8
 <2><26d>: Abbrev Number: 9 (DW_TAG_member)
    <26e>   DW_AT_name        : (indirect string, offset: 0x27bc): _pos
    <272>   DW_AT_decl_file   : 5
    <273>   DW_AT_decl_line   : 162
    <274>   DW_AT_type        : <0x3f>
    <278>   DW_AT_data_member_location: 16
 <2><279>: Abbrev Number: 0
 <1><27a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <27b>   DW_AT_byte_size   : 8
    <27c>   DW_AT_type        : <0x249>
 <1><280>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <281>   DW_AT_byte_size   : 8
    <282>   DW_AT_type        : <0xc5>
 <1><286>: Abbrev Number: 12 (DW_TAG_array_type)
    <287>   DW_AT_type        : <0x74>
    <28b>   DW_AT_sibling     : <0x296>
 <2><28f>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <290>   DW_AT_type        : <0x5b>
    <294>   DW_AT_upper_bound : 0
 <2><295>: Abbrev Number: 0
 <1><296>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <297>   DW_AT_byte_size   : 8
    <298>   DW_AT_type        : <0x242>
 <1><29c>: Abbrev Number: 12 (DW_TAG_array_type)
    <29d>   DW_AT_type        : <0x74>
    <2a1>   DW_AT_sibling     : <0x2ac>
 <2><2a5>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <2a6>   DW_AT_type        : <0x5b>
    <2aa>   DW_AT_upper_bound : 19
 <2><2ab>: Abbrev Number: 0
 <1><2ac>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x1f32): _IO_FILE_plus
    <2b1>   DW_AT_declaration : 1
 <1><2b1>: Abbrev Number: 15 (DW_TAG_variable)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x328f): _IO_2_1_stdin_
    <2b6>   DW_AT_decl_file   : 5
    <2b7>   DW_AT_decl_line   : 315
    <2b9>   DW_AT_type        : <0x2ac>
    <2bd>   DW_AT_external    : 1
    <2bd>   DW_AT_declaration : 1
 <1><2bd>: Abbrev Number: 15 (DW_TAG_variable)
    <2be>   DW_AT_name        : (indirect string, offset: 0x5ada): _IO_2_1_stdout_
    <2c2>   DW_AT_decl_file   : 5
    <2c3>   DW_AT_decl_line   : 316
    <2c5>   DW_AT_type        : <0x2ac>
    <2c9>   DW_AT_external    : 1
    <2c9>   DW_AT_declaration : 1
 <1><2c9>: Abbrev Number: 15 (DW_TAG_variable)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x35c): _IO_2_1_stderr_
    <2ce>   DW_AT_decl_file   : 5
    <2cf>   DW_AT_decl_line   : 317
    <2d1>   DW_AT_type        : <0x2ac>
    <2d5>   DW_AT_external    : 1
    <2d5>   DW_AT_declaration : 1
 <1><2d5>: Abbrev Number: 16 (DW_TAG_variable)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x27c1): stdin
    <2da>   DW_AT_decl_file   : 6
    <2db>   DW_AT_decl_line   : 170
    <2dc>   DW_AT_type        : <0x280>
    <2e0>   DW_AT_external    : 1
    <2e0>   DW_AT_declaration : 1
 <1><2e0>: Abbrev Number: 16 (DW_TAG_variable)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x70ea): stdout
    <2e5>   DW_AT_decl_file   : 6
    <2e6>   DW_AT_decl_line   : 171
    <2e7>   DW_AT_type        : <0x280>
    <2eb>   DW_AT_external    : 1
    <2eb>   DW_AT_declaration : 1
 <1><2eb>: Abbrev Number: 16 (DW_TAG_variable)
    <2ec>   DW_AT_name        : (indirect string, offset: 0x61ee): stderr
    <2f0>   DW_AT_decl_file   : 6
    <2f1>   DW_AT_decl_line   : 172
    <2f2>   DW_AT_type        : <0x280>
    <2f6>   DW_AT_external    : 1
    <2f6>   DW_AT_declaration : 1
 <1><2f6>: Abbrev Number: 16 (DW_TAG_variable)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xe93): sys_nerr
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 26
    <2fd>   DW_AT_type        : <0x3f>
    <301>   DW_AT_external    : 1
    <301>   DW_AT_declaration : 1
 <1><301>: Abbrev Number: 12 (DW_TAG_array_type)
    <302>   DW_AT_type        : <0x6f>
    <306>   DW_AT_sibling     : <0x30c>
 <2><30a>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><30b>: Abbrev Number: 0
 <1><30c>: Abbrev Number: 6 (DW_TAG_const_type)
    <30d>   DW_AT_type        : <0x301>
 <1><311>: Abbrev Number: 16 (DW_TAG_variable)
    <312>   DW_AT_name        : (indirect string, offset: 0x2937): sys_errlist
    <316>   DW_AT_decl_file   : 7
    <317>   DW_AT_decl_line   : 27
    <318>   DW_AT_type        : <0x30c>
    <31c>   DW_AT_external    : 1
    <31c>   DW_AT_declaration : 1
 <1><31c>: Abbrev Number: 16 (DW_TAG_variable)
    <31d>   DW_AT_name        : (indirect string, offset: 0x1146): _sys_nerr
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 30
    <323>   DW_AT_type        : <0x3f>
    <327>   DW_AT_external    : 1
    <327>   DW_AT_declaration : 1
 <1><327>: Abbrev Number: 16 (DW_TAG_variable)
    <328>   DW_AT_name        : (indirect string, offset: 0x659d): _sys_errlist
    <32c>   DW_AT_decl_file   : 7
    <32d>   DW_AT_decl_line   : 31
    <32e>   DW_AT_type        : <0x30c>
    <332>   DW_AT_external    : 1
    <332>   DW_AT_declaration : 1
 <1><332>: Abbrev Number: 2 (DW_TAG_typedef)
    <333>   DW_AT_name        : (indirect string, offset: 0x195d): uint8_t
    <337>   DW_AT_decl_file   : 8
    <338>   DW_AT_decl_line   : 48
    <339>   DW_AT_type        : <0x80>
 <1><33d>: Abbrev Number: 2 (DW_TAG_typedef)
    <33e>   DW_AT_name        : (indirect string, offset: 0x5356): uint16_t
    <342>   DW_AT_decl_file   : 8
    <343>   DW_AT_decl_line   : 49
    <344>   DW_AT_type        : <0x62>
 <1><348>: Abbrev Number: 2 (DW_TAG_typedef)
    <349>   DW_AT_name        : (indirect string, offset: 0x6ce6): uint32_t
    <34d>   DW_AT_decl_file   : 8
    <34e>   DW_AT_decl_line   : 51
    <34f>   DW_AT_type        : <0x46>
 <1><353>: Abbrev Number: 2 (DW_TAG_typedef)
    <354>   DW_AT_name        : (indirect string, offset: 0x6215): uint64_t
    <358>   DW_AT_decl_file   : 8
    <359>   DW_AT_decl_line   : 55
    <35a>   DW_AT_type        : <0x38>
 <1><35e>: Abbrev Number: 2 (DW_TAG_typedef)
    <35f>   DW_AT_name        : (indirect string, offset: 0x6ed7): NbEnumerationLiteral_t
    <363>   DW_AT_decl_file   : 9
    <364>   DW_AT_decl_line   : 29
    <365>   DW_AT_type        : <0x332>
 <1><369>: Abbrev Number: 2 (DW_TAG_typedef)
    <36a>   DW_AT_name        : (indirect string, offset: 0x50e4): NbSignalEvents_t
    <36e>   DW_AT_decl_file   : 9
    <36f>   DW_AT_decl_line   : 30
    <370>   DW_AT_type        : <0x332>
 <1><374>: Abbrev Number: 2 (DW_TAG_typedef)
    <375>   DW_AT_name        : (indirect string, offset: 0x2fba): NbPorts_t
    <379>   DW_AT_decl_file   : 9
    <37a>   DW_AT_decl_line   : 34
    <37b>   DW_AT_type        : <0x332>
 <1><37f>: Abbrev Number: 2 (DW_TAG_typedef)
    <380>   DW_AT_name        : (indirect string, offset: 0x3ddc): NbActiveObjects_t
    <384>   DW_AT_decl_file   : 9
    <385>   DW_AT_decl_line   : 45
    <386>   DW_AT_type        : <0xb3>
 <1><38a>: Abbrev Number: 2 (DW_TAG_typedef)
    <38b>   DW_AT_name        : (indirect string, offset: 0x48c3): NbPassiveObjects_t
    <38f>   DW_AT_decl_file   : 9
    <390>   DW_AT_decl_line   : 46
    <391>   DW_AT_type        : <0x332>
 <1><395>: Abbrev Number: 2 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0x8a4): NbFireables_t
    <39a>   DW_AT_decl_file   : 9
    <39b>   DW_AT_decl_line   : 50
    <39c>   DW_AT_type        : <0xb3>
 <1><3a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x216b): NbOutgoings_t
    <3a5>   DW_AT_decl_file   : 9
    <3a6>   DW_AT_decl_line   : 51
    <3a7>   DW_AT_type        : <0xb3>
 <1><3ab>: Abbrev Number: 2 (DW_TAG_typedef)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x3ca8): FireablesLength_t
    <3b0>   DW_AT_decl_file   : 9
    <3b1>   DW_AT_decl_line   : 52
    <3b2>   DW_AT_type        : <0xb3>
 <1><3b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <3b7>   DW_AT_name        : (indirect string, offset: 0x3cba): StoreSize_t
    <3bb>   DW_AT_decl_file   : 9
    <3bc>   DW_AT_decl_line   : 53
    <3bd>   DW_AT_type        : <0x33d>
 <1><3c1>: Abbrev Number: 2 (DW_TAG_typedef)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x5cb9): NbPropertiesRO_t
    <3c6>   DW_AT_decl_file   : 9
    <3c7>   DW_AT_decl_line   : 55
    <3c8>   DW_AT_type        : <0x332>
 <1><3cc>: Abbrev Number: 2 (DW_TAG_typedef)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x5e2): NbFifoElements_t
    <3d1>   DW_AT_decl_file   : 9
    <3d2>   DW_AT_decl_line   : 57
    <3d3>   DW_AT_type        : <0x332>
 <1><3d7>: Abbrev Number: 2 (DW_TAG_typedef)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x4adf): ObjectMultiplicity_t
    <3dc>   DW_AT_decl_file   : 9
    <3dd>   DW_AT_decl_line   : 58
    <3de>   DW_AT_type        : <0x332>
 <1><3e2>: Abbrev Number: 2 (DW_TAG_typedef)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x542a): NbEvents_t
    <3e7>   DW_AT_decl_file   : 9
    <3e8>   DW_AT_decl_line   : 63
    <3e9>   DW_AT_type        : <0x332>
 <1><3ed>: Abbrev Number: 2 (DW_TAG_typedef)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x7453): EventSetSize_t
    <3f2>   DW_AT_decl_file   : 9
    <3f3>   DW_AT_decl_line   : 64
    <3f4>   DW_AT_type        : <0x332>
 <1><3f8>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <3f9>   DW_AT_byte_size   : 4
    <3fa>   DW_AT_type        : <0x46>
    <3fe>   DW_AT_decl_file   : 10
    <3ff>   DW_AT_decl_line   : 17
    <400>   DW_AT_sibling     : <0x41d>
 <2><404>: Abbrev Number: 19 (DW_TAG_enumerator)
    <405>   DW_AT_name        : (indirect string, offset: 0x41bf): C_UML_PrimitiveType
    <409>   DW_AT_const_value : 0
 <2><40a>: Abbrev Number: 19 (DW_TAG_enumerator)
    <40b>   DW_AT_name        : (indirect string, offset: 0x16dc): C_UML_Class
    <40f>   DW_AT_const_value : 1
 <2><410>: Abbrev Number: 19 (DW_TAG_enumerator)
    <411>   DW_AT_name        : (indirect string, offset: 0x57c6): C_UML_Association
    <415>   DW_AT_const_value : 2
 <2><416>: Abbrev Number: 19 (DW_TAG_enumerator)
    <417>   DW_AT_name        : (indirect string, offset: 0x2f35): C_UML_Interface
    <41b>   DW_AT_const_value : 3
 <2><41c>: Abbrev Number: 0
 <1><41d>: Abbrev Number: 2 (DW_TAG_typedef)
    <41e>   DW_AT_name        : (indirect string, offset: 0x15dc): C_UML_ClassifierKind
    <422>   DW_AT_decl_file   : 10
    <423>   DW_AT_decl_line   : 22
    <424>   DW_AT_type        : <0x3f8>
 <1><428>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <429>   DW_AT_byte_size   : 4
    <42a>   DW_AT_type        : <0x46>
    <42e>   DW_AT_decl_file   : 10
    <42f>   DW_AT_decl_line   : 29
    <430>   DW_AT_sibling     : <0x441>
 <2><434>: Abbrev Number: 19 (DW_TAG_enumerator)
    <435>   DW_AT_name        : (indirect string, offset: 0x5cd3): C_UML_State
    <439>   DW_AT_const_value : 0
 <2><43a>: Abbrev Number: 19 (DW_TAG_enumerator)
    <43b>   DW_AT_name        : (indirect string, offset: 0x1d3f): C_UML_Pseudostate
    <43f>   DW_AT_const_value : 1
 <2><440>: Abbrev Number: 0
 <1><441>: Abbrev Number: 2 (DW_TAG_typedef)
    <442>   DW_AT_name        : (indirect string, offset: 0x1940): C_UML_VertexKind
    <446>   DW_AT_decl_file   : 10
    <447>   DW_AT_decl_line   : 32
    <448>   DW_AT_type        : <0x428>
 <1><44c>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <44d>   DW_AT_byte_size   : 4
    <44e>   DW_AT_type        : <0x46>
    <452>   DW_AT_decl_file   : 10
    <453>   DW_AT_decl_line   : 40
    <454>   DW_AT_sibling     : <0x46b>
 <2><458>: Abbrev Number: 19 (DW_TAG_enumerator)
    <459>   DW_AT_name        : (indirect string, offset: 0x5085): C_UML_Behavior
    <45d>   DW_AT_const_value : 0
 <2><45e>: Abbrev Number: 19 (DW_TAG_enumerator)
    <45f>   DW_AT_name        : (indirect string, offset: 0x18c2): C_UML_StateMachine
    <463>   DW_AT_const_value : 1
 <2><464>: Abbrev Number: 19 (DW_TAG_enumerator)
    <465>   DW_AT_name        : (indirect string, offset: 0x3381): C_UML_OpaqueBehavior
    <469>   DW_AT_const_value : 2
 <2><46a>: Abbrev Number: 0
 <1><46b>: Abbrev Number: 2 (DW_TAG_typedef)
    <46c>   DW_AT_name        : (indirect string, offset: 0x3c87): C_UML_BehaviorKind
    <470>   DW_AT_decl_file   : 10
    <471>   DW_AT_decl_line   : 44
    <472>   DW_AT_type        : <0x44c>
 <1><476>: Abbrev Number: 2 (DW_TAG_typedef)
    <477>   DW_AT_name        : (indirect string, offset: 0x1587): DescriptorType
    <47b>   DW_AT_decl_file   : 11
    <47c>   DW_AT_decl_line   : 22
    <47d>   DW_AT_type        : <0x481>
 <1><481>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <482>   DW_AT_name        : (indirect string, offset: 0x1587): DescriptorType
    <486>   DW_AT_byte_size   : 4
    <487>   DW_AT_type        : <0x46>
    <48b>   DW_AT_decl_file   : 11
    <48c>   DW_AT_decl_line   : 22
    <48d>   DW_AT_sibling     : <0x56a>
 <2><491>: Abbrev Number: 19 (DW_TAG_enumerator)
    <492>   DW_AT_name        : (indirect string, offset: 0x56f6): DESC_TYPE_UML_Property
    <496>   DW_AT_const_value : 0
 <2><497>: Abbrev Number: 19 (DW_TAG_enumerator)
    <498>   DW_AT_name        : (indirect string, offset: 0xb1e): DESC_TYPE_UML_Class
    <49c>   DW_AT_const_value : 1
 <2><49d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <49e>   DW_AT_name        : (indirect string, offset: 0x3331): DESC_TYPE_UML_Port
    <4a2>   DW_AT_const_value : 2
 <2><4a3>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x5f35): DESC_TYPE_UML_Constraint
    <4a8>   DW_AT_const_value : 3
 <2><4a9>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x6382): DESC_TYPE_UML_ConnectorEnd
    <4ae>   DW_AT_const_value : 4
 <2><4af>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x2a2e): DESC_TYPE_UML_SignalEvent
    <4b4>   DW_AT_const_value : 5
 <2><4b5>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x7012): DESC_TYPE_UML_Connector
    <4ba>   DW_AT_const_value : 6
 <2><4bb>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x3b5b): DESC_TYPE_UML_InterfaceRealization
    <4c0>   DW_AT_const_value : 7
 <2><4c1>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x1306): DESC_TYPE_UML_OpaqueExpression
    <4c6>   DW_AT_const_value : 8
 <2><4c7>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x76cb): DESC_TYPE_UML_Interface
    <4cc>   DW_AT_const_value : 9
 <2><4cd>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x1371): DESC_TYPE_UML_Reception
    <4d2>   DW_AT_const_value : 10
 <2><4d3>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x150f): DESC_TYPE_UML_Pseudostate
    <4d8>   DW_AT_const_value : 11
 <2><4d9>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4da>   DW_AT_name        : (indirect string, offset: 0x7050): DESC_TYPE_UML_Vertex
    <4de>   DW_AT_const_value : 12
 <2><4df>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4e0>   DW_AT_name        : (indirect string, offset: 0x5112): DESC_TYPE_UML_Association
    <4e4>   DW_AT_const_value : 13
 <2><4e5>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x4176): DESC_TYPE_UML_ValueSpecification
    <4ea>   DW_AT_const_value : 14
 <2><4eb>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x25ce): DESC_TYPE_UML_Transition
    <4f0>   DW_AT_const_value : 15
 <2><4f1>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x575): DESC_TYPE_UML_StructuredClassifier
    <4f6>   DW_AT_const_value : 16
 <2><4f7>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x500): DESC_TYPE_UML_TypedElement
    <4fc>   DW_AT_const_value : 17
 <2><4fd>: Abbrev Number: 19 (DW_TAG_enumerator)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x61d2): DESC_TYPE_UML_PrimitiveType
    <502>   DW_AT_const_value : 18
 <2><503>: Abbrev Number: 19 (DW_TAG_enumerator)
    <504>   DW_AT_name        : (indirect string, offset: 0x12d3): DESC_TYPE_UML_StateMachine
    <508>   DW_AT_const_value : 19
 <2><509>: Abbrev Number: 19 (DW_TAG_enumerator)
    <50a>   DW_AT_name        : (indirect string, offset: 0x59a4): DESC_TYPE_UML_BehavioralFeature
    <50e>   DW_AT_const_value : 20
 <2><50f>: Abbrev Number: 19 (DW_TAG_enumerator)
    <510>   DW_AT_name        : (indirect string, offset: 0x57d8): DESC_TYPE_UML_MultiplicityElement
    <514>   DW_AT_const_value : 21
 <2><515>: Abbrev Number: 19 (DW_TAG_enumerator)
    <516>   DW_AT_name        : (indirect string, offset: 0x1570): DESC_TYPE_UML_Behavior
    <51a>   DW_AT_const_value : 22
 <2><51b>: Abbrev Number: 19 (DW_TAG_enumerator)
    <51c>   DW_AT_name        : (indirect string, offset: 0x2cb7): DESC_TYPE_UML_OpaqueBehavior
    <520>   DW_AT_const_value : 23
 <2><521>: Abbrev Number: 19 (DW_TAG_enumerator)
    <522>   DW_AT_name        : (indirect string, offset: 0x77f4): DESC_TYPE_UML_State
    <526>   DW_AT_const_value : 24
 <2><527>: Abbrev Number: 19 (DW_TAG_enumerator)
    <528>   DW_AT_name        : (indirect string, offset: 0x61ff): DESC_TYPE_UML_Trigger
    <52c>   DW_AT_const_value : 25
 <2><52d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <52e>   DW_AT_name        : (indirect string, offset: 0x9a2): DESC_TYPE_UML_NamedElement
    <532>   DW_AT_const_value : 26
 <2><533>: Abbrev Number: 19 (DW_TAG_enumerator)
    <534>   DW_AT_name        : (indirect string, offset: 0x419d): DESC_TYPE_UML_Signal
    <538>   DW_AT_const_value : 27
 <2><539>: Abbrev Number: 19 (DW_TAG_enumerator)
    <53a>   DW_AT_name        : (indirect string, offset: 0x3dee): DESC_TYPE_UML_EncapsulatedClassifier
    <53e>   DW_AT_const_value : 28
 <2><53f>: Abbrev Number: 19 (DW_TAG_enumerator)
    <540>   DW_AT_name        : (indirect string, offset: 0x527e): DESC_TYPE_UML_Region
    <544>   DW_AT_const_value : 29
 <2><545>: Abbrev Number: 19 (DW_TAG_enumerator)
    <546>   DW_AT_name        : (indirect string, offset: 0x6eff): DESC_TYPE_UML_Enumeration
    <54a>   DW_AT_const_value : 30
 <2><54b>: Abbrev Number: 19 (DW_TAG_enumerator)
    <54c>   DW_AT_name        : (indirect string, offset: 0x5934): DESC_TYPE_UML_EnumerationLiteral
    <550>   DW_AT_const_value : 31
 <2><551>: Abbrev Number: 19 (DW_TAG_enumerator)
    <552>   DW_AT_name        : (indirect string, offset: 0x4062): DESC_TYPE_UML_Operation
    <556>   DW_AT_const_value : 32
 <2><557>: Abbrev Number: 19 (DW_TAG_enumerator)
    <558>   DW_AT_name        : (indirect string, offset: 0x34ad): DESC_TYPE_UML_BehavioredClassifier
    <55c>   DW_AT_const_value : 33
 <2><55d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <55e>   DW_AT_name        : (indirect string, offset: 0x1a1c): DESC_TYPE_UML_ConnectableElement
    <562>   DW_AT_const_value : 34
 <2><563>: Abbrev Number: 19 (DW_TAG_enumerator)
    <564>   DW_AT_name        : (indirect string, offset: 0x35f4): NB_DESC_TYPE
    <568>   DW_AT_const_value : 35
 <2><569>: Abbrev Number: 0
 <1><56a>: Abbrev Number: 12 (DW_TAG_array_type)
    <56b>   DW_AT_type        : <0x57a>
    <56f>   DW_AT_sibling     : <0x57a>
 <2><573>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <574>   DW_AT_type        : <0x5b>
    <578>   DW_AT_upper_bound : 2
 <2><579>: Abbrev Number: 0
 <1><57a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <57b>   DW_AT_byte_size   : 8
    <57c>   DW_AT_type        : <0x332>
 <1><580>: Abbrev Number: 16 (DW_TAG_variable)
    <581>   DW_AT_name        : (indirect string, offset: 0x1b13): offsets_table
    <585>   DW_AT_decl_file   : 11
    <586>   DW_AT_decl_line   : 136
    <587>   DW_AT_type        : <0x56a>
    <58b>   DW_AT_external    : 1
    <58b>   DW_AT_declaration : 1
 <1><58b>: Abbrev Number: 2 (DW_TAG_typedef)
    <58c>   DW_AT_name        : (indirect string, offset: 0x2452): C_UML_Model
    <590>   DW_AT_decl_file   : 11
    <591>   DW_AT_decl_line   : 159
    <592>   DW_AT_type        : <0x596>
 <1><596>: Abbrev Number: 21 (DW_TAG_structure_type)
    <597>   DW_AT_name        : (indirect string, offset: 0x2452): C_UML_Model
    <59b>   DW_AT_byte_size   : 40
    <59c>   DW_AT_decl_file   : 11
    <59d>   DW_AT_decl_line   : 442
    <59f>   DW_AT_sibling     : <0x5e5>
 <2><5a3>: Abbrev Number: 10 (DW_TAG_member)
    <5a4>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <5a8>   DW_AT_decl_file   : 11
    <5a9>   DW_AT_decl_line   : 443
    <5ab>   DW_AT_type        : <0xad>
    <5af>   DW_AT_data_member_location: 0
 <2><5b0>: Abbrev Number: 10 (DW_TAG_member)
    <5b1>   DW_AT_name        : (indirect string, offset: 0x736a): uml_signal
    <5b5>   DW_AT_decl_file   : 11
    <5b6>   DW_AT_decl_line   : 444
    <5b8>   DW_AT_type        : <0xf92>
    <5bc>   DW_AT_data_member_location: 8
 <2><5bd>: Abbrev Number: 10 (DW_TAG_member)
    <5be>   DW_AT_name        : (indirect string, offset: 0x6b1a): uml_signal_event
    <5c2>   DW_AT_decl_file   : 11
    <5c3>   DW_AT_decl_line   : 445
    <5c5>   DW_AT_type        : <0xf9e>
    <5c9>   DW_AT_data_member_location: 16
 <2><5ca>: Abbrev Number: 10 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x1c67): uml_class
    <5cf>   DW_AT_decl_file   : 11
    <5d0>   DW_AT_decl_line   : 446
    <5d2>   DW_AT_type        : <0xfaa>
    <5d6>   DW_AT_data_member_location: 24
 <2><5d7>: Abbrev Number: 10 (DW_TAG_member)
    <5d8>   DW_AT_name        : (indirect string, offset: 0xc4e): uml_association
    <5dc>   DW_AT_decl_file   : 11
    <5dd>   DW_AT_decl_line   : 447
    <5df>   DW_AT_type        : <0xfb6>
    <5e3>   DW_AT_data_member_location: 32
 <2><5e4>: Abbrev Number: 0
 <1><5e5>: Abbrev Number: 2 (DW_TAG_typedef)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x4767): UML_VisibilityKind
    <5ea>   DW_AT_decl_file   : 11
    <5eb>   DW_AT_decl_line   : 160
    <5ec>   DW_AT_type        : <0x5f0>
 <1><5f0>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x4767): UML_VisibilityKind
    <5f5>   DW_AT_byte_size   : 4
    <5f6>   DW_AT_type        : <0x46>
    <5fa>   DW_AT_decl_file   : 11
    <5fb>   DW_AT_decl_line   : 160
    <5fc>   DW_AT_sibling     : <0x619>
 <2><600>: Abbrev Number: 19 (DW_TAG_enumerator)
    <601>   DW_AT_name        : (indirect string, offset: 0x4832): UML_PUBLIC
    <605>   DW_AT_const_value : 0
 <2><606>: Abbrev Number: 19 (DW_TAG_enumerator)
    <607>   DW_AT_name        : (indirect string, offset: 0x101b): UML_PRIVATE
    <60b>   DW_AT_const_value : 1
 <2><60c>: Abbrev Number: 19 (DW_TAG_enumerator)
    <60d>   DW_AT_name        : (indirect string, offset: 0x2dad): UML_PROTECTED
    <611>   DW_AT_const_value : 2
 <2><612>: Abbrev Number: 19 (DW_TAG_enumerator)
    <613>   DW_AT_name        : (indirect string, offset: 0x512c): UML_PACKAGE
    <617>   DW_AT_const_value : 3
 <2><618>: Abbrev Number: 0
 <1><619>: Abbrev Number: 2 (DW_TAG_typedef)
    <61a>   DW_AT_name        : (indirect string, offset: 0x22f7): UML_PseudostateKind
    <61e>   DW_AT_decl_file   : 11
    <61f>   DW_AT_decl_line   : 161
    <620>   DW_AT_type        : <0x624>
 <1><624>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <625>   DW_AT_name        : (indirect string, offset: 0x22f7): UML_PseudostateKind
    <629>   DW_AT_byte_size   : 4
    <62a>   DW_AT_type        : <0x46>
    <62e>   DW_AT_decl_file   : 11
    <62f>   DW_AT_decl_line   : 161
    <630>   DW_AT_sibling     : <0x671>
 <2><634>: Abbrev Number: 19 (DW_TAG_enumerator)
    <635>   DW_AT_name        : (indirect string, offset: 0x4f64): UML_INITIAL
    <639>   DW_AT_const_value : 0
 <2><63a>: Abbrev Number: 19 (DW_TAG_enumerator)
    <63b>   DW_AT_name        : (indirect string, offset: 0x76bb): UML_DEEPHISTORY
    <63f>   DW_AT_const_value : 1
 <2><640>: Abbrev Number: 19 (DW_TAG_enumerator)
    <641>   DW_AT_name        : (indirect string, offset: 0x6bd): UML_SHALLOWHISTORY
    <645>   DW_AT_const_value : 2
 <2><646>: Abbrev Number: 19 (DW_TAG_enumerator)
    <647>   DW_AT_name        : (indirect string, offset: 0x52ad): UML_JOIN
    <64b>   DW_AT_const_value : 3
 <2><64c>: Abbrev Number: 19 (DW_TAG_enumerator)
    <64d>   DW_AT_name        : (indirect string, offset: 0x73fd): UML_FORK
    <651>   DW_AT_const_value : 4
 <2><652>: Abbrev Number: 19 (DW_TAG_enumerator)
    <653>   DW_AT_name        : (indirect string, offset: 0x2da0): UML_JUNCTION
    <657>   DW_AT_const_value : 5
 <2><658>: Abbrev Number: 19 (DW_TAG_enumerator)
    <659>   DW_AT_name        : (indirect string, offset: 0xa94): UML_CHOICE
    <65d>   DW_AT_const_value : 6
 <2><65e>: Abbrev Number: 19 (DW_TAG_enumerator)
    <65f>   DW_AT_name        : (indirect string, offset: 0x76e3): UML_ENTRYPOINT
    <663>   DW_AT_const_value : 7
 <2><664>: Abbrev Number: 19 (DW_TAG_enumerator)
    <665>   DW_AT_name        : (indirect string, offset: 0x6cd8): UML_EXITPOINT
    <669>   DW_AT_const_value : 8
 <2><66a>: Abbrev Number: 19 (DW_TAG_enumerator)
    <66b>   DW_AT_name        : (indirect string, offset: 0x112d): UML_TERMINATE
    <66f>   DW_AT_const_value : 9
 <2><670>: Abbrev Number: 0
 <1><671>: Abbrev Number: 2 (DW_TAG_typedef)
    <672>   DW_AT_name        : (indirect string, offset: 0x3542): UML_AggregationKind
    <676>   DW_AT_decl_file   : 11
    <677>   DW_AT_decl_line   : 162
    <678>   DW_AT_type        : <0x67c>
 <1><67c>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <67d>   DW_AT_name        : (indirect string, offset: 0x3542): UML_AggregationKind
    <681>   DW_AT_byte_size   : 4
    <682>   DW_AT_type        : <0x46>
    <686>   DW_AT_decl_file   : 11
    <687>   DW_AT_decl_line   : 162
    <688>   DW_AT_sibling     : <0x69f>
 <2><68c>: Abbrev Number: 19 (DW_TAG_enumerator)
    <68d>   DW_AT_name        : (indirect string, offset: 0x679f): UML_NONE
    <691>   DW_AT_const_value : 0
 <2><692>: Abbrev Number: 19 (DW_TAG_enumerator)
    <693>   DW_AT_name        : (indirect string, offset: 0x2bde): UML_SHARED
    <697>   DW_AT_const_value : 1
 <2><698>: Abbrev Number: 19 (DW_TAG_enumerator)
    <699>   DW_AT_name        : (indirect string, offset: 0x16e8): UML_COMPOSITE
    <69d>   DW_AT_const_value : 2
 <2><69e>: Abbrev Number: 0
 <1><69f>: Abbrev Number: 2 (DW_TAG_typedef)
    <6a0>   DW_AT_name        : (indirect string, offset: 0x5cf9): UML_Constraint
    <6a4>   DW_AT_decl_file   : 11
    <6a5>   DW_AT_decl_line   : 163
    <6a6>   DW_AT_type        : <0x6aa>
 <1><6aa>: Abbrev Number: 21 (DW_TAG_structure_type)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x5cf9): UML_Constraint
    <6af>   DW_AT_byte_size   : 24
    <6b0>   DW_AT_decl_file   : 11
    <6b1>   DW_AT_decl_line   : 485
    <6b3>   DW_AT_sibling     : <0x6ec>
 <2><6b7>: Abbrev Number: 10 (DW_TAG_member)
    <6b8>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <6bc>   DW_AT_decl_file   : 11
    <6bd>   DW_AT_decl_line   : 486
    <6bf>   DW_AT_type        : <0x476>
    <6c3>   DW_AT_data_member_location: 0
 <2><6c4>: Abbrev Number: 10 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <6c9>   DW_AT_decl_file   : 11
    <6ca>   DW_AT_decl_line   : 487
    <6cc>   DW_AT_type        : <0x5e5>
    <6d0>   DW_AT_data_member_location: 4
 <2><6d1>: Abbrev Number: 10 (DW_TAG_member)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <6d6>   DW_AT_decl_file   : 11
    <6d7>   DW_AT_decl_line   : 487
    <6d9>   DW_AT_type        : <0xad>
    <6dd>   DW_AT_data_member_location: 8
 <2><6de>: Abbrev Number: 10 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0xdce): specification
    <6e3>   DW_AT_decl_file   : 11
    <6e4>   DW_AT_decl_line   : 488
    <6e6>   DW_AT_type        : <0xfc2>
    <6ea>   DW_AT_data_member_location: 16
 <2><6eb>: Abbrev Number: 0
 <1><6ec>: Abbrev Number: 2 (DW_TAG_typedef)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x40a8): UML_ConnectorEnd
    <6f1>   DW_AT_decl_file   : 11
    <6f2>   DW_AT_decl_line   : 164
    <6f3>   DW_AT_type        : <0x6f7>
 <1><6f7>: Abbrev Number: 21 (DW_TAG_structure_type)
    <6f8>   DW_AT_name        : (indirect string, offset: 0x40a8): UML_ConnectorEnd
    <6fc>   DW_AT_byte_size   : 24
    <6fd>   DW_AT_decl_file   : 11
    <6fe>   DW_AT_decl_line   : 498
    <700>   DW_AT_sibling     : <0x739>
 <2><704>: Abbrev Number: 10 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <709>   DW_AT_decl_file   : 11
    <70a>   DW_AT_decl_line   : 499
    <70c>   DW_AT_type        : <0x476>
    <710>   DW_AT_data_member_location: 0
 <2><711>: Abbrev Number: 10 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0x1fa5): lower
    <716>   DW_AT_decl_file   : 11
    <717>   DW_AT_decl_line   : 500
    <719>   DW_AT_type        : <0x3f>
    <71d>   DW_AT_data_member_location: 4
 <2><71e>: Abbrev Number: 10 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0x70f1): role
    <723>   DW_AT_decl_file   : 11
    <724>   DW_AT_decl_line   : 501
    <726>   DW_AT_type        : <0xfc8>
    <72a>   DW_AT_data_member_location: 8
 <2><72b>: Abbrev Number: 10 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0x5f3): partWithPort
    <730>   DW_AT_decl_file   : 11
    <731>   DW_AT_decl_line   : 501
    <733>   DW_AT_type        : <0xfc8>
    <737>   DW_AT_data_member_location: 16
 <2><738>: Abbrev Number: 0
 <1><739>: Abbrev Number: 2 (DW_TAG_typedef)
    <73a>   DW_AT_name        : (indirect string, offset: 0x1167): UML_SignalEvent
    <73e>   DW_AT_decl_file   : 11
    <73f>   DW_AT_decl_line   : 165
    <740>   DW_AT_type        : <0x744>
 <1><744>: Abbrev Number: 21 (DW_TAG_structure_type)
    <745>   DW_AT_name        : (indirect string, offset: 0x1167): UML_SignalEvent
    <749>   DW_AT_byte_size   : 32
    <74a>   DW_AT_decl_file   : 11
    <74b>   DW_AT_decl_line   : 511
    <74d>   DW_AT_sibling     : <0x793>
 <2><751>: Abbrev Number: 10 (DW_TAG_member)
    <752>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <756>   DW_AT_decl_file   : 11
    <757>   DW_AT_decl_line   : 512
    <759>   DW_AT_type        : <0x476>
    <75d>   DW_AT_data_member_location: 0
 <2><75e>: Abbrev Number: 10 (DW_TAG_member)
    <75f>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <763>   DW_AT_decl_file   : 11
    <764>   DW_AT_decl_line   : 513
    <766>   DW_AT_type        : <0x5e5>
    <76a>   DW_AT_data_member_location: 4
 <2><76b>: Abbrev Number: 10 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <770>   DW_AT_decl_file   : 11
    <771>   DW_AT_decl_line   : 513
    <773>   DW_AT_type        : <0xad>
    <777>   DW_AT_data_member_location: 8
 <2><778>: Abbrev Number: 10 (DW_TAG_member)
    <779>   DW_AT_name        : (indirect string, offset: 0x5159): c_index
    <77d>   DW_AT_decl_file   : 11
    <77e>   DW_AT_decl_line   : 514
    <780>   DW_AT_type        : <0x35e>
    <784>   DW_AT_data_member_location: 16
 <2><785>: Abbrev Number: 10 (DW_TAG_member)
    <786>   DW_AT_name        : (indirect string, offset: 0x233c): signal
    <78a>   DW_AT_decl_file   : 11
    <78b>   DW_AT_decl_line   : 514
    <78d>   DW_AT_type        : <0xf98>
    <791>   DW_AT_data_member_location: 24
 <2><792>: Abbrev Number: 0
 <1><793>: Abbrev Number: 2 (DW_TAG_typedef)
    <794>   DW_AT_name        : (indirect string, offset: 0xb45): UML_Connector
    <798>   DW_AT_decl_file   : 11
    <799>   DW_AT_decl_line   : 166
    <79a>   DW_AT_type        : <0x79e>
 <1><79e>: Abbrev Number: 21 (DW_TAG_structure_type)
    <79f>   DW_AT_name        : (indirect string, offset: 0xb45): UML_Connector
    <7a3>   DW_AT_byte_size   : 32
    <7a4>   DW_AT_decl_file   : 11
    <7a5>   DW_AT_decl_line   : 524
    <7a7>   DW_AT_sibling     : <0x7ed>
 <2><7ab>: Abbrev Number: 10 (DW_TAG_member)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <7b0>   DW_AT_decl_file   : 11
    <7b1>   DW_AT_decl_line   : 525
    <7b3>   DW_AT_type        : <0x476>
    <7b7>   DW_AT_data_member_location: 0
 <2><7b8>: Abbrev Number: 10 (DW_TAG_member)
    <7b9>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <7bd>   DW_AT_decl_file   : 11
    <7be>   DW_AT_decl_line   : 526
    <7c0>   DW_AT_type        : <0x5e5>
    <7c4>   DW_AT_data_member_location: 4
 <2><7c5>: Abbrev Number: 10 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <7ca>   DW_AT_decl_file   : 11
    <7cb>   DW_AT_decl_line   : 526
    <7cd>   DW_AT_type        : <0xad>
    <7d1>   DW_AT_data_member_location: 8
 <2><7d2>: Abbrev Number: 22 (DW_TAG_member)
    <7d3>   DW_AT_name        : end
    <7d7>   DW_AT_decl_file   : 11
    <7d8>   DW_AT_decl_line   : 527
    <7da>   DW_AT_type        : <0xfce>
    <7de>   DW_AT_data_member_location: 16
 <2><7df>: Abbrev Number: 10 (DW_TAG_member)
    <7e0>   DW_AT_name        : (indirect string, offset: 0xb32): type
    <7e4>   DW_AT_decl_file   : 11
    <7e5>   DW_AT_decl_line   : 527
    <7e7>   DW_AT_type        : <0xfbc>
    <7eb>   DW_AT_data_member_location: 24
 <2><7ec>: Abbrev Number: 0
 <1><7ed>: Abbrev Number: 2 (DW_TAG_typedef)
    <7ee>   DW_AT_name        : (indirect string, offset: 0x6dda): UML_InterfaceRealization
    <7f2>   DW_AT_decl_file   : 11
    <7f3>   DW_AT_decl_line   : 167
    <7f4>   DW_AT_type        : <0x7f8>
 <1><7f8>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7f9>   DW_AT_name        : (indirect string, offset: 0x6dda): UML_InterfaceRealization
    <7fd>   DW_AT_byte_size   : 16
    <7fe>   DW_AT_decl_file   : 11
    <7ff>   DW_AT_decl_line   : 537
    <801>   DW_AT_sibling     : <0x820>
 <2><805>: Abbrev Number: 10 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <80a>   DW_AT_decl_file   : 11
    <80b>   DW_AT_decl_line   : 538
    <80d>   DW_AT_type        : <0x476>
    <811>   DW_AT_data_member_location: 0
 <2><812>: Abbrev Number: 10 (DW_TAG_member)
    <813>   DW_AT_name        : (indirect string, offset: 0x3f37): contract
    <817>   DW_AT_decl_file   : 11
    <818>   DW_AT_decl_line   : 539
    <81a>   DW_AT_type        : <0xfd4>
    <81e>   DW_AT_data_member_location: 8
 <2><81f>: Abbrev Number: 0
 <1><820>: Abbrev Number: 2 (DW_TAG_typedef)
    <821>   DW_AT_name        : (indirect string, offset: 0x6586): UML_Interface
    <825>   DW_AT_decl_file   : 11
    <826>   DW_AT_decl_line   : 169
    <827>   DW_AT_type        : <0x82b>
 <1><82b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <82c>   DW_AT_name        : (indirect string, offset: 0x6586): UML_Interface
    <830>   DW_AT_byte_size   : 40
    <831>   DW_AT_decl_file   : 11
    <832>   DW_AT_decl_line   : 562
    <834>   DW_AT_sibling     : <0x887>
 <2><838>: Abbrev Number: 10 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <83d>   DW_AT_decl_file   : 11
    <83e>   DW_AT_decl_line   : 563
    <840>   DW_AT_type        : <0x476>
    <844>   DW_AT_data_member_location: 0
 <2><845>: Abbrev Number: 10 (DW_TAG_member)
    <846>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <84a>   DW_AT_decl_file   : 11
    <84b>   DW_AT_decl_line   : 564
    <84d>   DW_AT_type        : <0x5e5>
    <851>   DW_AT_data_member_location: 4
 <2><852>: Abbrev Number: 10 (DW_TAG_member)
    <853>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <857>   DW_AT_decl_file   : 11
    <858>   DW_AT_decl_line   : 564
    <85a>   DW_AT_type        : <0xad>
    <85e>   DW_AT_data_member_location: 8
 <2><85f>: Abbrev Number: 10 (DW_TAG_member)
    <860>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <864>   DW_AT_decl_file   : 11
    <865>   DW_AT_decl_line   : 565
    <867>   DW_AT_type        : <0x41d>
    <86b>   DW_AT_data_member_location: 16
 <2><86c>: Abbrev Number: 10 (DW_TAG_member)
    <86d>   DW_AT_name        : (indirect string, offset: 0x1931): ownedAttribute
    <871>   DW_AT_decl_file   : 11
    <872>   DW_AT_decl_line   : 565
    <874>   DW_AT_type        : <0xfe0>
    <878>   DW_AT_data_member_location: 24
 <2><879>: Abbrev Number: 10 (DW_TAG_member)
    <87a>   DW_AT_name        : (indirect string, offset: 0x56e7): ownedReception
    <87e>   DW_AT_decl_file   : 11
    <87f>   DW_AT_decl_line   : 565
    <881>   DW_AT_type        : <0xfe6>
    <885>   DW_AT_data_member_location: 32
 <2><886>: Abbrev Number: 0
 <1><887>: Abbrev Number: 2 (DW_TAG_typedef)
    <888>   DW_AT_name        : (indirect string, offset: 0x19): UML_Reception
    <88c>   DW_AT_decl_file   : 11
    <88d>   DW_AT_decl_line   : 170
    <88e>   DW_AT_type        : <0x892>
 <1><892>: Abbrev Number: 21 (DW_TAG_structure_type)
    <893>   DW_AT_name        : (indirect string, offset: 0x19): UML_Reception
    <897>   DW_AT_byte_size   : 24
    <898>   DW_AT_decl_file   : 11
    <899>   DW_AT_decl_line   : 575
    <89b>   DW_AT_sibling     : <0x8d4>
 <2><89f>: Abbrev Number: 10 (DW_TAG_member)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <8a4>   DW_AT_decl_file   : 11
    <8a5>   DW_AT_decl_line   : 576
    <8a7>   DW_AT_type        : <0x476>
    <8ab>   DW_AT_data_member_location: 0
 <2><8ac>: Abbrev Number: 10 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <8b1>   DW_AT_decl_file   : 11
    <8b2>   DW_AT_decl_line   : 577
    <8b4>   DW_AT_type        : <0x5e5>
    <8b8>   DW_AT_data_member_location: 4
 <2><8b9>: Abbrev Number: 10 (DW_TAG_member)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <8be>   DW_AT_decl_file   : 11
    <8bf>   DW_AT_decl_line   : 577
    <8c1>   DW_AT_type        : <0xad>
    <8c5>   DW_AT_data_member_location: 8
 <2><8c6>: Abbrev Number: 10 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x233c): signal
    <8cb>   DW_AT_decl_file   : 11
    <8cc>   DW_AT_decl_line   : 578
    <8ce>   DW_AT_type        : <0xf98>
    <8d2>   DW_AT_data_member_location: 16
 <2><8d3>: Abbrev Number: 0
 <1><8d4>: Abbrev Number: 2 (DW_TAG_typedef)
    <8d5>   DW_AT_name        : (indirect string, offset: 0x7476): UML_Pseudostate
    <8d9>   DW_AT_decl_file   : 11
    <8da>   DW_AT_decl_line   : 171
    <8db>   DW_AT_type        : <0x8df>
 <1><8df>: Abbrev Number: 21 (DW_TAG_structure_type)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x7476): UML_Pseudostate
    <8e4>   DW_AT_byte_size   : 48
    <8e5>   DW_AT_decl_file   : 11
    <8e6>   DW_AT_decl_line   : 588
    <8e8>   DW_AT_sibling     : <0x948>
 <2><8ec>: Abbrev Number: 10 (DW_TAG_member)
    <8ed>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <8f1>   DW_AT_decl_file   : 11
    <8f2>   DW_AT_decl_line   : 589
    <8f4>   DW_AT_type        : <0x476>
    <8f8>   DW_AT_data_member_location: 0
 <2><8f9>: Abbrev Number: 10 (DW_TAG_member)
    <8fa>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <8fe>   DW_AT_decl_file   : 11
    <8ff>   DW_AT_decl_line   : 590
    <901>   DW_AT_type        : <0x5e5>
    <905>   DW_AT_data_member_location: 4
 <2><906>: Abbrev Number: 10 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <90b>   DW_AT_decl_file   : 11
    <90c>   DW_AT_decl_line   : 590
    <90e>   DW_AT_type        : <0xad>
    <912>   DW_AT_data_member_location: 8
 <2><913>: Abbrev Number: 10 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <918>   DW_AT_decl_file   : 11
    <919>   DW_AT_decl_line   : 591
    <91b>   DW_AT_type        : <0x441>
    <91f>   DW_AT_data_member_location: 16
 <2><920>: Abbrev Number: 10 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0x5cca): incoming
    <925>   DW_AT_decl_file   : 11
    <926>   DW_AT_decl_line   : 591
    <928>   DW_AT_type        : <0xff2>
    <92c>   DW_AT_data_member_location: 24
 <2><92d>: Abbrev Number: 10 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0x483d): outgoing
    <932>   DW_AT_decl_file   : 11
    <933>   DW_AT_decl_line   : 591
    <935>   DW_AT_type        : <0xff2>
    <939>   DW_AT_data_member_location: 32
 <2><93a>: Abbrev Number: 10 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0xf24): kind
    <93f>   DW_AT_decl_file   : 11
    <940>   DW_AT_decl_line   : 592
    <942>   DW_AT_type        : <0x619>
    <946>   DW_AT_data_member_location: 40
 <2><947>: Abbrev Number: 0
 <1><948>: Abbrev Number: 2 (DW_TAG_typedef)
    <949>   DW_AT_name        : (indirect string, offset: 0x5564): UML_Vertex
    <94d>   DW_AT_decl_file   : 11
    <94e>   DW_AT_decl_line   : 172
    <94f>   DW_AT_type        : <0x953>
 <1><953>: Abbrev Number: 21 (DW_TAG_structure_type)
    <954>   DW_AT_name        : (indirect string, offset: 0x5564): UML_Vertex
    <958>   DW_AT_byte_size   : 40
    <959>   DW_AT_decl_file   : 11
    <95a>   DW_AT_decl_line   : 602
    <95c>   DW_AT_sibling     : <0x9af>
 <2><960>: Abbrev Number: 10 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <965>   DW_AT_decl_file   : 11
    <966>   DW_AT_decl_line   : 603
    <968>   DW_AT_type        : <0x476>
    <96c>   DW_AT_data_member_location: 0
 <2><96d>: Abbrev Number: 10 (DW_TAG_member)
    <96e>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <972>   DW_AT_decl_file   : 11
    <973>   DW_AT_decl_line   : 604
    <975>   DW_AT_type        : <0x5e5>
    <979>   DW_AT_data_member_location: 4
 <2><97a>: Abbrev Number: 10 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <97f>   DW_AT_decl_file   : 11
    <980>   DW_AT_decl_line   : 604
    <982>   DW_AT_type        : <0xad>
    <986>   DW_AT_data_member_location: 8
 <2><987>: Abbrev Number: 10 (DW_TAG_member)
    <988>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <98c>   DW_AT_decl_file   : 11
    <98d>   DW_AT_decl_line   : 605
    <98f>   DW_AT_type        : <0x441>
    <993>   DW_AT_data_member_location: 16
 <2><994>: Abbrev Number: 10 (DW_TAG_member)
    <995>   DW_AT_name        : (indirect string, offset: 0x5cca): incoming
    <999>   DW_AT_decl_file   : 11
    <99a>   DW_AT_decl_line   : 605
    <99c>   DW_AT_type        : <0xff2>
    <9a0>   DW_AT_data_member_location: 24
 <2><9a1>: Abbrev Number: 10 (DW_TAG_member)
    <9a2>   DW_AT_name        : (indirect string, offset: 0x483d): outgoing
    <9a6>   DW_AT_decl_file   : 11
    <9a7>   DW_AT_decl_line   : 605
    <9a9>   DW_AT_type        : <0xff2>
    <9ad>   DW_AT_data_member_location: 32
 <2><9ae>: Abbrev Number: 0
 <1><9af>: Abbrev Number: 2 (DW_TAG_typedef)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x5180): UML_Association
    <9b4>   DW_AT_decl_file   : 11
    <9b5>   DW_AT_decl_line   : 173
    <9b6>   DW_AT_type        : <0x9ba>
 <1><9ba>: Abbrev Number: 21 (DW_TAG_structure_type)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x5180): UML_Association
    <9bf>   DW_AT_byte_size   : 40
    <9c0>   DW_AT_decl_file   : 11
    <9c1>   DW_AT_decl_line   : 615
    <9c3>   DW_AT_sibling     : <0xa16>
 <2><9c7>: Abbrev Number: 10 (DW_TAG_member)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <9cc>   DW_AT_decl_file   : 11
    <9cd>   DW_AT_decl_line   : 616
    <9cf>   DW_AT_type        : <0x476>
    <9d3>   DW_AT_data_member_location: 0
 <2><9d4>: Abbrev Number: 10 (DW_TAG_member)
    <9d5>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <9d9>   DW_AT_decl_file   : 11
    <9da>   DW_AT_decl_line   : 617
    <9dc>   DW_AT_type        : <0x5e5>
    <9e0>   DW_AT_data_member_location: 4
 <2><9e1>: Abbrev Number: 10 (DW_TAG_member)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <9e6>   DW_AT_decl_file   : 11
    <9e7>   DW_AT_decl_line   : 617
    <9e9>   DW_AT_type        : <0xad>
    <9ed>   DW_AT_data_member_location: 8
 <2><9ee>: Abbrev Number: 10 (DW_TAG_member)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <9f3>   DW_AT_decl_file   : 11
    <9f4>   DW_AT_decl_line   : 618
    <9f6>   DW_AT_type        : <0x41d>
    <9fa>   DW_AT_data_member_location: 16
 <2><9fb>: Abbrev Number: 10 (DW_TAG_member)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x1337): memberEnd
    <a00>   DW_AT_decl_file   : 11
    <a01>   DW_AT_decl_line   : 618
    <a03>   DW_AT_type        : <0xfe0>
    <a07>   DW_AT_data_member_location: 24
 <2><a08>: Abbrev Number: 10 (DW_TAG_member)
    <a09>   DW_AT_name        : (indirect string, offset: 0x6594): ownedEnd
    <a0d>   DW_AT_decl_file   : 11
    <a0e>   DW_AT_decl_line   : 618
    <a10>   DW_AT_type        : <0xfe0>
    <a14>   DW_AT_data_member_location: 32
 <2><a15>: Abbrev Number: 0
 <1><a16>: Abbrev Number: 2 (DW_TAG_typedef)
    <a17>   DW_AT_name        : (indirect string, offset: 0x2a48): UML_ValueSpecification
    <a1b>   DW_AT_decl_file   : 11
    <a1c>   DW_AT_decl_line   : 174
    <a1d>   DW_AT_type        : <0xa21>
 <1><a21>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a22>   DW_AT_name        : (indirect string, offset: 0x2a48): UML_ValueSpecification
    <a26>   DW_AT_byte_size   : 4
    <a27>   DW_AT_decl_file   : 11
    <a28>   DW_AT_decl_line   : 628
    <a2a>   DW_AT_sibling     : <0xa3c>
 <2><a2e>: Abbrev Number: 10 (DW_TAG_member)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <a33>   DW_AT_decl_file   : 11
    <a34>   DW_AT_decl_line   : 629
    <a36>   DW_AT_type        : <0x476>
    <a3a>   DW_AT_data_member_location: 0
 <2><a3b>: Abbrev Number: 0
 <1><a3c>: Abbrev Number: 2 (DW_TAG_typedef)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x21c7): UML_Property
    <a41>   DW_AT_decl_file   : 11
    <a42>   DW_AT_decl_line   : 175
    <a43>   DW_AT_type        : <0xa47>
 <1><a47>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a48>   DW_AT_name        : (indirect string, offset: 0x21c7): UML_Property
    <a4c>   DW_AT_byte_size   : 56
    <a4d>   DW_AT_decl_file   : 11
    <a4e>   DW_AT_decl_line   : 640
    <a50>   DW_AT_sibling     : <0xabd>
 <2><a54>: Abbrev Number: 10 (DW_TAG_member)
    <a55>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <a59>   DW_AT_decl_file   : 11
    <a5a>   DW_AT_decl_line   : 641
    <a5c>   DW_AT_type        : <0x476>
    <a60>   DW_AT_data_member_location: 0
 <2><a61>: Abbrev Number: 10 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <a66>   DW_AT_decl_file   : 11
    <a67>   DW_AT_decl_line   : 642
    <a69>   DW_AT_type        : <0x5e5>
    <a6d>   DW_AT_data_member_location: 4
 <2><a6e>: Abbrev Number: 10 (DW_TAG_member)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <a73>   DW_AT_decl_file   : 11
    <a74>   DW_AT_decl_line   : 642
    <a76>   DW_AT_type        : <0xad>
    <a7a>   DW_AT_data_member_location: 8
 <2><a7b>: Abbrev Number: 10 (DW_TAG_member)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xb32): type
    <a80>   DW_AT_decl_file   : 11
    <a81>   DW_AT_decl_line   : 643
    <a83>   DW_AT_type        : <0xfb0>
    <a87>   DW_AT_data_member_location: 16
 <2><a88>: Abbrev Number: 10 (DW_TAG_member)
    <a89>   DW_AT_name        : (indirect string, offset: 0x1fa5): lower
    <a8d>   DW_AT_decl_file   : 11
    <a8e>   DW_AT_decl_line   : 644
    <a90>   DW_AT_type        : <0x3f>
    <a94>   DW_AT_data_member_location: 24
 <2><a95>: Abbrev Number: 10 (DW_TAG_member)
    <a96>   DW_AT_name        : (indirect string, offset: 0x6f19): association
    <a9a>   DW_AT_decl_file   : 11
    <a9b>   DW_AT_decl_line   : 645
    <a9d>   DW_AT_type        : <0xfbc>
    <aa1>   DW_AT_data_member_location: 32
 <2><aa2>: Abbrev Number: 10 (DW_TAG_member)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x3e82): aggregation
    <aa7>   DW_AT_decl_file   : 11
    <aa8>   DW_AT_decl_line   : 645
    <aaa>   DW_AT_type        : <0x671>
    <aae>   DW_AT_data_member_location: 40
 <2><aaf>: Abbrev Number: 10 (DW_TAG_member)
    <ab0>   DW_AT_name        : (indirect string, offset: 0x1430): class
    <ab4>   DW_AT_decl_file   : 11
    <ab5>   DW_AT_decl_line   : 645
    <ab7>   DW_AT_type        : <0xfb0>
    <abb>   DW_AT_data_member_location: 48
 <2><abc>: Abbrev Number: 0
 <1><abd>: Abbrev Number: 2 (DW_TAG_typedef)
    <abe>   DW_AT_name        : (indirect string, offset: 0x3ef0): UML_Transition
    <ac2>   DW_AT_decl_file   : 11
    <ac3>   DW_AT_decl_line   : 176
    <ac4>   DW_AT_type        : <0xac8>
 <1><ac8>: Abbrev Number: 21 (DW_TAG_structure_type)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x3ef0): UML_Transition
    <acd>   DW_AT_byte_size   : 56
    <ace>   DW_AT_decl_file   : 11
    <acf>   DW_AT_decl_line   : 655
    <ad1>   DW_AT_sibling     : <0xb3e>
 <2><ad5>: Abbrev Number: 10 (DW_TAG_member)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <ada>   DW_AT_decl_file   : 11
    <adb>   DW_AT_decl_line   : 656
    <add>   DW_AT_type        : <0x476>
    <ae1>   DW_AT_data_member_location: 0
 <2><ae2>: Abbrev Number: 10 (DW_TAG_member)
    <ae3>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <ae7>   DW_AT_decl_file   : 11
    <ae8>   DW_AT_decl_line   : 657
    <aea>   DW_AT_type        : <0x5e5>
    <aee>   DW_AT_data_member_location: 4
 <2><aef>: Abbrev Number: 10 (DW_TAG_member)
    <af0>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <af4>   DW_AT_decl_file   : 11
    <af5>   DW_AT_decl_line   : 657
    <af7>   DW_AT_type        : <0xad>
    <afb>   DW_AT_data_member_location: 8
 <2><afc>: Abbrev Number: 10 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0x600): guard
    <b01>   DW_AT_decl_file   : 11
    <b02>   DW_AT_decl_line   : 658
    <b04>   DW_AT_type        : <0xffe>
    <b08>   DW_AT_data_member_location: 16
 <2><b09>: Abbrev Number: 10 (DW_TAG_member)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x4694): effect
    <b0e>   DW_AT_decl_file   : 11
    <b0f>   DW_AT_decl_line   : 658
    <b11>   DW_AT_type        : <0x1004>
    <b15>   DW_AT_data_member_location: 24
 <2><b16>: Abbrev Number: 10 (DW_TAG_member)
    <b17>   DW_AT_name        : (indirect string, offset: 0x4116): trigger
    <b1b>   DW_AT_decl_file   : 11
    <b1c>   DW_AT_decl_line   : 658
    <b1e>   DW_AT_type        : <0x100a>
    <b22>   DW_AT_data_member_location: 32
 <2><b23>: Abbrev Number: 10 (DW_TAG_member)
    <b24>   DW_AT_name        : (indirect string, offset: 0x2498): source
    <b28>   DW_AT_decl_file   : 11
    <b29>   DW_AT_decl_line   : 658
    <b2b>   DW_AT_type        : <0x1010>
    <b2f>   DW_AT_data_member_location: 40
 <2><b30>: Abbrev Number: 10 (DW_TAG_member)
    <b31>   DW_AT_name        : (indirect string, offset: 0x3396): target
    <b35>   DW_AT_decl_file   : 11
    <b36>   DW_AT_decl_line   : 658
    <b38>   DW_AT_type        : <0x1010>
    <b3c>   DW_AT_data_member_location: 48
 <2><b3d>: Abbrev Number: 0
 <1><b3e>: Abbrev Number: 2 (DW_TAG_typedef)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x2f9e): UML_PrimitiveType
    <b43>   DW_AT_decl_file   : 11
    <b44>   DW_AT_decl_line   : 179
    <b45>   DW_AT_type        : <0xb49>
 <1><b49>: Abbrev Number: 21 (DW_TAG_structure_type)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x2f9e): UML_PrimitiveType
    <b4e>   DW_AT_byte_size   : 24
    <b4f>   DW_AT_decl_file   : 11
    <b50>   DW_AT_decl_line   : 692
    <b52>   DW_AT_sibling     : <0xb8b>
 <2><b56>: Abbrev Number: 10 (DW_TAG_member)
    <b57>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <b5b>   DW_AT_decl_file   : 11
    <b5c>   DW_AT_decl_line   : 693
    <b5e>   DW_AT_type        : <0x476>
    <b62>   DW_AT_data_member_location: 0
 <2><b63>: Abbrev Number: 10 (DW_TAG_member)
    <b64>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <b68>   DW_AT_decl_file   : 11
    <b69>   DW_AT_decl_line   : 694
    <b6b>   DW_AT_type        : <0x5e5>
    <b6f>   DW_AT_data_member_location: 4
 <2><b70>: Abbrev Number: 10 (DW_TAG_member)
    <b71>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <b75>   DW_AT_decl_file   : 11
    <b76>   DW_AT_decl_line   : 694
    <b78>   DW_AT_type        : <0xad>
    <b7c>   DW_AT_data_member_location: 8
 <2><b7d>: Abbrev Number: 10 (DW_TAG_member)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <b82>   DW_AT_decl_file   : 11
    <b83>   DW_AT_decl_line   : 695
    <b85>   DW_AT_type        : <0x41d>
    <b89>   DW_AT_data_member_location: 16
 <2><b8a>: Abbrev Number: 0
 <1><b8b>: Abbrev Number: 2 (DW_TAG_typedef)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x53c4): UML_StateMachine
    <b90>   DW_AT_decl_file   : 11
    <b91>   DW_AT_decl_line   : 180
    <b92>   DW_AT_type        : <0xb96>
 <1><b96>: Abbrev Number: 21 (DW_TAG_structure_type)
    <b97>   DW_AT_name        : (indirect string, offset: 0x53c4): UML_StateMachine
    <b9b>   DW_AT_byte_size   : 24
    <b9c>   DW_AT_decl_file   : 11
    <b9d>   DW_AT_decl_line   : 705
    <b9f>   DW_AT_sibling     : <0xbd8>
 <2><ba3>: Abbrev Number: 10 (DW_TAG_member)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <ba8>   DW_AT_decl_file   : 11
    <ba9>   DW_AT_decl_line   : 706
    <bab>   DW_AT_type        : <0x476>
    <baf>   DW_AT_data_member_location: 0
 <2><bb0>: Abbrev Number: 10 (DW_TAG_member)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <bb5>   DW_AT_decl_file   : 11
    <bb6>   DW_AT_decl_line   : 707
    <bb8>   DW_AT_type        : <0x5e5>
    <bbc>   DW_AT_data_member_location: 4
 <2><bbd>: Abbrev Number: 10 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <bc2>   DW_AT_decl_file   : 11
    <bc3>   DW_AT_decl_line   : 707
    <bc5>   DW_AT_type        : <0xad>
    <bc9>   DW_AT_data_member_location: 8
 <2><bca>: Abbrev Number: 10 (DW_TAG_member)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x5a55): region
    <bcf>   DW_AT_decl_file   : 11
    <bd0>   DW_AT_decl_line   : 708
    <bd2>   DW_AT_type        : <0x1022>
    <bd6>   DW_AT_data_member_location: 16
 <2><bd7>: Abbrev Number: 0
 <1><bd8>: Abbrev Number: 2 (DW_TAG_typedef)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x5674): UML_Behavior
    <bdd>   DW_AT_decl_file   : 11
    <bde>   DW_AT_decl_line   : 183
    <bdf>   DW_AT_type        : <0xbe3>
 <1><be3>: Abbrev Number: 21 (DW_TAG_structure_type)
    <be4>   DW_AT_name        : (indirect string, offset: 0x5674): UML_Behavior
    <be8>   DW_AT_byte_size   : 8
    <be9>   DW_AT_decl_file   : 11
    <bea>   DW_AT_decl_line   : 742
    <bec>   DW_AT_sibling     : <0xc0b>
 <2><bf0>: Abbrev Number: 10 (DW_TAG_member)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <bf5>   DW_AT_decl_file   : 11
    <bf6>   DW_AT_decl_line   : 743
    <bf8>   DW_AT_type        : <0x476>
    <bfc>   DW_AT_data_member_location: 0
 <2><bfd>: Abbrev Number: 10 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <c02>   DW_AT_decl_file   : 11
    <c03>   DW_AT_decl_line   : 744
    <c05>   DW_AT_type        : <0x46b>
    <c09>   DW_AT_data_member_location: 4
 <2><c0a>: Abbrev Number: 0
 <1><c0b>: Abbrev Number: 2 (DW_TAG_typedef)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x333): UML_OpaqueBehavior
    <c10>   DW_AT_decl_file   : 11
    <c11>   DW_AT_decl_line   : 184
    <c12>   DW_AT_type        : <0xc16>
 <1><c16>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c17>   DW_AT_name        : (indirect string, offset: 0x333): UML_OpaqueBehavior
    <c1b>   DW_AT_byte_size   : 48
    <c1c>   DW_AT_decl_file   : 11
    <c1d>   DW_AT_decl_line   : 754
    <c1f>   DW_AT_sibling     : <0xc7f>
 <2><c23>: Abbrev Number: 10 (DW_TAG_member)
    <c24>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <c28>   DW_AT_decl_file   : 11
    <c29>   DW_AT_decl_line   : 755
    <c2b>   DW_AT_type        : <0x476>
    <c2f>   DW_AT_data_member_location: 0
 <2><c30>: Abbrev Number: 10 (DW_TAG_member)
    <c31>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <c35>   DW_AT_decl_file   : 11
    <c36>   DW_AT_decl_line   : 756
    <c38>   DW_AT_type        : <0x5e5>
    <c3c>   DW_AT_data_member_location: 4
 <2><c3d>: Abbrev Number: 10 (DW_TAG_member)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <c42>   DW_AT_decl_file   : 11
    <c43>   DW_AT_decl_line   : 756
    <c45>   DW_AT_type        : <0xad>
    <c49>   DW_AT_data_member_location: 8
 <2><c4a>: Abbrev Number: 10 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <c4f>   DW_AT_decl_file   : 11
    <c50>   DW_AT_decl_line   : 757
    <c52>   DW_AT_type        : <0x46b>
    <c56>   DW_AT_data_member_location: 16
 <2><c57>: Abbrev Number: 10 (DW_TAG_member)
    <c58>   DW_AT_name        : (indirect string, offset: 0x1150): c_function
    <c5c>   DW_AT_decl_file   : 11
    <c5d>   DW_AT_decl_line   : 757
    <c5f>   DW_AT_type        : <0xab>
    <c63>   DW_AT_data_member_location: 24
 <2><c64>: Abbrev Number: 10 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0x1a91): language
    <c69>   DW_AT_decl_file   : 11
    <c6a>   DW_AT_decl_line   : 757
    <c6c>   DW_AT_type        : <0xfda>
    <c70>   DW_AT_data_member_location: 32
 <2><c71>: Abbrev Number: 10 (DW_TAG_member)
    <c72>   DW_AT_name        : (indirect string, offset: 0x21c2): body
    <c76>   DW_AT_decl_file   : 11
    <c77>   DW_AT_decl_line   : 757
    <c79>   DW_AT_type        : <0xfda>
    <c7d>   DW_AT_data_member_location: 40
 <2><c7e>: Abbrev Number: 0
 <1><c7f>: Abbrev Number: 2 (DW_TAG_typedef)
    <c80>   DW_AT_name        : (indirect string, offset: 0x5f4e): UML_State
    <c84>   DW_AT_decl_file   : 11
    <c85>   DW_AT_decl_line   : 185
    <c86>   DW_AT_type        : <0xc8a>
 <1><c8a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c8b>   DW_AT_name        : (indirect string, offset: 0x5f4e): UML_State
    <c8f>   DW_AT_byte_size   : 64
    <c90>   DW_AT_decl_file   : 11
    <c91>   DW_AT_decl_line   : 767
    <c93>   DW_AT_sibling     : <0xd0d>
 <2><c97>: Abbrev Number: 10 (DW_TAG_member)
    <c98>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <c9c>   DW_AT_decl_file   : 11
    <c9d>   DW_AT_decl_line   : 768
    <c9f>   DW_AT_type        : <0x476>
    <ca3>   DW_AT_data_member_location: 0
 <2><ca4>: Abbrev Number: 10 (DW_TAG_member)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <ca9>   DW_AT_decl_file   : 11
    <caa>   DW_AT_decl_line   : 769
    <cac>   DW_AT_type        : <0x5e5>
    <cb0>   DW_AT_data_member_location: 4
 <2><cb1>: Abbrev Number: 10 (DW_TAG_member)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <cb6>   DW_AT_decl_file   : 11
    <cb7>   DW_AT_decl_line   : 769
    <cb9>   DW_AT_type        : <0xad>
    <cbd>   DW_AT_data_member_location: 8
 <2><cbe>: Abbrev Number: 10 (DW_TAG_member)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <cc3>   DW_AT_decl_file   : 11
    <cc4>   DW_AT_decl_line   : 770
    <cc6>   DW_AT_type        : <0x441>
    <cca>   DW_AT_data_member_location: 16
 <2><ccb>: Abbrev Number: 10 (DW_TAG_member)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x5cca): incoming
    <cd0>   DW_AT_decl_file   : 11
    <cd1>   DW_AT_decl_line   : 770
    <cd3>   DW_AT_type        : <0xff2>
    <cd7>   DW_AT_data_member_location: 24
 <2><cd8>: Abbrev Number: 10 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x483d): outgoing
    <cdd>   DW_AT_decl_file   : 11
    <cde>   DW_AT_decl_line   : 770
    <ce0>   DW_AT_type        : <0xff2>
    <ce4>   DW_AT_data_member_location: 32
 <2><ce5>: Abbrev Number: 10 (DW_TAG_member)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x510c): entry
    <cea>   DW_AT_decl_file   : 11
    <ceb>   DW_AT_decl_line   : 771
    <ced>   DW_AT_type        : <0x1004>
    <cf1>   DW_AT_data_member_location: 40
 <2><cf2>: Abbrev Number: 10 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x73ae): exit
    <cf7>   DW_AT_decl_file   : 11
    <cf8>   DW_AT_decl_line   : 771
    <cfa>   DW_AT_type        : <0x1004>
    <cfe>   DW_AT_data_member_location: 48
 <2><cff>: Abbrev Number: 10 (DW_TAG_member)
    <d00>   DW_AT_name        : (indirect string, offset: 0x5afd): deferrableTrigger
    <d04>   DW_AT_decl_file   : 11
    <d05>   DW_AT_decl_line   : 771
    <d07>   DW_AT_type        : <0x100a>
    <d0b>   DW_AT_data_member_location: 56
 <2><d0c>: Abbrev Number: 0
 <1><d0d>: Abbrev Number: 2 (DW_TAG_typedef)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x115b): UML_Trigger
    <d12>   DW_AT_decl_file   : 11
    <d13>   DW_AT_decl_line   : 186
    <d14>   DW_AT_type        : <0xd18>
 <1><d18>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d19>   DW_AT_name        : (indirect string, offset: 0x115b): UML_Trigger
    <d1d>   DW_AT_byte_size   : 32
    <d1e>   DW_AT_decl_file   : 11
    <d1f>   DW_AT_decl_line   : 781
    <d21>   DW_AT_sibling     : <0xd67>
 <2><d25>: Abbrev Number: 10 (DW_TAG_member)
    <d26>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <d2a>   DW_AT_decl_file   : 11
    <d2b>   DW_AT_decl_line   : 782
    <d2d>   DW_AT_type        : <0x476>
    <d31>   DW_AT_data_member_location: 0
 <2><d32>: Abbrev Number: 10 (DW_TAG_member)
    <d33>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <d37>   DW_AT_decl_file   : 11
    <d38>   DW_AT_decl_line   : 783
    <d3a>   DW_AT_type        : <0x5e5>
    <d3e>   DW_AT_data_member_location: 4
 <2><d3f>: Abbrev Number: 10 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <d44>   DW_AT_decl_file   : 11
    <d45>   DW_AT_decl_line   : 783
    <d47>   DW_AT_type        : <0xad>
    <d4b>   DW_AT_data_member_location: 8
 <2><d4c>: Abbrev Number: 10 (DW_TAG_member)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x6005): port
    <d51>   DW_AT_decl_file   : 11
    <d52>   DW_AT_decl_line   : 784
    <d54>   DW_AT_type        : <0x102e>
    <d58>   DW_AT_data_member_location: 16
 <2><d59>: Abbrev Number: 10 (DW_TAG_member)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x4197): event
    <d5e>   DW_AT_decl_file   : 11
    <d5f>   DW_AT_decl_line   : 784
    <d61>   DW_AT_type        : <0xfa4>
    <d65>   DW_AT_data_member_location: 24
 <2><d66>: Abbrev Number: 0
 <1><d67>: Abbrev Number: 2 (DW_TAG_typedef)
    <d68>   DW_AT_name        : (indirect string, offset: 0x274): UML_Signal
    <d6c>   DW_AT_decl_file   : 11
    <d6d>   DW_AT_decl_line   : 188
    <d6e>   DW_AT_type        : <0xd72>
 <1><d72>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d73>   DW_AT_name        : (indirect string, offset: 0x274): UML_Signal
    <d77>   DW_AT_byte_size   : 24
    <d78>   DW_AT_decl_file   : 11
    <d79>   DW_AT_decl_line   : 806
    <d7b>   DW_AT_sibling     : <0xdb4>
 <2><d7f>: Abbrev Number: 10 (DW_TAG_member)
    <d80>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <d84>   DW_AT_decl_file   : 11
    <d85>   DW_AT_decl_line   : 807
    <d87>   DW_AT_type        : <0x476>
    <d8b>   DW_AT_data_member_location: 0
 <2><d8c>: Abbrev Number: 10 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <d91>   DW_AT_decl_file   : 11
    <d92>   DW_AT_decl_line   : 808
    <d94>   DW_AT_type        : <0x5e5>
    <d98>   DW_AT_data_member_location: 4
 <2><d99>: Abbrev Number: 10 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <d9e>   DW_AT_decl_file   : 11
    <d9f>   DW_AT_decl_line   : 808
    <da1>   DW_AT_type        : <0xad>
    <da5>   DW_AT_data_member_location: 8
 <2><da6>: Abbrev Number: 10 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x1931): ownedAttribute
    <dab>   DW_AT_decl_file   : 11
    <dac>   DW_AT_decl_line   : 809
    <dae>   DW_AT_type        : <0xfe0>
    <db2>   DW_AT_data_member_location: 16
 <2><db3>: Abbrev Number: 0
 <1><db4>: Abbrev Number: 2 (DW_TAG_typedef)
    <db5>   DW_AT_name        : (indirect string, offset: 0x19f2): UML_Class
    <db9>   DW_AT_decl_file   : 11
    <dba>   DW_AT_decl_line   : 189
    <dbb>   DW_AT_type        : <0xdbf>
 <1><dbf>: Abbrev Number: 21 (DW_TAG_structure_type)
    <dc0>   DW_AT_name        : (indirect string, offset: 0x19f2): UML_Class
    <dc4>   DW_AT_byte_size   : 88
    <dc5>   DW_AT_decl_file   : 11
    <dc6>   DW_AT_decl_line   : 819
    <dc8>   DW_AT_sibling     : <0xe69>
 <2><dcc>: Abbrev Number: 10 (DW_TAG_member)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <dd1>   DW_AT_decl_file   : 11
    <dd2>   DW_AT_decl_line   : 820
    <dd4>   DW_AT_type        : <0x476>
    <dd8>   DW_AT_data_member_location: 0
 <2><dd9>: Abbrev Number: 10 (DW_TAG_member)
    <dda>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <dde>   DW_AT_decl_file   : 11
    <ddf>   DW_AT_decl_line   : 821
    <de1>   DW_AT_type        : <0x5e5>
    <de5>   DW_AT_data_member_location: 4
 <2><de6>: Abbrev Number: 10 (DW_TAG_member)
    <de7>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <deb>   DW_AT_decl_file   : 11
    <dec>   DW_AT_decl_line   : 821
    <dee>   DW_AT_type        : <0xad>
    <df2>   DW_AT_data_member_location: 8
 <2><df3>: Abbrev Number: 10 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0xb0f): ownedConnector
    <df8>   DW_AT_decl_file   : 11
    <df9>   DW_AT_decl_line   : 822
    <dfb>   DW_AT_type        : <0x1016>
    <dff>   DW_AT_data_member_location: 16
 <2><e00>: Abbrev Number: 10 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0x1931): ownedAttribute
    <e05>   DW_AT_decl_file   : 11
    <e06>   DW_AT_decl_line   : 822
    <e08>   DW_AT_type        : <0xfe0>
    <e0c>   DW_AT_data_member_location: 24
 <2><e0d>: Abbrev Number: 10 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x1cc0): classifierBehavior
    <e12>   DW_AT_decl_file   : 11
    <e13>   DW_AT_decl_line   : 823
    <e15>   DW_AT_type        : <0x1004>
    <e19>   DW_AT_data_member_location: 32
 <2><e1a>: Abbrev Number: 10 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x678a): interfaceRealization
    <e1f>   DW_AT_decl_file   : 11
    <e20>   DW_AT_decl_line   : 823
    <e22>   DW_AT_type        : <0x103a>
    <e26>   DW_AT_data_member_location: 40
 <2><e27>: Abbrev Number: 10 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0x3e13): ownedPort
    <e2c>   DW_AT_decl_file   : 11
    <e2d>   DW_AT_decl_line   : 824
    <e2f>   DW_AT_type        : <0x102e>
    <e33>   DW_AT_data_member_location: 48
 <2><e34>: Abbrev Number: 10 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0x5ffe): c_kind
    <e39>   DW_AT_decl_file   : 11
    <e3a>   DW_AT_decl_line   : 825
    <e3c>   DW_AT_type        : <0x41d>
    <e40>   DW_AT_data_member_location: 56
 <2><e41>: Abbrev Number: 10 (DW_TAG_member)
    <e42>   DW_AT_name        : (indirect string, offset: 0x2ae): superClass
    <e46>   DW_AT_decl_file   : 11
    <e47>   DW_AT_decl_line   : 825
    <e49>   DW_AT_type        : <0xfaa>
    <e4d>   DW_AT_data_member_location: 64
 <2><e4e>: Abbrev Number: 10 (DW_TAG_member)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x3ce7): isActive
    <e53>   DW_AT_decl_file   : 11
    <e54>   DW_AT_decl_line   : 825
    <e56>   DW_AT_type        : <0x1046>
    <e5a>   DW_AT_data_member_location: 72
 <2><e5b>: Abbrev Number: 10 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x56e7): ownedReception
    <e60>   DW_AT_decl_file   : 11
    <e61>   DW_AT_decl_line   : 825
    <e63>   DW_AT_type        : <0xfe6>
    <e67>   DW_AT_data_member_location: 80
 <2><e68>: Abbrev Number: 0
 <1><e69>: Abbrev Number: 2 (DW_TAG_typedef)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x3af4): UML_Region
    <e6e>   DW_AT_decl_file   : 11
    <e6f>   DW_AT_decl_line   : 191
    <e70>   DW_AT_type        : <0xe74>
 <1><e74>: Abbrev Number: 21 (DW_TAG_structure_type)
    <e75>   DW_AT_name        : (indirect string, offset: 0x3af4): UML_Region
    <e79>   DW_AT_byte_size   : 32
    <e7a>   DW_AT_decl_file   : 11
    <e7b>   DW_AT_decl_line   : 847
    <e7d>   DW_AT_sibling     : <0xec3>
 <2><e81>: Abbrev Number: 10 (DW_TAG_member)
    <e82>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <e86>   DW_AT_decl_file   : 11
    <e87>   DW_AT_decl_line   : 848
    <e89>   DW_AT_type        : <0x476>
    <e8d>   DW_AT_data_member_location: 0
 <2><e8e>: Abbrev Number: 10 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <e93>   DW_AT_decl_file   : 11
    <e94>   DW_AT_decl_line   : 849
    <e96>   DW_AT_type        : <0x5e5>
    <e9a>   DW_AT_data_member_location: 4
 <2><e9b>: Abbrev Number: 10 (DW_TAG_member)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <ea0>   DW_AT_decl_file   : 11
    <ea1>   DW_AT_decl_line   : 849
    <ea3>   DW_AT_type        : <0xad>
    <ea7>   DW_AT_data_member_location: 8
 <2><ea8>: Abbrev Number: 10 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x1b2e): subvertex
    <ead>   DW_AT_decl_file   : 11
    <eae>   DW_AT_decl_line   : 850
    <eb0>   DW_AT_type        : <0x104d>
    <eb4>   DW_AT_data_member_location: 16
 <2><eb5>: Abbrev Number: 10 (DW_TAG_member)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x702a): transition
    <eba>   DW_AT_decl_file   : 11
    <ebb>   DW_AT_decl_line   : 850
    <ebd>   DW_AT_type        : <0xff2>
    <ec1>   DW_AT_data_member_location: 24
 <2><ec2>: Abbrev Number: 0
 <1><ec3>: Abbrev Number: 2 (DW_TAG_typedef)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x3fff): UML_Port
    <ec8>   DW_AT_decl_file   : 11
    <ec9>   DW_AT_decl_line   : 193
    <eca>   DW_AT_type        : <0xece>
 <1><ece>: Abbrev Number: 21 (DW_TAG_structure_type)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x3fff): UML_Port
    <ed3>   DW_AT_byte_size   : 88
    <ed4>   DW_AT_decl_file   : 11
    <ed5>   DW_AT_decl_line   : 873
    <ed7>   DW_AT_sibling     : <0xf92>
 <2><edb>: Abbrev Number: 10 (DW_TAG_member)
    <edc>   DW_AT_name        : (indirect string, offset: 0x4dd3): c_type
    <ee0>   DW_AT_decl_file   : 11
    <ee1>   DW_AT_decl_line   : 874
    <ee3>   DW_AT_type        : <0x476>
    <ee7>   DW_AT_data_member_location: 0
 <2><ee8>: Abbrev Number: 10 (DW_TAG_member)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x1c8a): visibility
    <eed>   DW_AT_decl_file   : 11
    <eee>   DW_AT_decl_line   : 875
    <ef0>   DW_AT_type        : <0x5e5>
    <ef4>   DW_AT_data_member_location: 4
 <2><ef5>: Abbrev Number: 10 (DW_TAG_member)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x5ff9): name
    <efa>   DW_AT_decl_file   : 11
    <efb>   DW_AT_decl_line   : 875
    <efd>   DW_AT_type        : <0xad>
    <f01>   DW_AT_data_member_location: 8
 <2><f02>: Abbrev Number: 10 (DW_TAG_member)
    <f03>   DW_AT_name        : (indirect string, offset: 0x6f19): association
    <f07>   DW_AT_decl_file   : 11
    <f08>   DW_AT_decl_line   : 876
    <f0a>   DW_AT_type        : <0xfbc>
    <f0e>   DW_AT_data_member_location: 16
 <2><f0f>: Abbrev Number: 10 (DW_TAG_member)
    <f10>   DW_AT_name        : (indirect string, offset: 0x3e82): aggregation
    <f14>   DW_AT_decl_file   : 11
    <f15>   DW_AT_decl_line   : 876
    <f17>   DW_AT_type        : <0x671>
    <f1b>   DW_AT_data_member_location: 24
 <2><f1c>: Abbrev Number: 10 (DW_TAG_member)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x1430): class
    <f21>   DW_AT_decl_file   : 11
    <f22>   DW_AT_decl_line   : 876
    <f24>   DW_AT_type        : <0xfb0>
    <f28>   DW_AT_data_member_location: 32
 <2><f29>: Abbrev Number: 10 (DW_TAG_member)
    <f2a>   DW_AT_name        : (indirect string, offset: 0xb32): type
    <f2e>   DW_AT_decl_file   : 11
    <f2f>   DW_AT_decl_line   : 877
    <f31>   DW_AT_type        : <0xfb0>
    <f35>   DW_AT_data_member_location: 40
 <2><f36>: Abbrev Number: 22 (DW_TAG_member)
    <f37>   DW_AT_name        : end
    <f3b>   DW_AT_decl_file   : 11
    <f3c>   DW_AT_decl_line   : 878
    <f3e>   DW_AT_type        : <0xfce>
    <f42>   DW_AT_data_member_location: 48
 <2><f43>: Abbrev Number: 10 (DW_TAG_member)
    <f44>   DW_AT_name        : (indirect string, offset: 0x1fa5): lower
    <f48>   DW_AT_decl_file   : 11
    <f49>   DW_AT_decl_line   : 879
    <f4b>   DW_AT_type        : <0x3f>
    <f4f>   DW_AT_data_member_location: 56
 <2><f50>: Abbrev Number: 10 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0x5159): c_index
    <f55>   DW_AT_decl_file   : 11
    <f56>   DW_AT_decl_line   : 880
    <f58>   DW_AT_type        : <0x35e>
    <f5c>   DW_AT_data_member_location: 60
 <2><f5d>: Abbrev Number: 10 (DW_TAG_member)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x1529): isConjugated
    <f62>   DW_AT_decl_file   : 11
    <f63>   DW_AT_decl_line   : 880
    <f65>   DW_AT_type        : <0x1046>
    <f69>   DW_AT_data_member_location: 61
 <2><f6a>: Abbrev Number: 10 (DW_TAG_member)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x27f): provided
    <f6f>   DW_AT_decl_file   : 11
    <f70>   DW_AT_decl_line   : 880
    <f72>   DW_AT_type        : <0x1053>
    <f76>   DW_AT_data_member_location: 64
 <2><f77>: Abbrev Number: 10 (DW_TAG_member)
    <f78>   DW_AT_name        : (indirect string, offset: 0x1f21): isBehavior
    <f7c>   DW_AT_decl_file   : 11
    <f7d>   DW_AT_decl_line   : 880
    <f7f>   DW_AT_type        : <0x1046>
    <f83>   DW_AT_data_member_location: 72
 <2><f84>: Abbrev Number: 10 (DW_TAG_member)
    <f85>   DW_AT_name        : (indirect string, offset: 0x664c): required
    <f89>   DW_AT_decl_file   : 11
    <f8a>   DW_AT_decl_line   : 880
    <f8c>   DW_AT_type        : <0x1053>
    <f90>   DW_AT_data_member_location: 80
 <2><f91>: Abbrev Number: 0
 <1><f92>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f93>   DW_AT_byte_size   : 8
    <f94>   DW_AT_type        : <0xf98>
 <1><f98>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f99>   DW_AT_byte_size   : 8
    <f9a>   DW_AT_type        : <0xd67>
 <1><f9e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f9f>   DW_AT_byte_size   : 8
    <fa0>   DW_AT_type        : <0xfa4>
 <1><fa4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fa5>   DW_AT_byte_size   : 8
    <fa6>   DW_AT_type        : <0x739>
 <1><faa>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fab>   DW_AT_byte_size   : 8
    <fac>   DW_AT_type        : <0xfb0>
 <1><fb0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fb1>   DW_AT_byte_size   : 8
    <fb2>   DW_AT_type        : <0xdb4>
 <1><fb6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fb7>   DW_AT_byte_size   : 8
    <fb8>   DW_AT_type        : <0xfbc>
 <1><fbc>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fbd>   DW_AT_byte_size   : 8
    <fbe>   DW_AT_type        : <0x9af>
 <1><fc2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc3>   DW_AT_byte_size   : 8
    <fc4>   DW_AT_type        : <0xa16>
 <1><fc8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc9>   DW_AT_byte_size   : 8
    <fca>   DW_AT_type        : <0xa3c>
 <1><fce>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fcf>   DW_AT_byte_size   : 8
    <fd0>   DW_AT_type        : <0x6ec>
 <1><fd4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fd5>   DW_AT_byte_size   : 8
    <fd6>   DW_AT_type        : <0x820>
 <1><fda>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fdb>   DW_AT_byte_size   : 8
    <fdc>   DW_AT_type        : <0xad>
 <1><fe0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fe1>   DW_AT_byte_size   : 8
    <fe2>   DW_AT_type        : <0xfc8>
 <1><fe6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fe7>   DW_AT_byte_size   : 8
    <fe8>   DW_AT_type        : <0xfec>
 <1><fec>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fed>   DW_AT_byte_size   : 8
    <fee>   DW_AT_type        : <0x887>
 <1><ff2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ff3>   DW_AT_byte_size   : 8
    <ff4>   DW_AT_type        : <0xff8>
 <1><ff8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ff9>   DW_AT_byte_size   : 8
    <ffa>   DW_AT_type        : <0xabd>
 <1><ffe>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fff>   DW_AT_byte_size   : 8
    <1000>   DW_AT_type        : <0x69f>
 <1><1004>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1005>   DW_AT_byte_size   : 8
    <1006>   DW_AT_type        : <0xbd8>
 <1><100a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <100b>   DW_AT_byte_size   : 8
    <100c>   DW_AT_type        : <0xd0d>
 <1><1010>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1011>   DW_AT_byte_size   : 8
    <1012>   DW_AT_type        : <0x948>
 <1><1016>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1017>   DW_AT_byte_size   : 8
    <1018>   DW_AT_type        : <0x101c>
 <1><101c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <101d>   DW_AT_byte_size   : 8
    <101e>   DW_AT_type        : <0x793>
 <1><1022>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1023>   DW_AT_byte_size   : 8
    <1024>   DW_AT_type        : <0x1028>
 <1><1028>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1029>   DW_AT_byte_size   : 8
    <102a>   DW_AT_type        : <0xe69>
 <1><102e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <102f>   DW_AT_byte_size   : 8
    <1030>   DW_AT_type        : <0x1034>
 <1><1034>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1035>   DW_AT_byte_size   : 8
    <1036>   DW_AT_type        : <0xec3>
 <1><103a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <103b>   DW_AT_byte_size   : 8
    <103c>   DW_AT_type        : <0x1040>
 <1><1040>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1041>   DW_AT_byte_size   : 8
    <1042>   DW_AT_type        : <0x7ed>
 <1><1046>: Abbrev Number: 3 (DW_TAG_base_type)
    <1047>   DW_AT_byte_size   : 1
    <1048>   DW_AT_encoding    : 2	(boolean)
    <1049>   DW_AT_name        : (indirect string, offset: 0x1f2c): _Bool
 <1><104d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <104e>   DW_AT_byte_size   : 8
    <104f>   DW_AT_type        : <0x1010>
 <1><1053>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1054>   DW_AT_byte_size   : 8
    <1055>   DW_AT_type        : <0xfd4>
 <1><1059>: Abbrev Number: 2 (DW_TAG_typedef)
    <105a>   DW_AT_name        : (indirect string, offset: 0x5acb): Fifo
    <105e>   DW_AT_decl_file   : 12
    <105f>   DW_AT_decl_line   : 16
    <1060>   DW_AT_type        : <0x1064>
 <1><1064>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1065>   DW_AT_name        : (indirect string, offset: 0x5acb): Fifo
    <1069>   DW_AT_byte_size   : 48
    <106a>   DW_AT_decl_file   : 12
    <106b>   DW_AT_decl_line   : 19
    <106c>   DW_AT_sibling     : <0x10c4>
 <2><1070>: Abbrev Number: 9 (DW_TAG_member)
    <1071>   DW_AT_name        : (indirect string, offset: 0x74dd): data
    <1075>   DW_AT_decl_file   : 12
    <1076>   DW_AT_decl_line   : 20
    <1077>   DW_AT_type        : <0x10c4>
    <107b>   DW_AT_data_member_location: 0
 <2><107c>: Abbrev Number: 9 (DW_TAG_member)
    <107d>   DW_AT_name        : (indirect string, offset: 0x29de): nb_layers
    <1081>   DW_AT_decl_file   : 12
    <1082>   DW_AT_decl_line   : 21
    <1083>   DW_AT_type        : <0x332>
    <1087>   DW_AT_data_member_location: 8
 <2><1088>: Abbrev Number: 9 (DW_TAG_member)
    <1089>   DW_AT_name        : (indirect string, offset: 0x718): element_size
    <108d>   DW_AT_decl_file   : 12
    <108e>   DW_AT_decl_line   : 22
    <108f>   DW_AT_type        : <0x10ca>
    <1093>   DW_AT_data_member_location: 16
 <2><1094>: Abbrev Number: 23 (DW_TAG_member)
    <1095>   DW_AT_name        : nb
    <1098>   DW_AT_decl_file   : 12
    <1099>   DW_AT_decl_line   : 23
    <109a>   DW_AT_type        : <0x10d0>
    <109e>   DW_AT_data_member_location: 24
 <2><109f>: Abbrev Number: 9 (DW_TAG_member)
    <10a0>   DW_AT_name        : (indirect string, offset: 0x52b6): size
    <10a4>   DW_AT_decl_file   : 12
    <10a5>   DW_AT_decl_line   : 24
    <10a6>   DW_AT_type        : <0x3cc>
    <10aa>   DW_AT_data_member_location: 32
 <2><10ab>: Abbrev Number: 9 (DW_TAG_member)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x5c1c): writing
    <10b0>   DW_AT_decl_file   : 12
    <10b1>   DW_AT_decl_line   : 25
    <10b2>   DW_AT_type        : <0x3cc>
    <10b6>   DW_AT_data_member_location: 33
 <2><10b7>: Abbrev Number: 9 (DW_TAG_member)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x4956): reorganize_buffer
    <10bc>   DW_AT_decl_file   : 12
    <10bd>   DW_AT_decl_line   : 26
    <10be>   DW_AT_type        : <0xab>
    <10c2>   DW_AT_data_member_location: 40
 <2><10c3>: Abbrev Number: 0
 <1><10c4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10c5>   DW_AT_byte_size   : 8
    <10c6>   DW_AT_type        : <0xab>
 <1><10ca>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10cb>   DW_AT_byte_size   : 8
    <10cc>   DW_AT_type        : <0x348>
 <1><10d0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10d1>   DW_AT_byte_size   : 8
    <10d2>   DW_AT_type        : <0x3cc>
 <1><10d6>: Abbrev Number: 2 (DW_TAG_typedef)
    <10d7>   DW_AT_name        : (indirect string, offset: 0x5ad0): EventPool
    <10db>   DW_AT_decl_file   : 13
    <10dc>   DW_AT_decl_line   : 21
    <10dd>   DW_AT_type        : <0x10e1>
 <1><10e1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <10e2>   DW_AT_name        : (indirect string, offset: 0x5ad0): EventPool
    <10e6>   DW_AT_byte_size   : 72
    <10e7>   DW_AT_decl_file   : 13
    <10e8>   DW_AT_decl_line   : 100
    <10e9>   DW_AT_sibling     : <0x1106>
 <2><10ed>: Abbrev Number: 9 (DW_TAG_member)
    <10ee>   DW_AT_name        : (indirect string, offset: 0x3dd7): fifo
    <10f2>   DW_AT_decl_file   : 13
    <10f3>   DW_AT_decl_line   : 101
    <10f4>   DW_AT_type        : <0x1059>
    <10f8>   DW_AT_data_member_location: 0
 <2><10f9>: Abbrev Number: 9 (DW_TAG_member)
    <10fa>   DW_AT_name        : (indirect string, offset: 0x2972): meta
    <10fe>   DW_AT_decl_file   : 13
    <10ff>   DW_AT_decl_line   : 102
    <1100>   DW_AT_type        : <0x1136>
    <1104>   DW_AT_data_member_location: 48
 <2><1105>: Abbrev Number: 0
 <1><1106>: Abbrev Number: 2 (DW_TAG_typedef)
    <1107>   DW_AT_name        : (indirect string, offset: 0x329e): EventPoolStore
    <110b>   DW_AT_decl_file   : 13
    <110c>   DW_AT_decl_line   : 22
    <110d>   DW_AT_type        : <0x1111>
 <1><1111>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1112>   DW_AT_name        : (indirect string, offset: 0x329e): EventPoolStore
    <1116>   DW_AT_byte_size   : 9
    <1117>   DW_AT_decl_file   : 13
    <1118>   DW_AT_decl_line   : 73
    <1119>   DW_AT_sibling     : <0x1136>
 <2><111d>: Abbrev Number: 9 (DW_TAG_member)
    <111e>   DW_AT_name        : (indirect string, offset: 0x588d): nbEvents
    <1122>   DW_AT_decl_file   : 13
    <1123>   DW_AT_decl_line   : 74
    <1124>   DW_AT_type        : <0x3e2>
    <1128>   DW_AT_data_member_location: 0
 <2><1129>: Abbrev Number: 9 (DW_TAG_member)
    <112a>   DW_AT_name        : (indirect string, offset: 0x1606): eventOccurred
    <112e>   DW_AT_decl_file   : 13
    <112f>   DW_AT_decl_line   : 75
    <1130>   DW_AT_type        : <0x11de>
    <1134>   DW_AT_data_member_location: 1
 <2><1135>: Abbrev Number: 0
 <1><1136>: Abbrev Number: 2 (DW_TAG_typedef)
    <1137>   DW_AT_name        : (indirect string, offset: 0x753): EventPoolMeta
    <113b>   DW_AT_decl_file   : 13
    <113c>   DW_AT_decl_line   : 23
    <113d>   DW_AT_type        : <0x1141>
 <1><1141>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1142>   DW_AT_name        : (indirect string, offset: 0x753): EventPoolMeta
    <1146>   DW_AT_byte_size   : 24
    <1147>   DW_AT_decl_file   : 13
    <1148>   DW_AT_decl_line   : 83
    <1149>   DW_AT_sibling     : <0x117e>
 <2><114d>: Abbrev Number: 9 (DW_TAG_member)
    <114e>   DW_AT_name        : (indirect string, offset: 0x74b8): eventSetSize
    <1152>   DW_AT_decl_file   : 13
    <1153>   DW_AT_decl_line   : 84
    <1154>   DW_AT_type        : <0x3ed>
    <1158>   DW_AT_data_member_location: 0
 <2><1159>: Abbrev Number: 9 (DW_TAG_member)
    <115a>   DW_AT_name        : (indirect string, offset: 0x1325): eventSet
    <115e>   DW_AT_decl_file   : 13
    <115f>   DW_AT_decl_line   : 85
    <1160>   DW_AT_type        : <0xf92>
    <1164>   DW_AT_data_member_location: 8
 <2><1165>: Abbrev Number: 9 (DW_TAG_member)
    <1166>   DW_AT_name        : (indirect string, offset: 0x201d): paramsSize
    <116a>   DW_AT_decl_file   : 13
    <116b>   DW_AT_decl_line   : 86
    <116c>   DW_AT_type        : <0x348>
    <1170>   DW_AT_data_member_location: 16
 <2><1171>: Abbrev Number: 9 (DW_TAG_member)
    <1172>   DW_AT_name        : (indirect string, offset: 0x1341): nbDeferred
    <1176>   DW_AT_decl_file   : 13
    <1177>   DW_AT_decl_line   : 87
    <1178>   DW_AT_type        : <0x3e2>
    <117c>   DW_AT_data_member_location: 20
 <2><117d>: Abbrev Number: 0
 <1><117e>: Abbrev Number: 2 (DW_TAG_typedef)
    <117f>   DW_AT_name        : (indirect string, offset: 0x69f4): EventId
    <1183>   DW_AT_decl_file   : 13
    <1184>   DW_AT_decl_line   : 24
    <1185>   DW_AT_type        : <0x1189>
 <1><1189>: Abbrev Number: 8 (DW_TAG_structure_type)
