
/home/vbesnard/Doctorat/Recherche/code/gits/uml-interpreter-c/samples/LevelCrossing/LevelCrossingDeployment/LevelCrossingConcreteEnv.emi/build/stm32f4discovery/.build//model.o:     file format elf32-littlearm

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x9b11 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x3cbb): GNU C99 5.4.1 20160919 -mcpu=cortex-m4 -mthumb -mfloat-abi=soft -g -O0 -std=c99
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x56e3): model.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x10329): /home/vbesnard/Doctorat/Recherche/code/gits/uml-interpreter-c/samples/LevelCrossing/LevelCrossingDeployment/LevelCrossingConcreteEnv.emi/src
    <19>   DW_AT_low_pc      : 0x0
    <1d>   DW_AT_high_pc     : 0x7ea
    <21>   DW_AT_stmt_list   : 0x0
 <1><25>: Abbrev Number: 2 (DW_TAG_base_type)
    <26>   DW_AT_byte_size   : 4
    <27>   DW_AT_encoding    : 7	(unsigned)
    <28>   DW_AT_name        : (indirect string, offset: 0x115ae): unsigned int
 <1><2c>: Abbrev Number: 3 (DW_TAG_base_type)
    <2d>   DW_AT_byte_size   : 4
    <2e>   DW_AT_encoding    : 5	(signed)
    <2f>   DW_AT_name        : int
 <1><33>: Abbrev Number: 4 (DW_TAG_typedef)
    <34>   DW_AT_name        : (indirect string, offset: 0x11185): __int8_t

    <25d>   DW_AT_name        : (indirect string, offset: 0xb376): DESC_TYPE_UML_Connector
    <261>   DW_AT_const_value : 6
 <2><262>: Abbrev Number: 8 (DW_TAG_enumerator)
    <263>   DW_AT_name        : (indirect string, offset: 0xa64f): DESC_TYPE_UML_InterfaceRealization
    <267>   DW_AT_const_value : 7
 <2><268>: Abbrev Number: 8 (DW_TAG_enumerator)
    <269>   DW_AT_name        : (indirect string, offset: 0xb2ef): DESC_TYPE_UML_OpaqueExpression
    <26d>   DW_AT_const_value : 8
 <2><26e>: Abbrev Number: 8 (DW_TAG_enumerator)
    <26f>   DW_AT_name        : (indirect string, offset: 0xb57b): DESC_TYPE_UML_Interface
    <273>   DW_AT_const_value : 9
 <2><274>: Abbrev Number: 8 (DW_TAG_enumerator)
    <275>   DW_AT_name        : (indirect string, offset: 0x179a): DESC_TYPE_UML_Reception
    <279>   DW_AT_const_value : 10
 <2><27a>: Abbrev Number: 8 (DW_TAG_enumerator)
    <27b>   DW_AT_name        : (indirect string, offset: 0xef91): DESC_TYPE_UML_Pseudostate
    <27f>   DW_AT_const_value : 11
 <2><280>: Abbrev Number: 8 (DW_TAG_enumerator)
    <281>   DW_AT_name        : (indirect string, offset: 0x58fc): DESC_TYPE_UML_Vertex
    <285>   DW_AT_const_value : 12
 <2><286>: Abbrev Number: 8 (DW_TAG_enumerator)
    <287>   DW_AT_name        : (indirect string, offset: 0x9a9a): DESC_TYPE_UML_Association
    <28b>   DW_AT_const_value : 13
 <2><28c>: Abbrev Number: 8 (DW_TAG_enumerator)
    <28d>   DW_AT_name        : (indirect string, offset: 0x36e0): DESC_TYPE_UML_ValueSpecification
    <291>   DW_AT_const_value : 14
 <2><292>: Abbrev Number: 8 (DW_TAG_enumerator)
    <293>   DW_AT_name        : (indirect string, offset: 0x4072): DESC_TYPE_UML_Transition
    <297>   DW_AT_const_value : 15
 <2><298>: Abbrev Number: 8 (DW_TAG_enumerator)
    <299>   DW_AT_name        : (indirect string, offset: 0xcd0a): DESC_TYPE_UML_StructuredClassifier
    <29d>   DW_AT_const_value : 16
 <2><29e>: Abbrev Number: 8 (DW_TAG_enumerator)
    <29f>   DW_AT_name        : (indirect string, offset: 0x8b69): DESC_TYPE_UML_TypedElement
    <2a3>   DW_AT_const_value : 17
 <2><2a4>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xdcad): DESC_TYPE_UML_PrimitiveType
    <2a9>   DW_AT_const_value : 18
 <2><2aa>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2ab>   DW_AT_name        : (indirect string, offset: 0xd9dc): DESC_TYPE_UML_StateMachine
    <2af>   DW_AT_const_value : 19
 <2><2b0>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2b1>   DW_AT_name        : (indirect string, offset: 0xb410): DESC_TYPE_UML_BehavioralFeature
    <2b5>   DW_AT_const_value : 20
 <2><2b6>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2b7>   DW_AT_name        : (indirect string, offset: 0xad71): DESC_TYPE_UML_MultiplicityElement
    <2bb>   DW_AT_const_value : 21
 <2><2bc>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x6994): DESC_TYPE_UML_Behavior
    <2c1>   DW_AT_const_value : 22
 <2><2c2>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x3b0e): DESC_TYPE_UML_OpaqueBehavior
    <2c7>   DW_AT_const_value : 23
 <2><2c8>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2c9>   DW_AT_name        : (indirect string, offset: 0x62f0): DESC_TYPE_UML_State
    <2cd>   DW_AT_const_value : 24
 <2><2ce>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2cf>   DW_AT_name        : (indirect string, offset: 0xf4f9): DESC_TYPE_UML_Trigger
    <2d3>   DW_AT_const_value : 25
 <2><2d4>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x1812): DESC_TYPE_UML_NamedElement
    <2d9>   DW_AT_const_value : 26
 <2><2da>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2db>   DW_AT_name        : (indirect string, offset: 0xb3be): DESC_TYPE_UML_Signal
    <2df>   DW_AT_const_value : 27
 <2><2e0>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x108d5): DESC_TYPE_UML_EncapsulatedClassifier
    <2e5>   DW_AT_const_value : 28
 <2><2e6>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2e7>   DW_AT_name        : (indirect string, offset: 0xca25): DESC_TYPE_UML_Region
    <2eb>   DW_AT_const_value : 29
 <2><2ec>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2ed>   DW_AT_name        : (indirect string, offset: 0xf2bc): DESC_TYPE_UML_Enumeration
    <2f1>   DW_AT_const_value : 30
 <2><2f2>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x5fd8): DESC_TYPE_UML_EnumerationLiteral
    <2f7>   DW_AT_const_value : 31
 <2><2f8>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2f9>   DW_AT_name        : (indirect string, offset: 0xcaa): DESC_TYPE_UML_Operation
    <2fd>   DW_AT_const_value : 32
 <2><2fe>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x7020): DESC_TYPE_UML_BehavioredClassifier
    <303>   DW_AT_const_value : 33
 <2><304>: Abbrev Number: 8 (DW_TAG_enumerator)
    <305>   DW_AT_name        : (indirect string, offset: 0xaaed): DESC_TYPE_UML_ConnectableElement
    <309>   DW_AT_const_value : 34
 <2><30a>: Abbrev Number: 8 (DW_TAG_enumerator)
    <30b>   DW_AT_name        : (indirect string, offset: 0x5924): NB_DESC_TYPE
    <30f>   DW_AT_const_value : 35
 <2><310>: Abbrev Number: 0
 <1><311>: Abbrev Number: 4 (DW_TAG_typedef)
    <312>   DW_AT_name        : (indirect string, offset: 0xf796): C_UML_Model
    <316>   DW_AT_decl_file   : 6
    <317>   DW_AT_decl_line   : 159
    <318>   DW_AT_type        : <0x31c>
 <1><31c>: Abbrev Number: 10 (DW_TAG_structure_type)
    <31d>   DW_AT_name        : (indirect string, offset: 0xf796): C_UML_Model
    <321>   DW_AT_byte_size   : 20
    <322>   DW_AT_decl_file   : 6
    <323>   DW_AT_decl_line   : 442
    <325>   DW_AT_sibling     : <0x36b>
 <2><329>: Abbrev Number: 11 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <32e>   DW_AT_decl_file   : 6
    <32f>   DW_AT_decl_line   : 443
    <331>   DW_AT_type        : <0xb6>
    <335>   DW_AT_data_member_location: 0
 <2><336>: Abbrev Number: 11 (DW_TAG_member)
    <337>   DW_AT_name        : (indirect string, offset: 0x1188f): uml_signal
    <33b>   DW_AT_decl_file   : 6
    <33c>   DW_AT_decl_line   : 444
    <33e>   DW_AT_type        : <0xe19>
    <342>   DW_AT_data_member_location: 4
 <2><343>: Abbrev Number: 11 (DW_TAG_member)
    <344>   DW_AT_name        : (indirect string, offset: 0x87a5): uml_signal_event
    <348>   DW_AT_decl_file   : 6
    <349>   DW_AT_decl_line   : 445
    <34b>   DW_AT_type        : <0xe25>
    <34f>   DW_AT_data_member_location: 8
 <2><350>: Abbrev Number: 11 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0xd1df): uml_class
    <355>   DW_AT_decl_file   : 6
    <356>   DW_AT_decl_line   : 446
    <358>   DW_AT_type        : <0xe31>
    <35c>   DW_AT_data_member_location: 12
 <2><35d>: Abbrev Number: 11 (DW_TAG_member)
    <35e>   DW_AT_name        : (indirect string, offset: 0x1b29): uml_association
    <362>   DW_AT_decl_file   : 6
    <363>   DW_AT_decl_line   : 447
    <365>   DW_AT_type        : <0xe3d>
    <369>   DW_AT_data_member_location: 16
 <2><36a>: Abbrev Number: 0
 <1><36b>: Abbrev Number: 4 (DW_TAG_typedef)
    <36c>   DW_AT_name        : (indirect string, offset: 0xa2a0): UML_VisibilityKind
    <370>   DW_AT_decl_file   : 6
    <371>   DW_AT_decl_line   : 160
    <372>   DW_AT_type        : <0x376>
 <1><376>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <377>   DW_AT_name        : (indirect string, offset: 0xa2a0): UML_VisibilityKind
    <37b>   DW_AT_byte_size   : 4
    <37c>   DW_AT_type        : <0x25>
    <380>   DW_AT_decl_file   : 6
    <381>   DW_AT_decl_line   : 160
    <382>   DW_AT_sibling     : <0x39f>
 <2><386>: Abbrev Number: 8 (DW_TAG_enumerator)
    <387>   DW_AT_name        : (indirect string, offset: 0xf6c0): UML_PUBLIC
    <38b>   DW_AT_const_value : 0
 <2><38c>: Abbrev Number: 8 (DW_TAG_enumerator)
    <38d>   DW_AT_name        : (indirect string, offset: 0xb16b): UML_PRIVATE
    <391>   DW_AT_const_value : 1
 <2><392>: Abbrev Number: 8 (DW_TAG_enumerator)
    <393>   DW_AT_name        : (indirect string, offset: 0x1ecc): UML_PROTECTED
    <397>   DW_AT_const_value : 2
 <2><398>: Abbrev Number: 8 (DW_TAG_enumerator)
    <399>   DW_AT_name        : (indirect string, offset: 0xf5de): UML_PACKAGE
    <39d>   DW_AT_const_value : 3
 <2><39e>: Abbrev Number: 0
 <1><39f>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a0>   DW_AT_name        : (indirect string, offset: 0x226d): UML_PseudostateKind
    <3a4>   DW_AT_decl_file   : 6
    <3a5>   DW_AT_decl_line   : 161
    <3a6>   DW_AT_type        : <0x3aa>
 <1><3aa>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <3ab>   DW_AT_name        : (indirect string, offset: 0x226d): UML_PseudostateKind
    <3af>   DW_AT_byte_size   : 4
    <3b0>   DW_AT_type        : <0x25>
    <3b4>   DW_AT_decl_file   : 6
    <3b5>   DW_AT_decl_line   : 161
    <3b6>   DW_AT_sibling     : <0x3f7>
 <2><3ba>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3bb>   DW_AT_name        : (indirect string, offset: 0xee14): UML_INITIAL
    <3bf>   DW_AT_const_value : 0
 <2><3c0>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x9c84): UML_DEEPHISTORY
    <3c5>   DW_AT_const_value : 1
 <2><3c6>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3c7>   DW_AT_name        : (indirect string, offset: 0x5a23): UML_SHALLOWHISTORY
    <3cb>   DW_AT_const_value : 2
 <2><3cc>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x1160e): UML_JOIN
    <3d1>   DW_AT_const_value : 3
 <2><3d2>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3d3>   DW_AT_name        : (indirect string, offset: 0x3a82): UML_FORK
    <3d7>   DW_AT_const_value : 4
 <2><3d8>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3d9>   DW_AT_name        : (indirect string, offset: 0xdeb3): UML_JUNCTION
    <3dd>   DW_AT_const_value : 5
 <2><3de>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3df>   DW_AT_name        : (indirect string, offset: 0x2455): UML_CHOICE
    <3e3>   DW_AT_const_value : 6
 <2><3e4>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x2f): UML_ENTRYPOINT
    <3e9>   DW_AT_const_value : 7
 <2><3ea>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x4b5f): UML_EXITPOINT
    <3ef>   DW_AT_const_value : 8
 <2><3f0>: Abbrev Number: 8 (DW_TAG_enumerator)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xdd33): UML_TERMINATE
    <3f5>   DW_AT_const_value : 9
 <2><3f6>: Abbrev Number: 0
 <1><3f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x10b5c): UML_AggregationKind
    <3fc>   DW_AT_decl_file   : 6
    <3fd>   DW_AT_decl_line   : 162
    <3fe>   DW_AT_type        : <0x402>
 <1><402>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <403>   DW_AT_name        : (indirect string, offset: 0x10b5c): UML_AggregationKind
    <407>   DW_AT_byte_size   : 4
    <408>   DW_AT_type        : <0x25>
    <40c>   DW_AT_decl_file   : 6
    <40d>   DW_AT_decl_line   : 162
    <40e>   DW_AT_sibling     : <0x425>
 <2><412>: Abbrev Number: 8 (DW_TAG_enumerator)
    <413>   DW_AT_name        : (indirect string, offset: 0x11886): UML_NONE
    <417>   DW_AT_const_value : 0
 <2><418>: Abbrev Number: 8 (DW_TAG_enumerator)
    <419>   DW_AT_name        : (indirect string, offset: 0x4413): UML_SHARED
    <41d>   DW_AT_const_value : 1
 <2><41e>: Abbrev Number: 8 (DW_TAG_enumerator)
    <41f>   DW_AT_name        : (indirect string, offset: 0xdee6): UML_COMPOSITE
    <423>   DW_AT_const_value : 2
 <2><424>: Abbrev Number: 0
 <1><425>: Abbrev Number: 4 (DW_TAG_typedef)
    <426>   DW_AT_name        : (indirect string, offset: 0xa05): UML_Constraint
    <42a>   DW_AT_decl_file   : 6
    <42b>   DW_AT_decl_line   : 163
    <42c>   DW_AT_type        : <0x430>
 <1><430>: Abbrev Number: 10 (DW_TAG_structure_type)
    <431>   DW_AT_name        : (indirect string, offset: 0xa05): UML_Constraint
    <435>   DW_AT_byte_size   : 16
    <436>   DW_AT_decl_file   : 6
    <437>   DW_AT_decl_line   : 485
    <439>   DW_AT_sibling     : <0x472>
 <2><43d>: Abbrev Number: 11 (DW_TAG_member)
    <43e>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <442>   DW_AT_decl_file   : 6
    <443>   DW_AT_decl_line   : 486
    <445>   DW_AT_type        : <0x21d>
    <449>   DW_AT_data_member_location: 0
 <2><44a>: Abbrev Number: 11 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <44f>   DW_AT_decl_file   : 6
    <450>   DW_AT_decl_line   : 487
    <452>   DW_AT_type        : <0x36b>
    <456>   DW_AT_data_member_location: 4
 <2><457>: Abbrev Number: 11 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <45c>   DW_AT_decl_file   : 6
    <45d>   DW_AT_decl_line   : 487
    <45f>   DW_AT_type        : <0xb6>
    <463>   DW_AT_data_member_location: 8
 <2><464>: Abbrev Number: 11 (DW_TAG_member)
    <465>   DW_AT_name        : (indirect string, offset: 0x6075): specification
    <469>   DW_AT_decl_file   : 6
    <46a>   DW_AT_decl_line   : 488
    <46c>   DW_AT_type        : <0xe49>
    <470>   DW_AT_data_member_location: 12
 <2><471>: Abbrev Number: 0
 <1><472>: Abbrev Number: 4 (DW_TAG_typedef)
    <473>   DW_AT_name        : (indirect string, offset: 0x9c49): UML_ConnectorEnd
    <477>   DW_AT_decl_file   : 6
    <478>   DW_AT_decl_line   : 164
    <479>   DW_AT_type        : <0x47d>
 <1><47d>: Abbrev Number: 10 (DW_TAG_structure_type)
    <47e>   DW_AT_name        : (indirect string, offset: 0x9c49): UML_ConnectorEnd
    <482>   DW_AT_byte_size   : 16
    <483>   DW_AT_decl_file   : 6
    <484>   DW_AT_decl_line   : 498
    <486>   DW_AT_sibling     : <0x4bf>
 <2><48a>: Abbrev Number: 11 (DW_TAG_member)
    <48b>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <48f>   DW_AT_decl_file   : 6
    <490>   DW_AT_decl_line   : 499
    <492>   DW_AT_type        : <0x21d>
    <496>   DW_AT_data_member_location: 0
 <2><497>: Abbrev Number: 11 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x75ef): lower
    <49c>   DW_AT_decl_file   : 6
    <49d>   DW_AT_decl_line   : 500
    <49f>   DW_AT_type        : <0x2c>
    <4a3>   DW_AT_data_member_location: 4
 <2><4a4>: Abbrev Number: 11 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x406d): role
    <4a9>   DW_AT_decl_file   : 6
    <4aa>   DW_AT_decl_line   : 501
    <4ac>   DW_AT_type        : <0xe4f>
    <4b0>   DW_AT_data_member_location: 8
 <2><4b1>: Abbrev Number: 11 (DW_TAG_member)
    <4b2>   DW_AT_name        : (indirect string, offset: 0xa869): partWithPort
    <4b6>   DW_AT_decl_file   : 6
    <4b7>   DW_AT_decl_line   : 501
    <4b9>   DW_AT_type        : <0xe4f>
    <4bd>   DW_AT_data_member_location: 12
 <2><4be>: Abbrev Number: 0
 <1><4bf>: Abbrev Number: 4 (DW_TAG_typedef)
    <4c0>   DW_AT_name        : (indirect string, offset: 0xcc1c): UML_SignalEvent
    <4c4>   DW_AT_decl_file   : 6
    <4c5>   DW_AT_decl_line   : 165
    <4c6>   DW_AT_type        : <0x4ca>
 <1><4ca>: Abbrev Number: 10 (DW_TAG_structure_type)
    <4cb>   DW_AT_name        : (indirect string, offset: 0xcc1c): UML_SignalEvent
    <4cf>   DW_AT_byte_size   : 20
    <4d0>   DW_AT_decl_file   : 6
    <4d1>   DW_AT_decl_line   : 511
    <4d3>   DW_AT_sibling     : <0x519>
 <2><4d7>: Abbrev Number: 11 (DW_TAG_member)
    <4d8>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <4dc>   DW_AT_decl_file   : 6
    <4dd>   DW_AT_decl_line   : 512
    <4df>   DW_AT_type        : <0x21d>
    <4e3>   DW_AT_data_member_location: 0
 <2><4e4>: Abbrev Number: 11 (DW_TAG_member)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <4e9>   DW_AT_decl_file   : 6
    <4ea>   DW_AT_decl_line   : 513
    <4ec>   DW_AT_type        : <0x36b>
    <4f0>   DW_AT_data_member_location: 4
 <2><4f1>: Abbrev Number: 11 (DW_TAG_member)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <4f6>   DW_AT_decl_file   : 6
    <4f7>   DW_AT_decl_line   : 513
    <4f9>   DW_AT_type        : <0xb6>
    <4fd>   DW_AT_data_member_location: 8
 <2><4fe>: Abbrev Number: 11 (DW_TAG_member)
    <4ff>   DW_AT_name        : (indirect string, offset: 0xe603): c_index
    <503>   DW_AT_decl_file   : 6
    <504>   DW_AT_decl_line   : 514
    <506>   DW_AT_type        : <0x105>
    <50a>   DW_AT_data_member_location: 12
 <2><50b>: Abbrev Number: 11 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x1a89): signal
    <510>   DW_AT_decl_file   : 6
    <511>   DW_AT_decl_line   : 514
    <513>   DW_AT_type        : <0xe1f>
    <517>   DW_AT_data_member_location: 16
 <2><518>: Abbrev Number: 0
 <1><519>: Abbrev Number: 4 (DW_TAG_typedef)
    <51a>   DW_AT_name        : (indirect string, offset: 0x5bb1): UML_Connector
    <51e>   DW_AT_decl_file   : 6
    <51f>   DW_AT_decl_line   : 166
    <520>   DW_AT_type        : <0x524>
 <1><524>: Abbrev Number: 10 (DW_TAG_structure_type)
    <525>   DW_AT_name        : (indirect string, offset: 0x5bb1): UML_Connector
    <529>   DW_AT_byte_size   : 20
    <52a>   DW_AT_decl_file   : 6
    <52b>   DW_AT_decl_line   : 524
    <52d>   DW_AT_sibling     : <0x573>
 <2><531>: Abbrev Number: 11 (DW_TAG_member)
    <532>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <536>   DW_AT_decl_file   : 6
    <537>   DW_AT_decl_line   : 525
    <539>   DW_AT_type        : <0x21d>
    <53d>   DW_AT_data_member_location: 0
 <2><53e>: Abbrev Number: 11 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <543>   DW_AT_decl_file   : 6
    <544>   DW_AT_decl_line   : 526
    <546>   DW_AT_type        : <0x36b>
    <54a>   DW_AT_data_member_location: 4
 <2><54b>: Abbrev Number: 11 (DW_TAG_member)
    <54c>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <550>   DW_AT_decl_file   : 6
    <551>   DW_AT_decl_line   : 526
    <553>   DW_AT_type        : <0xb6>
    <557>   DW_AT_data_member_location: 8
 <2><558>: Abbrev Number: 12 (DW_TAG_member)
    <559>   DW_AT_name        : end
    <55d>   DW_AT_decl_file   : 6
    <55e>   DW_AT_decl_line   : 527
    <560>   DW_AT_type        : <0xe55>
    <564>   DW_AT_data_member_location: 12
 <2><565>: Abbrev Number: 11 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0x3fd5): type
    <56a>   DW_AT_decl_file   : 6
    <56b>   DW_AT_decl_line   : 527
    <56d>   DW_AT_type        : <0xe43>
    <571>   DW_AT_data_member_location: 16
 <2><572>: Abbrev Number: 0
 <1><573>: Abbrev Number: 4 (DW_TAG_typedef)
    <574>   DW_AT_name        : (indirect string, offset: 0x2c04): UML_InterfaceRealization
    <578>   DW_AT_decl_file   : 6
    <579>   DW_AT_decl_line   : 167
    <57a>   DW_AT_type        : <0x57e>
 <1><57e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <57f>   DW_AT_name        : (indirect string, offset: 0x2c04): UML_InterfaceRealization
    <583>   DW_AT_byte_size   : 8
    <584>   DW_AT_decl_file   : 6
    <585>   DW_AT_decl_line   : 537
    <587>   DW_AT_sibling     : <0x5a6>
 <2><58b>: Abbrev Number: 11 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <590>   DW_AT_decl_file   : 6
    <591>   DW_AT_decl_line   : 538
    <593>   DW_AT_type        : <0x21d>
    <597>   DW_AT_data_member_location: 0
 <2><598>: Abbrev Number: 11 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0xafcf): contract
    <59d>   DW_AT_decl_file   : 6
    <59e>   DW_AT_decl_line   : 539
    <5a0>   DW_AT_type        : <0xe5b>
    <5a4>   DW_AT_data_member_location: 4
 <2><5a5>: Abbrev Number: 0
 <1><5a6>: Abbrev Number: 4 (DW_TAG_typedef)
    <5a7>   DW_AT_name        : (indirect string, offset: 0x3844): UML_OpaqueExpression
    <5ab>   DW_AT_decl_file   : 6
    <5ac>   DW_AT_decl_line   : 168
    <5ad>   DW_AT_type        : <0x5b1>
 <1><5b1>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x3844): UML_OpaqueExpression
    <5b6>   DW_AT_byte_size   : 24
    <5b7>   DW_AT_decl_file   : 6
    <5b8>   DW_AT_decl_line   : 549
    <5ba>   DW_AT_sibling     : <0x60d>
 <2><5be>: Abbrev Number: 11 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <5c3>   DW_AT_decl_file   : 6
    <5c4>   DW_AT_decl_line   : 550
    <5c6>   DW_AT_type        : <0x21d>
    <5ca>   DW_AT_data_member_location: 0
 <2><5cb>: Abbrev Number: 11 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <5d0>   DW_AT_decl_file   : 6
    <5d1>   DW_AT_decl_line   : 551
    <5d3>   DW_AT_type        : <0x36b>
    <5d7>   DW_AT_data_member_location: 4
 <2><5d8>: Abbrev Number: 11 (DW_TAG_member)
    <5d9>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <5dd>   DW_AT_decl_file   : 6
    <5de>   DW_AT_decl_line   : 551
    <5e0>   DW_AT_type        : <0xb6>
    <5e4>   DW_AT_data_member_location: 8
 <2><5e5>: Abbrev Number: 11 (DW_TAG_member)
    <5e6>   DW_AT_name        : (indirect string, offset: 0xfd9d): c_function
    <5ea>   DW_AT_decl_file   : 6
    <5eb>   DW_AT_decl_line   : 552
    <5ed>   DW_AT_type        : <0xb4>
    <5f1>   DW_AT_data_member_location: 12
 <2><5f2>: Abbrev Number: 11 (DW_TAG_member)
    <5f3>   DW_AT_name        : (indirect string, offset: 0x55f4): language
    <5f7>   DW_AT_decl_file   : 6
    <5f8>   DW_AT_decl_line   : 552
    <5fa>   DW_AT_type        : <0xe61>
    <5fe>   DW_AT_data_member_location: 16
 <2><5ff>: Abbrev Number: 11 (DW_TAG_member)
    <600>   DW_AT_name        : (indirect string, offset: 0x106f2): body
    <604>   DW_AT_decl_file   : 6
    <605>   DW_AT_decl_line   : 552
    <607>   DW_AT_type        : <0xe61>
    <60b>   DW_AT_data_member_location: 20
 <2><60c>: Abbrev Number: 0
 <1><60d>: Abbrev Number: 4 (DW_TAG_typedef)
    <60e>   DW_AT_name        : (indirect string, offset: 0xfc8a): UML_Interface
    <612>   DW_AT_decl_file   : 6
    <613>   DW_AT_decl_line   : 169
    <614>   DW_AT_type        : <0x618>
 <1><618>: Abbrev Number: 10 (DW_TAG_structure_type)
    <619>   DW_AT_name        : (indirect string, offset: 0xfc8a): UML_Interface
    <61d>   DW_AT_byte_size   : 24
    <61e>   DW_AT_decl_file   : 6
    <61f>   DW_AT_decl_line   : 562
    <621>   DW_AT_sibling     : <0x674>
 <2><625>: Abbrev Number: 11 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <62a>   DW_AT_decl_file   : 6
    <62b>   DW_AT_decl_line   : 563
    <62d>   DW_AT_type        : <0x21d>
    <631>   DW_AT_data_member_location: 0
 <2><632>: Abbrev Number: 11 (DW_TAG_member)
    <633>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <637>   DW_AT_decl_file   : 6
    <638>   DW_AT_decl_line   : 564
    <63a>   DW_AT_type        : <0x36b>
    <63e>   DW_AT_data_member_location: 4
 <2><63f>: Abbrev Number: 11 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <644>   DW_AT_decl_file   : 6
    <645>   DW_AT_decl_line   : 564
    <647>   DW_AT_type        : <0xb6>
    <64b>   DW_AT_data_member_location: 8
 <2><64c>: Abbrev Number: 11 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <651>   DW_AT_decl_file   : 6
    <652>   DW_AT_decl_line   : 565
    <654>   DW_AT_type        : <0x1c4>
    <658>   DW_AT_data_member_location: 12
 <2><659>: Abbrev Number: 11 (DW_TAG_member)
    <65a>   DW_AT_name        : (indirect string, offset: 0xf4e2): ownedAttribute
    <65e>   DW_AT_decl_file   : 6
    <65f>   DW_AT_decl_line   : 565
    <661>   DW_AT_type        : <0xe67>
    <665>   DW_AT_data_member_location: 16
 <2><666>: Abbrev Number: 11 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0xc668): ownedReception
    <66b>   DW_AT_decl_file   : 6
    <66c>   DW_AT_decl_line   : 565
    <66e>   DW_AT_type        : <0xe6d>
    <672>   DW_AT_data_member_location: 20
 <2><673>: Abbrev Number: 0
 <1><674>: Abbrev Number: 4 (DW_TAG_typedef)
    <675>   DW_AT_name        : (indirect string, offset: 0x5a07): UML_Reception
    <679>   DW_AT_decl_file   : 6
    <67a>   DW_AT_decl_line   : 170
    <67b>   DW_AT_type        : <0x67f>
 <1><67f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <680>   DW_AT_name        : (indirect string, offset: 0x5a07): UML_Reception
    <684>   DW_AT_byte_size   : 16
    <685>   DW_AT_decl_file   : 6
    <686>   DW_AT_decl_line   : 575
    <688>   DW_AT_sibling     : <0x6c1>
 <2><68c>: Abbrev Number: 11 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <691>   DW_AT_decl_file   : 6
    <692>   DW_AT_decl_line   : 576
    <694>   DW_AT_type        : <0x21d>
    <698>   DW_AT_data_member_location: 0
 <2><699>: Abbrev Number: 11 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <69e>   DW_AT_decl_file   : 6
    <69f>   DW_AT_decl_line   : 577
    <6a1>   DW_AT_type        : <0x36b>
    <6a5>   DW_AT_data_member_location: 4
 <2><6a6>: Abbrev Number: 11 (DW_TAG_member)
    <6a7>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <6ab>   DW_AT_decl_file   : 6
    <6ac>   DW_AT_decl_line   : 577
    <6ae>   DW_AT_type        : <0xb6>
    <6b2>   DW_AT_data_member_location: 8
 <2><6b3>: Abbrev Number: 11 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x1a89): signal
    <6b8>   DW_AT_decl_file   : 6
    <6b9>   DW_AT_decl_line   : 578
    <6bb>   DW_AT_type        : <0xe1f>
    <6bf>   DW_AT_data_member_location: 12
 <2><6c0>: Abbrev Number: 0
 <1><6c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <6c2>   DW_AT_name        : (indirect string, offset: 0x96b1): UML_Pseudostate
    <6c6>   DW_AT_decl_file   : 6
    <6c7>   DW_AT_decl_line   : 171
    <6c8>   DW_AT_type        : <0x6cc>
 <1><6cc>: Abbrev Number: 10 (DW_TAG_structure_type)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x96b1): UML_Pseudostate
    <6d1>   DW_AT_byte_size   : 28
    <6d2>   DW_AT_decl_file   : 6
    <6d3>   DW_AT_decl_line   : 588
    <6d5>   DW_AT_sibling     : <0x735>
 <2><6d9>: Abbrev Number: 11 (DW_TAG_member)
    <6da>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <6de>   DW_AT_decl_file   : 6
    <6df>   DW_AT_decl_line   : 589
    <6e1>   DW_AT_type        : <0x21d>
    <6e5>   DW_AT_data_member_location: 0
 <2><6e6>: Abbrev Number: 11 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <6eb>   DW_AT_decl_file   : 6
    <6ec>   DW_AT_decl_line   : 590
    <6ee>   DW_AT_type        : <0x36b>
    <6f2>   DW_AT_data_member_location: 4
 <2><6f3>: Abbrev Number: 11 (DW_TAG_member)
    <6f4>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <6f8>   DW_AT_decl_file   : 6
    <6f9>   DW_AT_decl_line   : 590
    <6fb>   DW_AT_type        : <0xb6>
    <6ff>   DW_AT_data_member_location: 8
 <2><700>: Abbrev Number: 11 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <705>   DW_AT_decl_file   : 6
    <706>   DW_AT_decl_line   : 591
    <708>   DW_AT_type        : <0x1e8>
    <70c>   DW_AT_data_member_location: 12
 <2><70d>: Abbrev Number: 11 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0x69cd): incoming
    <712>   DW_AT_decl_file   : 6
    <713>   DW_AT_decl_line   : 591
    <715>   DW_AT_type        : <0xe79>
    <719>   DW_AT_data_member_location: 16
 <2><71a>: Abbrev Number: 11 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0xf118): outgoing
    <71f>   DW_AT_decl_file   : 6
    <720>   DW_AT_decl_line   : 591
    <722>   DW_AT_type        : <0xe79>
    <726>   DW_AT_data_member_location: 20
 <2><727>: Abbrev Number: 11 (DW_TAG_member)
    <728>   DW_AT_name        : (indirect string, offset: 0xf121): kind
    <72c>   DW_AT_decl_file   : 6
    <72d>   DW_AT_decl_line   : 592
    <72f>   DW_AT_type        : <0x39f>
    <733>   DW_AT_data_member_location: 24
 <2><734>: Abbrev Number: 0
 <1><735>: Abbrev Number: 4 (DW_TAG_typedef)
    <736>   DW_AT_name        : (indirect string, offset: 0x3236): UML_Vertex
    <73a>   DW_AT_decl_file   : 6
    <73b>   DW_AT_decl_line   : 172
    <73c>   DW_AT_type        : <0x740>
 <1><740>: Abbrev Number: 10 (DW_TAG_structure_type)
    <741>   DW_AT_name        : (indirect string, offset: 0x3236): UML_Vertex
    <745>   DW_AT_byte_size   : 24
    <746>   DW_AT_decl_file   : 6
    <747>   DW_AT_decl_line   : 602
    <749>   DW_AT_sibling     : <0x79c>
 <2><74d>: Abbrev Number: 11 (DW_TAG_member)
    <74e>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <752>   DW_AT_decl_file   : 6
    <753>   DW_AT_decl_line   : 603
    <755>   DW_AT_type        : <0x21d>
    <759>   DW_AT_data_member_location: 0
 <2><75a>: Abbrev Number: 11 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <75f>   DW_AT_decl_file   : 6
    <760>   DW_AT_decl_line   : 604
    <762>   DW_AT_type        : <0x36b>
    <766>   DW_AT_data_member_location: 4
 <2><767>: Abbrev Number: 11 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <76c>   DW_AT_decl_file   : 6
    <76d>   DW_AT_decl_line   : 604
    <76f>   DW_AT_type        : <0xb6>
    <773>   DW_AT_data_member_location: 8
 <2><774>: Abbrev Number: 11 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <779>   DW_AT_decl_file   : 6
    <77a>   DW_AT_decl_line   : 605
    <77c>   DW_AT_type        : <0x1e8>
    <780>   DW_AT_data_member_location: 12
 <2><781>: Abbrev Number: 11 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x69cd): incoming
    <786>   DW_AT_decl_file   : 6
    <787>   DW_AT_decl_line   : 605
    <789>   DW_AT_type        : <0xe79>
    <78d>   DW_AT_data_member_location: 16
 <2><78e>: Abbrev Number: 11 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0xf118): outgoing
    <793>   DW_AT_decl_file   : 6
    <794>   DW_AT_decl_line   : 605
    <796>   DW_AT_type        : <0xe79>
    <79a>   DW_AT_data_member_location: 20
 <2><79b>: Abbrev Number: 0
 <1><79c>: Abbrev Number: 4 (DW_TAG_typedef)
    <79d>   DW_AT_name        : (indirect string, offset: 0x4a2f): UML_Association
    <7a1>   DW_AT_decl_file   : 6
    <7a2>   DW_AT_decl_line   : 173
    <7a3>   DW_AT_type        : <0x7a7>
 <1><7a7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x4a2f): UML_Association
    <7ac>   DW_AT_byte_size   : 24
    <7ad>   DW_AT_decl_file   : 6
    <7ae>   DW_AT_decl_line   : 615
    <7b0>   DW_AT_sibling     : <0x803>
 <2><7b4>: Abbrev Number: 11 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <7b9>   DW_AT_decl_file   : 6
    <7ba>   DW_AT_decl_line   : 616
    <7bc>   DW_AT_type        : <0x21d>
    <7c0>   DW_AT_data_member_location: 0
 <2><7c1>: Abbrev Number: 11 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <7c6>   DW_AT_decl_file   : 6
    <7c7>   DW_AT_decl_line   : 617
    <7c9>   DW_AT_type        : <0x36b>
    <7cd>   DW_AT_data_member_location: 4
 <2><7ce>: Abbrev Number: 11 (DW_TAG_member)
    <7cf>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <7d3>   DW_AT_decl_file   : 6
    <7d4>   DW_AT_decl_line   : 617
    <7d6>   DW_AT_type        : <0xb6>
    <7da>   DW_AT_data_member_location: 8
 <2><7db>: Abbrev Number: 11 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <7e0>   DW_AT_decl_file   : 6
    <7e1>   DW_AT_decl_line   : 618
    <7e3>   DW_AT_type        : <0x1c4>
    <7e7>   DW_AT_data_member_location: 12
 <2><7e8>: Abbrev Number: 11 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x7b8f): memberEnd
    <7ed>   DW_AT_decl_file   : 6
    <7ee>   DW_AT_decl_line   : 618
    <7f0>   DW_AT_type        : <0xe67>
    <7f4>   DW_AT_data_member_location: 16
 <2><7f5>: Abbrev Number: 11 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x8c3e): ownedEnd
    <7fa>   DW_AT_decl_file   : 6
    <7fb>   DW_AT_decl_line   : 618
    <7fd>   DW_AT_type        : <0xe67>
    <801>   DW_AT_data_member_location: 20
 <2><802>: Abbrev Number: 0
 <1><803>: Abbrev Number: 4 (DW_TAG_typedef)
    <804>   DW_AT_name        : (indirect string, offset: 0x8351): UML_ValueSpecification
    <808>   DW_AT_decl_file   : 6
    <809>   DW_AT_decl_line   : 174
    <80a>   DW_AT_type        : <0x80e>
 <1><80e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <80f>   DW_AT_name        : (indirect string, offset: 0x8351): UML_ValueSpecification
    <813>   DW_AT_byte_size   : 4
    <814>   DW_AT_decl_file   : 6
    <815>   DW_AT_decl_line   : 628
    <817>   DW_AT_sibling     : <0x829>
 <2><81b>: Abbrev Number: 11 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <820>   DW_AT_decl_file   : 6
    <821>   DW_AT_decl_line   : 629
    <823>   DW_AT_type        : <0x21d>
    <827>   DW_AT_data_member_location: 0
 <2><828>: Abbrev Number: 0
 <1><829>: Abbrev Number: 4 (DW_TAG_typedef)
    <82a>   DW_AT_name        : (indirect string, offset: 0x39d6): UML_Property
    <82e>   DW_AT_decl_file   : 6
    <82f>   DW_AT_decl_line   : 175
    <830>   DW_AT_type        : <0x834>
 <1><834>: Abbrev Number: 10 (DW_TAG_structure_type)
    <835>   DW_AT_name        : (indirect string, offset: 0x39d6): UML_Property
    <839>   DW_AT_byte_size   : 32
    <83a>   DW_AT_decl_file   : 6
    <83b>   DW_AT_decl_line   : 640
    <83d>   DW_AT_sibling     : <0x8aa>
 <2><841>: Abbrev Number: 11 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <846>   DW_AT_decl_file   : 6
    <847>   DW_AT_decl_line   : 641
    <849>   DW_AT_type        : <0x21d>
    <84d>   DW_AT_data_member_location: 0
 <2><84e>: Abbrev Number: 11 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <853>   DW_AT_decl_file   : 6
    <854>   DW_AT_decl_line   : 642
    <856>   DW_AT_type        : <0x36b>
    <85a>   DW_AT_data_member_location: 4
 <2><85b>: Abbrev Number: 11 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <860>   DW_AT_decl_file   : 6
    <861>   DW_AT_decl_line   : 642
    <863>   DW_AT_type        : <0xb6>
    <867>   DW_AT_data_member_location: 8
 <2><868>: Abbrev Number: 11 (DW_TAG_member)
    <869>   DW_AT_name        : (indirect string, offset: 0x3fd5): type
    <86d>   DW_AT_decl_file   : 6
    <86e>   DW_AT_decl_line   : 643
    <870>   DW_AT_type        : <0xe37>
    <874>   DW_AT_data_member_location: 12
 <2><875>: Abbrev Number: 11 (DW_TAG_member)
    <876>   DW_AT_name        : (indirect string, offset: 0x75ef): lower
    <87a>   DW_AT_decl_file   : 6
    <87b>   DW_AT_decl_line   : 644
    <87d>   DW_AT_type        : <0x2c>
    <881>   DW_AT_data_member_location: 16
 <2><882>: Abbrev Number: 11 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0x17f2): association
    <887>   DW_AT_decl_file   : 6
    <888>   DW_AT_decl_line   : 645
    <88a>   DW_AT_type        : <0xe43>
    <88e>   DW_AT_data_member_location: 20
 <2><88f>: Abbrev Number: 11 (DW_TAG_member)
    <890>   DW_AT_name        : (indirect string, offset: 0xf196): aggregation
    <894>   DW_AT_decl_file   : 6
    <895>   DW_AT_decl_line   : 645
    <897>   DW_AT_type        : <0x3f7>
    <89b>   DW_AT_data_member_location: 24
 <2><89c>: Abbrev Number: 11 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0x4c5c): class
    <8a1>   DW_AT_decl_file   : 6
    <8a2>   DW_AT_decl_line   : 645
    <8a4>   DW_AT_type        : <0xe37>
    <8a8>   DW_AT_data_member_location: 28
 <2><8a9>: Abbrev Number: 0
 <1><8aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x6825): UML_Transition
    <8af>   DW_AT_decl_file   : 6
    <8b0>   DW_AT_decl_line   : 176
    <8b1>   DW_AT_type        : <0x8b5>
 <1><8b5>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x6825): UML_Transition
    <8ba>   DW_AT_byte_size   : 32
    <8bb>   DW_AT_decl_file   : 6
    <8bc>   DW_AT_decl_line   : 655
    <8be>   DW_AT_sibling     : <0x92b>
 <2><8c2>: Abbrev Number: 11 (DW_TAG_member)
    <8c3>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <8c7>   DW_AT_decl_file   : 6
    <8c8>   DW_AT_decl_line   : 656
    <8ca>   DW_AT_type        : <0x21d>
    <8ce>   DW_AT_data_member_location: 0
 <2><8cf>: Abbrev Number: 11 (DW_TAG_member)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <8d4>   DW_AT_decl_file   : 6
    <8d5>   DW_AT_decl_line   : 657
    <8d7>   DW_AT_type        : <0x36b>
    <8db>   DW_AT_data_member_location: 4
 <2><8dc>: Abbrev Number: 11 (DW_TAG_member)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <8e1>   DW_AT_decl_file   : 6
    <8e2>   DW_AT_decl_line   : 657
    <8e4>   DW_AT_type        : <0xb6>
    <8e8>   DW_AT_data_member_location: 8
 <2><8e9>: Abbrev Number: 11 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0xea38): guard
    <8ee>   DW_AT_decl_file   : 6
    <8ef>   DW_AT_decl_line   : 658
    <8f1>   DW_AT_type        : <0xe85>
    <8f5>   DW_AT_data_member_location: 12
 <2><8f6>: Abbrev Number: 11 (DW_TAG_member)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x54d4): effect
    <8fb>   DW_AT_decl_file   : 6
    <8fc>   DW_AT_decl_line   : 658
    <8fe>   DW_AT_type        : <0xe8b>
    <902>   DW_AT_data_member_location: 16
 <2><903>: Abbrev Number: 11 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x2aa3): trigger
    <908>   DW_AT_decl_file   : 6
    <909>   DW_AT_decl_line   : 658
    <90b>   DW_AT_type        : <0xe91>
    <90f>   DW_AT_data_member_location: 20
 <2><910>: Abbrev Number: 11 (DW_TAG_member)
    <911>   DW_AT_name        : (indirect string, offset: 0x2b16): source
    <915>   DW_AT_decl_file   : 6
    <916>   DW_AT_decl_line   : 658
    <918>   DW_AT_type        : <0xe97>
    <91c>   DW_AT_data_member_location: 24
 <2><91d>: Abbrev Number: 11 (DW_TAG_member)
    <91e>   DW_AT_name        : (indirect string, offset: 0x5065): target
    <922>   DW_AT_decl_file   : 6
    <923>   DW_AT_decl_line   : 658
    <925>   DW_AT_type        : <0xe97>
    <929>   DW_AT_data_member_location: 28
 <2><92a>: Abbrev Number: 0
 <1><92b>: Abbrev Number: 4 (DW_TAG_typedef)
    <92c>   DW_AT_name        : (indirect string, offset: 0x37e0): UML_PrimitiveType
    <930>   DW_AT_decl_file   : 6
    <931>   DW_AT_decl_line   : 179
    <932>   DW_AT_type        : <0x936>
 <1><936>: Abbrev Number: 10 (DW_TAG_structure_type)
    <937>   DW_AT_name        : (indirect string, offset: 0x37e0): UML_PrimitiveType
    <93b>   DW_AT_byte_size   : 16
    <93c>   DW_AT_decl_file   : 6
    <93d>   DW_AT_decl_line   : 692
    <93f>   DW_AT_sibling     : <0x978>
 <2><943>: Abbrev Number: 11 (DW_TAG_member)
    <944>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <948>   DW_AT_decl_file   : 6
    <949>   DW_AT_decl_line   : 693
    <94b>   DW_AT_type        : <0x21d>
    <94f>   DW_AT_data_member_location: 0
 <2><950>: Abbrev Number: 11 (DW_TAG_member)
    <951>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <955>   DW_AT_decl_file   : 6
    <956>   DW_AT_decl_line   : 694
    <958>   DW_AT_type        : <0x36b>
    <95c>   DW_AT_data_member_location: 4
 <2><95d>: Abbrev Number: 11 (DW_TAG_member)
    <95e>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <962>   DW_AT_decl_file   : 6
    <963>   DW_AT_decl_line   : 694
    <965>   DW_AT_type        : <0xb6>
    <969>   DW_AT_data_member_location: 8
 <2><96a>: Abbrev Number: 11 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <96f>   DW_AT_decl_file   : 6
    <970>   DW_AT_decl_line   : 695
    <972>   DW_AT_type        : <0x1c4>
    <976>   DW_AT_data_member_location: 12
 <2><977>: Abbrev Number: 0
 <1><978>: Abbrev Number: 4 (DW_TAG_typedef)
    <979>   DW_AT_name        : (indirect string, offset: 0xe93b): UML_StateMachine
    <97d>   DW_AT_decl_file   : 6
    <97e>   DW_AT_decl_line   : 180
    <97f>   DW_AT_type        : <0x983>
 <1><983>: Abbrev Number: 10 (DW_TAG_structure_type)
    <984>   DW_AT_name        : (indirect string, offset: 0xe93b): UML_StateMachine
    <988>   DW_AT_byte_size   : 16
    <989>   DW_AT_decl_file   : 6
    <98a>   DW_AT_decl_line   : 705
    <98c>   DW_AT_sibling     : <0x9c5>
 <2><990>: Abbrev Number: 11 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <995>   DW_AT_decl_file   : 6
    <996>   DW_AT_decl_line   : 706
    <998>   DW_AT_type        : <0x21d>
    <99c>   DW_AT_data_member_location: 0
 <2><99d>: Abbrev Number: 11 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <9a2>   DW_AT_decl_file   : 6
    <9a3>   DW_AT_decl_line   : 707
    <9a5>   DW_AT_type        : <0x36b>
    <9a9>   DW_AT_data_member_location: 4
 <2><9aa>: Abbrev Number: 11 (DW_TAG_member)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <9af>   DW_AT_decl_file   : 6
    <9b0>   DW_AT_decl_line   : 707
    <9b2>   DW_AT_type        : <0xb6>
    <9b6>   DW_AT_data_member_location: 8
 <2><9b7>: Abbrev Number: 11 (DW_TAG_member)
    <9b8>   DW_AT_name        : (indirect string, offset: 0xa540): region
    <9bc>   DW_AT_decl_file   : 6
    <9bd>   DW_AT_decl_line   : 708
    <9bf>   DW_AT_type        : <0xea9>
    <9c3>   DW_AT_data_member_location: 12
 <2><9c4>: Abbrev Number: 0
 <1><9c5>: Abbrev Number: 4 (DW_TAG_typedef)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x9dfd): UML_Behavior
    <9ca>   DW_AT_decl_file   : 6
    <9cb>   DW_AT_decl_line   : 183
    <9cc>   DW_AT_type        : <0x9d0>
 <1><9d0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <9d1>   DW_AT_name        : (indirect string, offset: 0x9dfd): UML_Behavior
    <9d5>   DW_AT_byte_size   : 8
    <9d6>   DW_AT_decl_file   : 6
    <9d7>   DW_AT_decl_line   : 742
    <9d9>   DW_AT_sibling     : <0x9f8>
 <2><9dd>: Abbrev Number: 11 (DW_TAG_member)
    <9de>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <9e2>   DW_AT_decl_file   : 6
    <9e3>   DW_AT_decl_line   : 743
    <9e5>   DW_AT_type        : <0x21d>
    <9e9>   DW_AT_data_member_location: 0
 <2><9ea>: Abbrev Number: 11 (DW_TAG_member)
    <9eb>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <9ef>   DW_AT_decl_file   : 6
    <9f0>   DW_AT_decl_line   : 744
    <9f2>   DW_AT_type        : <0x212>
    <9f6>   DW_AT_data_member_location: 4
 <2><9f7>: Abbrev Number: 0
 <1><9f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <9f9>   DW_AT_name        : (indirect string, offset: 0xae6d): UML_OpaqueBehavior
    <9fd>   DW_AT_decl_file   : 6
    <9fe>   DW_AT_decl_line   : 184
    <9ff>   DW_AT_type        : <0xa03>
 <1><a03>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a04>   DW_AT_name        : (indirect string, offset: 0xae6d): UML_OpaqueBehavior
    <a08>   DW_AT_byte_size   : 28
    <a09>   DW_AT_decl_file   : 6
    <a0a>   DW_AT_decl_line   : 754
    <a0c>   DW_AT_sibling     : <0xa6c>
 <2><a10>: Abbrev Number: 11 (DW_TAG_member)
    <a11>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <a15>   DW_AT_decl_file   : 6
    <a16>   DW_AT_decl_line   : 755
    <a18>   DW_AT_type        : <0x21d>
    <a1c>   DW_AT_data_member_location: 0
 <2><a1d>: Abbrev Number: 11 (DW_TAG_member)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <a22>   DW_AT_decl_file   : 6
    <a23>   DW_AT_decl_line   : 756
    <a25>   DW_AT_type        : <0x36b>
    <a29>   DW_AT_data_member_location: 4
 <2><a2a>: Abbrev Number: 11 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <a2f>   DW_AT_decl_file   : 6
    <a30>   DW_AT_decl_line   : 756
    <a32>   DW_AT_type        : <0xb6>
    <a36>   DW_AT_data_member_location: 8
 <2><a37>: Abbrev Number: 11 (DW_TAG_member)
    <a38>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <a3c>   DW_AT_decl_file   : 6
    <a3d>   DW_AT_decl_line   : 757
    <a3f>   DW_AT_type        : <0x212>
    <a43>   DW_AT_data_member_location: 12
 <2><a44>: Abbrev Number: 11 (DW_TAG_member)
    <a45>   DW_AT_name        : (indirect string, offset: 0xfd9d): c_function
    <a49>   DW_AT_decl_file   : 6
    <a4a>   DW_AT_decl_line   : 757
    <a4c>   DW_AT_type        : <0xb4>
    <a50>   DW_AT_data_member_location: 16
 <2><a51>: Abbrev Number: 11 (DW_TAG_member)
    <a52>   DW_AT_name        : (indirect string, offset: 0x55f4): language
    <a56>   DW_AT_decl_file   : 6
    <a57>   DW_AT_decl_line   : 757
    <a59>   DW_AT_type        : <0xe61>
    <a5d>   DW_AT_data_member_location: 20
 <2><a5e>: Abbrev Number: 11 (DW_TAG_member)
    <a5f>   DW_AT_name        : (indirect string, offset: 0x106f2): body
    <a63>   DW_AT_decl_file   : 6
    <a64>   DW_AT_decl_line   : 757
    <a66>   DW_AT_type        : <0xe61>
    <a6a>   DW_AT_data_member_location: 24
 <2><a6b>: Abbrev Number: 0
 <1><a6c>: Abbrev Number: 4 (DW_TAG_typedef)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x654a): UML_State
    <a71>   DW_AT_decl_file   : 6
    <a72>   DW_AT_decl_line   : 185
    <a73>   DW_AT_type        : <0xa77>
 <1><a77>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a78>   DW_AT_name        : (indirect string, offset: 0x654a): UML_State
    <a7c>   DW_AT_byte_size   : 36
    <a7d>   DW_AT_decl_file   : 6
    <a7e>   DW_AT_decl_line   : 767
    <a80>   DW_AT_sibling     : <0xafa>
 <2><a84>: Abbrev Number: 11 (DW_TAG_member)
    <a85>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <a89>   DW_AT_decl_file   : 6
    <a8a>   DW_AT_decl_line   : 768
    <a8c>   DW_AT_type        : <0x21d>
    <a90>   DW_AT_data_member_location: 0
 <2><a91>: Abbrev Number: 11 (DW_TAG_member)
    <a92>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <a96>   DW_AT_decl_file   : 6
    <a97>   DW_AT_decl_line   : 769
    <a99>   DW_AT_type        : <0x36b>
    <a9d>   DW_AT_data_member_location: 4
 <2><a9e>: Abbrev Number: 11 (DW_TAG_member)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <aa3>   DW_AT_decl_file   : 6
    <aa4>   DW_AT_decl_line   : 769
    <aa6>   DW_AT_type        : <0xb6>
    <aaa>   DW_AT_data_member_location: 8
 <2><aab>: Abbrev Number: 11 (DW_TAG_member)
    <aac>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <ab0>   DW_AT_decl_file   : 6
    <ab1>   DW_AT_decl_line   : 770
    <ab3>   DW_AT_type        : <0x1e8>
    <ab7>   DW_AT_data_member_location: 12
 <2><ab8>: Abbrev Number: 11 (DW_TAG_member)
    <ab9>   DW_AT_name        : (indirect string, offset: 0x69cd): incoming
    <abd>   DW_AT_decl_file   : 6
    <abe>   DW_AT_decl_line   : 770
    <ac0>   DW_AT_type        : <0xe79>
    <ac4>   DW_AT_data_member_location: 16
 <2><ac5>: Abbrev Number: 11 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0xf118): outgoing
    <aca>   DW_AT_decl_file   : 6
    <acb>   DW_AT_decl_line   : 770
    <acd>   DW_AT_type        : <0xe79>
    <ad1>   DW_AT_data_member_location: 20
 <2><ad2>: Abbrev Number: 11 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0xba5f): entry
    <ad7>   DW_AT_decl_file   : 6
    <ad8>   DW_AT_decl_line   : 771
    <ada>   DW_AT_type        : <0xe8b>
    <ade>   DW_AT_data_member_location: 24
 <2><adf>: Abbrev Number: 11 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x5c9a): exit
    <ae4>   DW_AT_decl_file   : 6
    <ae5>   DW_AT_decl_line   : 771
    <ae7>   DW_AT_type        : <0xe8b>
    <aeb>   DW_AT_data_member_location: 28
 <2><aec>: Abbrev Number: 11 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0x9207): deferrableTrigger
    <af1>   DW_AT_decl_file   : 6
    <af2>   DW_AT_decl_line   : 771
    <af4>   DW_AT_type        : <0xe91>
    <af8>   DW_AT_data_member_location: 32
 <2><af9>: Abbrev Number: 0
 <1><afa>: Abbrev Number: 4 (DW_TAG_typedef)
    <afb>   DW_AT_name        : (indirect string, offset: 0xa3d6): UML_Trigger
    <aff>   DW_AT_decl_file   : 6
    <b00>   DW_AT_decl_line   : 186
    <b01>   DW_AT_type        : <0xb05>
 <1><b05>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b06>   DW_AT_name        : (indirect string, offset: 0xa3d6): UML_Trigger
    <b0a>   DW_AT_byte_size   : 20
    <b0b>   DW_AT_decl_file   : 6
    <b0c>   DW_AT_decl_line   : 781
    <b0e>   DW_AT_sibling     : <0xb54>
 <2><b12>: Abbrev Number: 11 (DW_TAG_member)
    <b13>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <b17>   DW_AT_decl_file   : 6
    <b18>   DW_AT_decl_line   : 782
    <b1a>   DW_AT_type        : <0x21d>
    <b1e>   DW_AT_data_member_location: 0
 <2><b1f>: Abbrev Number: 11 (DW_TAG_member)
    <b20>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <b24>   DW_AT_decl_file   : 6
    <b25>   DW_AT_decl_line   : 783
    <b27>   DW_AT_type        : <0x36b>
    <b2b>   DW_AT_data_member_location: 4
 <2><b2c>: Abbrev Number: 11 (DW_TAG_member)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <b31>   DW_AT_decl_file   : 6
    <b32>   DW_AT_decl_line   : 783
    <b34>   DW_AT_type        : <0xb6>
    <b38>   DW_AT_data_member_location: 8
 <2><b39>: Abbrev Number: 11 (DW_TAG_member)
    <b3a>   DW_AT_name        : (indirect string, offset: 0x100a6): port
    <b3e>   DW_AT_decl_file   : 6
    <b3f>   DW_AT_decl_line   : 784
    <b41>   DW_AT_type        : <0xeb5>
    <b45>   DW_AT_data_member_location: 12
 <2><b46>: Abbrev Number: 11 (DW_TAG_member)
    <b47>   DW_AT_name        : (indirect string, offset: 0x134): event
    <b4b>   DW_AT_decl_file   : 6
    <b4c>   DW_AT_decl_line   : 784
    <b4e>   DW_AT_type        : <0xe2b>
    <b52>   DW_AT_data_member_location: 16
 <2><b53>: Abbrev Number: 0
 <1><b54>: Abbrev Number: 4 (DW_TAG_typedef)
    <b55>   DW_AT_name        : (indirect string, offset: 0x11a6): UML_Signal
    <b59>   DW_AT_decl_file   : 6
    <b5a>   DW_AT_decl_line   : 188
    <b5b>   DW_AT_type        : <0xb5f>
 <1><b5f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b60>   DW_AT_name        : (indirect string, offset: 0x11a6): UML_Signal
    <b64>   DW_AT_byte_size   : 16
    <b65>   DW_AT_decl_file   : 6
    <b66>   DW_AT_decl_line   : 806
    <b68>   DW_AT_sibling     : <0xba1>
 <2><b6c>: Abbrev Number: 11 (DW_TAG_member)
    <b6d>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <b71>   DW_AT_decl_file   : 6
    <b72>   DW_AT_decl_line   : 807
    <b74>   DW_AT_type        : <0x21d>
    <b78>   DW_AT_data_member_location: 0
 <2><b79>: Abbrev Number: 11 (DW_TAG_member)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <b7e>   DW_AT_decl_file   : 6
    <b7f>   DW_AT_decl_line   : 808
    <b81>   DW_AT_type        : <0x36b>
    <b85>   DW_AT_data_member_location: 4
 <2><b86>: Abbrev Number: 11 (DW_TAG_member)
    <b87>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <b8b>   DW_AT_decl_file   : 6
    <b8c>   DW_AT_decl_line   : 808
    <b8e>   DW_AT_type        : <0xb6>
    <b92>   DW_AT_data_member_location: 8
 <2><b93>: Abbrev Number: 11 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0xf4e2): ownedAttribute
    <b98>   DW_AT_decl_file   : 6
    <b99>   DW_AT_decl_line   : 809
    <b9b>   DW_AT_type        : <0xe67>
    <b9f>   DW_AT_data_member_location: 12
 <2><ba0>: Abbrev Number: 0
 <1><ba1>: Abbrev Number: 4 (DW_TAG_typedef)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x8625): UML_Class
    <ba6>   DW_AT_decl_file   : 6
    <ba7>   DW_AT_decl_line   : 189
    <ba8>   DW_AT_type        : <0xbac>
 <1><bac>: Abbrev Number: 10 (DW_TAG_structure_type)
    <bad>   DW_AT_name        : (indirect string, offset: 0x8625): UML_Class
    <bb1>   DW_AT_byte_size   : 48
    <bb2>   DW_AT_decl_file   : 6
    <bb3>   DW_AT_decl_line   : 819
    <bb5>   DW_AT_sibling     : <0xc56>
 <2><bb9>: Abbrev Number: 11 (DW_TAG_member)
    <bba>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <bbe>   DW_AT_decl_file   : 6
    <bbf>   DW_AT_decl_line   : 820
    <bc1>   DW_AT_type        : <0x21d>
    <bc5>   DW_AT_data_member_location: 0
 <2><bc6>: Abbrev Number: 11 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <bcb>   DW_AT_decl_file   : 6
    <bcc>   DW_AT_decl_line   : 821
    <bce>   DW_AT_type        : <0x36b>
    <bd2>   DW_AT_data_member_location: 4
 <2><bd3>: Abbrev Number: 11 (DW_TAG_member)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <bd8>   DW_AT_decl_file   : 6
    <bd9>   DW_AT_decl_line   : 821
    <bdb>   DW_AT_type        : <0xb6>
    <bdf>   DW_AT_data_member_location: 8
 <2><be0>: Abbrev Number: 11 (DW_TAG_member)
    <be1>   DW_AT_name        : (indirect string, offset: 0xc8e2): ownedConnector
    <be5>   DW_AT_decl_file   : 6
    <be6>   DW_AT_decl_line   : 822
    <be8>   DW_AT_type        : <0xe9d>
    <bec>   DW_AT_data_member_location: 12
 <2><bed>: Abbrev Number: 11 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0xf4e2): ownedAttribute
    <bf2>   DW_AT_decl_file   : 6
    <bf3>   DW_AT_decl_line   : 822
    <bf5>   DW_AT_type        : <0xe67>
    <bf9>   DW_AT_data_member_location: 16
 <2><bfa>: Abbrev Number: 11 (DW_TAG_member)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x11036): classifierBehavior
    <bff>   DW_AT_decl_file   : 6
    <c00>   DW_AT_decl_line   : 823
    <c02>   DW_AT_type        : <0xe8b>
    <c06>   DW_AT_data_member_location: 20
 <2><c07>: Abbrev Number: 11 (DW_TAG_member)
    <c08>   DW_AT_name        : (indirect string, offset: 0x700b): interfaceRealization
    <c0c>   DW_AT_decl_file   : 6
    <c0d>   DW_AT_decl_line   : 823
    <c0f>   DW_AT_type        : <0xec1>
    <c13>   DW_AT_data_member_location: 24
 <2><c14>: Abbrev Number: 11 (DW_TAG_member)
    <c15>   DW_AT_name        : (indirect string, offset: 0xd34e): ownedPort
    <c19>   DW_AT_decl_file   : 6
    <c1a>   DW_AT_decl_line   : 824
    <c1c>   DW_AT_type        : <0xeb5>
    <c20>   DW_AT_data_member_location: 28
 <2><c21>: Abbrev Number: 11 (DW_TAG_member)
    <c22>   DW_AT_name        : (indirect string, offset: 0xb6fb): c_kind
    <c26>   DW_AT_decl_file   : 6
    <c27>   DW_AT_decl_line   : 825
    <c29>   DW_AT_type        : <0x1c4>
    <c2d>   DW_AT_data_member_location: 32
 <2><c2e>: Abbrev Number: 11 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x129): superClass
    <c33>   DW_AT_decl_file   : 6
    <c34>   DW_AT_decl_line   : 825
    <c36>   DW_AT_type        : <0xe31>
    <c3a>   DW_AT_data_member_location: 36
 <2><c3b>: Abbrev Number: 11 (DW_TAG_member)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x59fe): isActive
    <c40>   DW_AT_decl_file   : 6
    <c41>   DW_AT_decl_line   : 825
    <c43>   DW_AT_type        : <0xecd>
    <c47>   DW_AT_data_member_location: 40
 <2><c48>: Abbrev Number: 11 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0xc668): ownedReception
    <c4d>   DW_AT_decl_file   : 6
    <c4e>   DW_AT_decl_line   : 825
    <c50>   DW_AT_type        : <0xe6d>
    <c54>   DW_AT_data_member_location: 44
 <2><c55>: Abbrev Number: 0
 <1><c56>: Abbrev Number: 4 (DW_TAG_typedef)
    <c57>   DW_AT_name        : (indirect string, offset: 0xa057): UML_Region
    <c5b>   DW_AT_decl_file   : 6
    <c5c>   DW_AT_decl_line   : 191
    <c5d>   DW_AT_type        : <0xc61>
 <1><c61>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c62>   DW_AT_name        : (indirect string, offset: 0xa057): UML_Region
    <c66>   DW_AT_byte_size   : 20
    <c67>   DW_AT_decl_file   : 6
    <c68>   DW_AT_decl_line   : 847
    <c6a>   DW_AT_sibling     : <0xcb0>
 <2><c6e>: Abbrev Number: 11 (DW_TAG_member)
    <c6f>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <c73>   DW_AT_decl_file   : 6
    <c74>   DW_AT_decl_line   : 848
    <c76>   DW_AT_type        : <0x21d>
    <c7a>   DW_AT_data_member_location: 0
 <2><c7b>: Abbrev Number: 11 (DW_TAG_member)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <c80>   DW_AT_decl_file   : 6
    <c81>   DW_AT_decl_line   : 849
    <c83>   DW_AT_type        : <0x36b>
    <c87>   DW_AT_data_member_location: 4
 <2><c88>: Abbrev Number: 11 (DW_TAG_member)
    <c89>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <c8d>   DW_AT_decl_file   : 6
    <c8e>   DW_AT_decl_line   : 849
    <c90>   DW_AT_type        : <0xb6>
    <c94>   DW_AT_data_member_location: 8
 <2><c95>: Abbrev Number: 11 (DW_TAG_member)
    <c96>   DW_AT_name        : (indirect string, offset: 0x1944): subvertex
    <c9a>   DW_AT_decl_file   : 6
    <c9b>   DW_AT_decl_line   : 850
    <c9d>   DW_AT_type        : <0xed4>
    <ca1>   DW_AT_data_member_location: 12
 <2><ca2>: Abbrev Number: 11 (DW_TAG_member)
    <ca3>   DW_AT_name        : (indirect string, offset: 0xdc69): transition
    <ca7>   DW_AT_decl_file   : 6
    <ca8>   DW_AT_decl_line   : 850
    <caa>   DW_AT_type        : <0xe79>
    <cae>   DW_AT_data_member_location: 16
 <2><caf>: Abbrev Number: 0
 <1><cb0>: Abbrev Number: 4 (DW_TAG_typedef)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x23dc): UML_Enumeration
    <cb5>   DW_AT_decl_file   : 6
    <cb6>   DW_AT_decl_line   : 192
    <cb7>   DW_AT_type        : <0xcbb>
 <1><cbb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x23dc): UML_Enumeration
    <cc0>   DW_AT_byte_size   : 16
    <cc1>   DW_AT_decl_file   : 6
    <cc2>   DW_AT_decl_line   : 860
    <cc4>   DW_AT_sibling     : <0xcfd>
 <2><cc8>: Abbrev Number: 11 (DW_TAG_member)
    <cc9>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <ccd>   DW_AT_decl_file   : 6
    <cce>   DW_AT_decl_line   : 861
    <cd0>   DW_AT_type        : <0x21d>
    <cd4>   DW_AT_data_member_location: 0
 <2><cd5>: Abbrev Number: 11 (DW_TAG_member)
    <cd6>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <cda>   DW_AT_decl_file   : 6
    <cdb>   DW_AT_decl_line   : 862
    <cdd>   DW_AT_type        : <0x36b>
    <ce1>   DW_AT_data_member_location: 4
 <2><ce2>: Abbrev Number: 11 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <ce7>   DW_AT_decl_file   : 6
    <ce8>   DW_AT_decl_line   : 862
    <cea>   DW_AT_type        : <0xb6>
    <cee>   DW_AT_data_member_location: 8
 <2><cef>: Abbrev Number: 11 (DW_TAG_member)
    <cf0>   DW_AT_name        : (indirect string, offset: 0xc5f4): ownedLiteral
    <cf4>   DW_AT_decl_file   : 6
    <cf5>   DW_AT_decl_line   : 863
    <cf7>   DW_AT_type        : <0xeda>
    <cfb>   DW_AT_data_member_location: 12
 <2><cfc>: Abbrev Number: 0
 <1><cfd>: Abbrev Number: 4 (DW_TAG_typedef)
    <cfe>   DW_AT_name        : (indirect string, offset: 0xafd8): UML_Port
    <d02>   DW_AT_decl_file   : 6
    <d03>   DW_AT_decl_line   : 193
    <d04>   DW_AT_type        : <0xd08>
 <1><d08>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d09>   DW_AT_name        : (indirect string, offset: 0xafd8): UML_Port
    <d0d>   DW_AT_byte_size   : 52
    <d0e>   DW_AT_decl_file   : 6
    <d0f>   DW_AT_decl_line   : 873
    <d11>   DW_AT_sibling     : <0xdcc>
 <2><d15>: Abbrev Number: 11 (DW_TAG_member)
    <d16>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <d1a>   DW_AT_decl_file   : 6
    <d1b>   DW_AT_decl_line   : 874
    <d1d>   DW_AT_type        : <0x21d>
    <d21>   DW_AT_data_member_location: 0
 <2><d22>: Abbrev Number: 11 (DW_TAG_member)
    <d23>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <d27>   DW_AT_decl_file   : 6
    <d28>   DW_AT_decl_line   : 875
    <d2a>   DW_AT_type        : <0x36b>
    <d2e>   DW_AT_data_member_location: 4
 <2><d2f>: Abbrev Number: 11 (DW_TAG_member)
    <d30>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <d34>   DW_AT_decl_file   : 6
    <d35>   DW_AT_decl_line   : 875
    <d37>   DW_AT_type        : <0xb6>
    <d3b>   DW_AT_data_member_location: 8
 <2><d3c>: Abbrev Number: 11 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x17f2): association
    <d41>   DW_AT_decl_file   : 6
    <d42>   DW_AT_decl_line   : 876
    <d44>   DW_AT_type        : <0xe43>
    <d48>   DW_AT_data_member_location: 12
 <2><d49>: Abbrev Number: 11 (DW_TAG_member)
    <d4a>   DW_AT_name        : (indirect string, offset: 0xf196): aggregation
    <d4e>   DW_AT_decl_file   : 6
    <d4f>   DW_AT_decl_line   : 876
    <d51>   DW_AT_type        : <0x3f7>
    <d55>   DW_AT_data_member_location: 16
 <2><d56>: Abbrev Number: 11 (DW_TAG_member)
    <d57>   DW_AT_name        : (indirect string, offset: 0x4c5c): class
    <d5b>   DW_AT_decl_file   : 6
    <d5c>   DW_AT_decl_line   : 876
    <d5e>   DW_AT_type        : <0xe37>
    <d62>   DW_AT_data_member_location: 20
 <2><d63>: Abbrev Number: 11 (DW_TAG_member)
    <d64>   DW_AT_name        : (indirect string, offset: 0x3fd5): type
    <d68>   DW_AT_decl_file   : 6
    <d69>   DW_AT_decl_line   : 877
    <d6b>   DW_AT_type        : <0xe37>
    <d6f>   DW_AT_data_member_location: 24
 <2><d70>: Abbrev Number: 12 (DW_TAG_member)
    <d71>   DW_AT_name        : end
    <d75>   DW_AT_decl_file   : 6
    <d76>   DW_AT_decl_line   : 878
    <d78>   DW_AT_type        : <0xe55>
    <d7c>   DW_AT_data_member_location: 28
 <2><d7d>: Abbrev Number: 11 (DW_TAG_member)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x75ef): lower
    <d82>   DW_AT_decl_file   : 6
    <d83>   DW_AT_decl_line   : 879
    <d85>   DW_AT_type        : <0x2c>
    <d89>   DW_AT_data_member_location: 32
 <2><d8a>: Abbrev Number: 11 (DW_TAG_member)
    <d8b>   DW_AT_name        : (indirect string, offset: 0xe603): c_index
    <d8f>   DW_AT_decl_file   : 6
    <d90>   DW_AT_decl_line   : 880
    <d92>   DW_AT_type        : <0x105>
    <d96>   DW_AT_data_member_location: 36
 <2><d97>: Abbrev Number: 11 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0xbad0): isConjugated
    <d9c>   DW_AT_decl_file   : 6
    <d9d>   DW_AT_decl_line   : 880
    <d9f>   DW_AT_type        : <0xecd>
    <da3>   DW_AT_data_member_location: 37
 <2><da4>: Abbrev Number: 11 (DW_TAG_member)
    <da5>   DW_AT_name        : (indirect string, offset: 0x929): provided
    <da9>   DW_AT_decl_file   : 6
    <daa>   DW_AT_decl_line   : 880
    <dac>   DW_AT_type        : <0xee6>
    <db0>   DW_AT_data_member_location: 40
 <2><db1>: Abbrev Number: 11 (DW_TAG_member)
    <db2>   DW_AT_name        : (indirect string, offset: 0xd147): isBehavior
    <db6>   DW_AT_decl_file   : 6
    <db7>   DW_AT_decl_line   : 880
    <db9>   DW_AT_type        : <0xecd>
    <dbd>   DW_AT_data_member_location: 44
 <2><dbe>: Abbrev Number: 11 (DW_TAG_member)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x5c91): required
    <dc3>   DW_AT_decl_file   : 6
    <dc4>   DW_AT_decl_line   : 880
    <dc6>   DW_AT_type        : <0xee6>
    <dca>   DW_AT_data_member_location: 48
 <2><dcb>: Abbrev Number: 0
 <1><dcc>: Abbrev Number: 4 (DW_TAG_typedef)
    <dcd>   DW_AT_name        : (indirect string, offset: 0xadfa): UML_EnumerationLiteral
    <dd1>   DW_AT_decl_file   : 6
    <dd2>   DW_AT_decl_line   : 194
    <dd3>   DW_AT_type        : <0xdd7>
 <1><dd7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <dd8>   DW_AT_name        : (indirect string, offset: 0xadfa): UML_EnumerationLiteral
    <ddc>   DW_AT_byte_size   : 16
    <ddd>   DW_AT_decl_file   : 6
    <dde>   DW_AT_decl_line   : 890
    <de0>   DW_AT_sibling     : <0xe19>
 <2><de4>: Abbrev Number: 11 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0xa228): c_type
    <de9>   DW_AT_decl_file   : 6
    <dea>   DW_AT_decl_line   : 891
    <dec>   DW_AT_type        : <0x21d>
    <df0>   DW_AT_data_member_location: 0
 <2><df1>: Abbrev Number: 11 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x380d): visibility
    <df6>   DW_AT_decl_file   : 6
    <df7>   DW_AT_decl_line   : 892
    <df9>   DW_AT_type        : <0x36b>
    <dfd>   DW_AT_data_member_location: 4
 <2><dfe>: Abbrev Number: 11 (DW_TAG_member)
    <dff>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <e03>   DW_AT_decl_file   : 6
    <e04>   DW_AT_decl_line   : 892
    <e06>   DW_AT_type        : <0xb6>
    <e0a>   DW_AT_data_member_location: 8
 <2><e0b>: Abbrev Number: 11 (DW_TAG_member)
    <e0c>   DW_AT_name        : (indirect string, offset: 0xe603): c_index
    <e10>   DW_AT_decl_file   : 6
    <e11>   DW_AT_decl_line   : 893
    <e13>   DW_AT_type        : <0x105>
    <e17>   DW_AT_data_member_location: 12
 <2><e18>: Abbrev Number: 0
 <1><e19>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e1a>   DW_AT_byte_size   : 4
    <e1b>   DW_AT_type        : <0xe1f>
 <1><e1f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e20>   DW_AT_byte_size   : 4
    <e21>   DW_AT_type        : <0xb54>
 <1><e25>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e26>   DW_AT_byte_size   : 4
    <e27>   DW_AT_type        : <0xe2b>
 <1><e2b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e2c>   DW_AT_byte_size   : 4
    <e2d>   DW_AT_type        : <0x4bf>
 <1><e31>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e32>   DW_AT_byte_size   : 4
    <e33>   DW_AT_type        : <0xe37>
 <1><e37>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e38>   DW_AT_byte_size   : 4
    <e39>   DW_AT_type        : <0xba1>
 <1><e3d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e3e>   DW_AT_byte_size   : 4
    <e3f>   DW_AT_type        : <0xe43>
 <1><e43>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e44>   DW_AT_byte_size   : 4
    <e45>   DW_AT_type        : <0x79c>
 <1><e49>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e4a>   DW_AT_byte_size   : 4
    <e4b>   DW_AT_type        : <0x803>
 <1><e4f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e50>   DW_AT_byte_size   : 4
    <e51>   DW_AT_type        : <0x829>
 <1><e55>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e56>   DW_AT_byte_size   : 4
    <e57>   DW_AT_type        : <0x472>
 <1><e5b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e5c>   DW_AT_byte_size   : 4
    <e5d>   DW_AT_type        : <0x60d>
 <1><e61>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e62>   DW_AT_byte_size   : 4
    <e63>   DW_AT_type        : <0xb6>
 <1><e67>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e68>   DW_AT_byte_size   : 4
    <e69>   DW_AT_type        : <0xe4f>
 <1><e6d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e6e>   DW_AT_byte_size   : 4
    <e6f>   DW_AT_type        : <0xe73>
 <1><e73>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e74>   DW_AT_byte_size   : 4
    <e75>   DW_AT_type        : <0x674>
 <1><e79>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e7a>   DW_AT_byte_size   : 4
    <e7b>   DW_AT_type        : <0xe7f>
 <1><e7f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e80>   DW_AT_byte_size   : 4
    <e81>   DW_AT_type        : <0x8aa>
 <1><e85>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e86>   DW_AT_byte_size   : 4
    <e87>   DW_AT_type        : <0x425>
 <1><e8b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e8c>   DW_AT_byte_size   : 4
    <e8d>   DW_AT_type        : <0x9c5>
 <1><e91>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e92>   DW_AT_byte_size   : 4
    <e93>   DW_AT_type        : <0xafa>
 <1><e97>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e98>   DW_AT_byte_size   : 4
    <e99>   DW_AT_type        : <0x735>
 <1><e9d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e9e>   DW_AT_byte_size   : 4
    <e9f>   DW_AT_type        : <0xea3>
 <1><ea3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ea4>   DW_AT_byte_size   : 4
    <ea5>   DW_AT_type        : <0x519>
 <1><ea9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <eaa>   DW_AT_byte_size   : 4
    <eab>   DW_AT_type        : <0xeaf>
 <1><eaf>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <eb0>   DW_AT_byte_size   : 4
    <eb1>   DW_AT_type        : <0xc56>
 <1><eb5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <eb6>   DW_AT_byte_size   : 4
    <eb7>   DW_AT_type        : <0xebb>
 <1><ebb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ebc>   DW_AT_byte_size   : 4
    <ebd>   DW_AT_type        : <0xcfd>
 <1><ec1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ec2>   DW_AT_byte_size   : 4
    <ec3>   DW_AT_type        : <0xec7>
 <1><ec7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ec8>   DW_AT_byte_size   : 4
    <ec9>   DW_AT_type        : <0x573>
 <1><ecd>: Abbrev Number: 2 (DW_TAG_base_type)
    <ece>   DW_AT_byte_size   : 1
    <ecf>   DW_AT_encoding    : 2	(boolean)
    <ed0>   DW_AT_name        : (indirect string, offset: 0x8b1): _Bool
 <1><ed4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ed5>   DW_AT_byte_size   : 4
    <ed6>   DW_AT_type        : <0xe97>
 <1><eda>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <edb>   DW_AT_byte_size   : 4
    <edc>   DW_AT_type        : <0xee0>
 <1><ee0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ee1>   DW_AT_byte_size   : 4
    <ee2>   DW_AT_type        : <0xdcc>
 <1><ee6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ee7>   DW_AT_byte_size   : 4
    <ee8>   DW_AT_type        : <0xe5b>
 <1><eec>: Abbrev Number: 4 (DW_TAG_typedef)
    <eed>   DW_AT_name        : (indirect string, offset: 0xf791): Fifo
    <ef1>   DW_AT_decl_file   : 7
    <ef2>   DW_AT_decl_line   : 16
    <ef3>   DW_AT_type        : <0xef7>
 <1><ef7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ef8>   DW_AT_name        : (indirect string, offset: 0xf791): Fifo
    <efc>   DW_AT_byte_size   : 24
    <efd>   DW_AT_decl_file   : 7
    <efe>   DW_AT_decl_line   : 19
    <eff>   DW_AT_sibling     : <0xf57>
 <2><f03>: Abbrev Number: 14 (DW_TAG_member)
    <f04>   DW_AT_name        : (indirect string, offset: 0xdfaa): data
    <f08>   DW_AT_decl_file   : 7
    <f09>   DW_AT_decl_line   : 20
    <f0a>   DW_AT_type        : <0xf57>
    <f0e>   DW_AT_data_member_location: 0
 <2><f0f>: Abbrev Number: 14 (DW_TAG_member)
    <f10>   DW_AT_name        : (indirect string, offset: 0x7401): nb_layers
    <f14>   DW_AT_decl_file   : 7
    <f15>   DW_AT_decl_line   : 21
    <f16>   DW_AT_type        : <0xce>
    <f1a>   DW_AT_data_member_location: 4
 <2><f1b>: Abbrev Number: 14 (DW_TAG_member)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x8d1a): element_size
    <f20>   DW_AT_decl_file   : 7
    <f21>   DW_AT_decl_line   : 22
    <f22>   DW_AT_type        : <0xf5d>
    <f26>   DW_AT_data_member_location: 8
 <2><f27>: Abbrev Number: 15 (DW_TAG_member)
    <f28>   DW_AT_name        : nb
    <f2b>   DW_AT_decl_file   : 7
    <f2c>   DW_AT_decl_line   : 23
    <f2d>   DW_AT_type        : <0xf63>
    <f31>   DW_AT_data_member_location: 12
 <2><f32>: Abbrev Number: 14 (DW_TAG_member)
    <f33>   DW_AT_name        : (indirect string, offset: 0x5ff9): size
    <f37>   DW_AT_decl_file   : 7
    <f38>   DW_AT_decl_line   : 24
    <f39>   DW_AT_type        : <0x173>
    <f3d>   DW_AT_data_member_location: 16
 <2><f3e>: Abbrev Number: 14 (DW_TAG_member)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x69d6): writing
    <f43>   DW_AT_decl_file   : 7
    <f44>   DW_AT_decl_line   : 25
    <f45>   DW_AT_type        : <0x173>
    <f49>   DW_AT_data_member_location: 17
 <2><f4a>: Abbrev Number: 14 (DW_TAG_member)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xd7f7): reorganize_buffer
    <f4f>   DW_AT_decl_file   : 7
    <f50>   DW_AT_decl_line   : 26
    <f51>   DW_AT_type        : <0xb4>
    <f55>   DW_AT_data_member_location: 20
 <2><f56>: Abbrev Number: 0
 <1><f57>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f58>   DW_AT_byte_size   : 4
    <f59>   DW_AT_type        : <0xb4>
 <1><f5d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f5e>   DW_AT_byte_size   : 4
    <f5f>   DW_AT_type        : <0xef>
 <1><f63>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f64>   DW_AT_byte_size   : 4
    <f65>   DW_AT_type        : <0x173>
 <1><f69>: Abbrev Number: 4 (DW_TAG_typedef)
    <f6a>   DW_AT_name        : (indirect string, offset: 0x7261): EventPool
    <f6e>   DW_AT_decl_file   : 8
    <f6f>   DW_AT_decl_line   : 21
    <f70>   DW_AT_type        : <0xf74>
 <1><f74>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f75>   DW_AT_name        : (indirect string, offset: 0x7261): EventPool
    <f79>   DW_AT_byte_size   : 40
    <f7a>   DW_AT_decl_file   : 8
    <f7b>   DW_AT_decl_line   : 100
    <f7c>   DW_AT_sibling     : <0xf99>
 <2><f80>: Abbrev Number: 14 (DW_TAG_member)
    <f81>   DW_AT_name        : (indirect string, offset: 0x58f7): fifo
    <f85>   DW_AT_decl_file   : 8
    <f86>   DW_AT_decl_line   : 101
    <f87>   DW_AT_type        : <0xeec>
    <f8b>   DW_AT_data_member_location: 0
 <2><f8c>: Abbrev Number: 14 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x90ef): meta
    <f91>   DW_AT_decl_file   : 8
    <f92>   DW_AT_decl_line   : 102
    <f93>   DW_AT_type        : <0xfc9>
    <f97>   DW_AT_data_member_location: 24
 <2><f98>: Abbrev Number: 0
 <1><f99>: Abbrev Number: 4 (DW_TAG_typedef)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x13b2): EventPoolStore
    <f9e>   DW_AT_decl_file   : 8
    <f9f>   DW_AT_decl_line   : 22
    <fa0>   DW_AT_type        : <0xfa4>
 <1><fa4>: Abbrev Number: 13 (DW_TAG_structure_type)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x13b2): EventPoolStore
    <fa9>   DW_AT_byte_size   : 9
    <faa>   DW_AT_decl_file   : 8
    <fab>   DW_AT_decl_line   : 73
    <fac>   DW_AT_sibling     : <0xfc9>
 <2><fb0>: Abbrev Number: 14 (DW_TAG_member)
    <fb1>   DW_AT_name        : (indirect string, offset: 0x103fb): nbEvents
    <fb5>   DW_AT_decl_file   : 8
    <fb6>   DW_AT_decl_line   : 74
    <fb7>   DW_AT_type        : <0x189>
    <fbb>   DW_AT_data_member_location: 0
 <2><fbc>: Abbrev Number: 14 (DW_TAG_member)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x668e): eventOccurred
    <fc1>   DW_AT_decl_file   : 8
    <fc2>   DW_AT_decl_line   : 75
    <fc3>   DW_AT_type        : <0x1041>
    <fc7>   DW_AT_data_member_location: 1
 <2><fc8>: Abbrev Number: 0
 <1><fc9>: Abbrev Number: 4 (DW_TAG_typedef)
    <fca>   DW_AT_name        : (indirect string, offset: 0x4b8e): EventPoolMeta
    <fce>   DW_AT_decl_file   : 8
    <fcf>   DW_AT_decl_line   : 23
    <fd0>   DW_AT_type        : <0xfd4>
 <1><fd4>: Abbrev Number: 13 (DW_TAG_structure_type)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x4b8e): EventPoolMeta
    <fd9>   DW_AT_byte_size   : 16
    <fda>   DW_AT_decl_file   : 8
    <fdb>   DW_AT_decl_line   : 83
    <fdc>   DW_AT_sibling     : <0x1011>
 <2><fe0>: Abbrev Number: 14 (DW_TAG_member)
    <fe1>   DW_AT_name        : (indirect string, offset: 0x11e07): eventSetSize
    <fe5>   DW_AT_decl_file   : 8
    <fe6>   DW_AT_decl_line   : 84
    <fe7>   DW_AT_type        : <0x194>
    <feb>   DW_AT_data_member_location: 0
 <2><fec>: Abbrev Number: 14 (DW_TAG_member)
    <fed>   DW_AT_name        : (indirect string, offset: 0x3cb2): eventSet
    <ff1>   DW_AT_decl_file   : 8
    <ff2>   DW_AT_decl_line   : 85
    <ff3>   DW_AT_type        : <0xe19>
    <ff7>   DW_AT_data_member_location: 4
 <2><ff8>: Abbrev Number: 14 (DW_TAG_member)
    <ff9>   DW_AT_name        : (indirect string, offset: 0xba3f): paramsSize
    <ffd>   DW_AT_decl_file   : 8
    <ffe>   DW_AT_decl_line   : 86
    <fff>   DW_AT_type        : <0xef>
    <1003>   DW_AT_data_member_location: 8
 <2><1004>: Abbrev Number: 14 (DW_TAG_member)
    <1005>   DW_AT_name        : (indirect string, offset: 0x4f72): nbDeferred
    <1009>   DW_AT_decl_file   : 8
    <100a>   DW_AT_decl_line   : 87
    <100b>   DW_AT_type        : <0x189>
    <100f>   DW_AT_data_member_location: 12
 <2><1010>: Abbrev Number: 0
 <1><1011>: Abbrev Number: 4 (DW_TAG_typedef)
    <1012>   DW_AT_name        : (indirect string, offset: 0x2092): EventId
    <1016>   DW_AT_decl_file   : 8
    <1017>   DW_AT_decl_line   : 24
    <1018>   DW_AT_type        : <0x101c>
 <1><101c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <101d>   DW_AT_name        : (indirect string, offset: 0x2092): EventId
    <1021>   DW_AT_byte_size   : 2
    <1022>   DW_AT_decl_file   : 8
    <1023>   DW_AT_decl_line   : 44
    <1024>   DW_AT_sibling     : <0x1041>
 <2><1028>: Abbrev Number: 14 (DW_TAG_member)
    <1029>   DW_AT_name        : (indirect string, offset: 0x10a8f): signalEventId
    <102d>   DW_AT_decl_file   : 8
    <102e>   DW_AT_decl_line   : 45
    <102f>   DW_AT_type        : <0x110>
    <1033>   DW_AT_data_member_location: 0
 <2><1034>: Abbrev Number: 14 (DW_TAG_member)
    <1035>   DW_AT_name        : (indirect string, offset: 0x1248): portId
    <1039>   DW_AT_decl_file   : 8
    <103a>   DW_AT_decl_line   : 47
    <103b>   DW_AT_type        : <0x11b>
    <103f>   DW_AT_data_member_location: 1
 <2><1040>: Abbrev Number: 0
 <1><1041>: Abbrev Number: 16 (DW_TAG_array_type)
    <1042>   DW_AT_type        : <0x1011>
    <1046>   DW_AT_sibling     : <0x1051>
 <2><104a>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <104b>   DW_AT_type        : <0xad>
    <104f>   DW_AT_upper_bound : 3
 <2><1050>: Abbrev Number: 0
 <1><1051>: Abbrev Number: 4 (DW_TAG_typedef)
    <1052>   DW_AT_name        : (indirect string, offset: 0xd422): ClassInfo
    <1056>   DW_AT_decl_file   : 9
    <1057>   DW_AT_decl_line   : 20
    <1058>   DW_AT_type        : <0x105c>
 <1><105c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <105d>   DW_AT_name        : (indirect string, offset: 0xd422): ClassInfo
    <1061>   DW_AT_byte_size   : 4
    <1062>   DW_AT_decl_file   : 9
    <1063>   DW_AT_decl_line   : 28
    <1064>   DW_AT_sibling     : <0x1075>
 <2><1068>: Abbrev Number: 14 (DW_TAG_member)
    <1069>   DW_AT_name        : (indirect string, offset: 0x3fd5): type
    <106d>   DW_AT_decl_file   : 9
    <106e>   DW_AT_decl_line   : 29
    <106f>   DW_AT_type        : <0xe37>
    <1073>   DW_AT_data_member_location: 0
 <2><1074>: Abbrev Number: 0
 <1><1075>: Abbrev Number: 4 (DW_TAG_typedef)
    <1076>   DW_AT_name        : (indirect string, offset: 0x4355): Object
    <107a>   DW_AT_decl_file   : 9
    <107b>   DW_AT_decl_line   : 21
    <107c>   DW_AT_type        : <0x1080>
 <1><1080>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1081>   DW_AT_name        : (indirect string, offset: 0x4355): Object
    <1085>   DW_AT_byte_size   : 32
    <1086>   DW_AT_decl_file   : 9
    <1087>   DW_AT_decl_line   : 76
    <1088>   DW_AT_sibling     : <0x10ed>
 <2><108c>: Abbrev Number: 14 (DW_TAG_member)
    <108d>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <1091>   DW_AT_decl_file   : 9
    <1092>   DW_AT_decl_line   : 77
    <1093>   DW_AT_type        : <0xb6>
    <1097>   DW_AT_data_member_location: 0
 <2><1098>: Abbrev Number: 14 (DW_TAG_member)
    <1099>   DW_AT_name        : (indirect string, offset: 0xf0c0): classInfo
    <109d>   DW_AT_decl_file   : 9
    <109e>   DW_AT_decl_line   : 77
    <109f>   DW_AT_type        : <0x10ed>
    <10a3>   DW_AT_data_member_location: 4
 <2><10a4>: Abbrev Number: 14 (DW_TAG_member)
    <10a5>   DW_AT_name        : (indirect string, offset: 0x9c44): part
    <10a9>   DW_AT_decl_file   : 9
    <10aa>   DW_AT_decl_line   : 77
    <10ab>   DW_AT_type        : <0xe4f>
    <10af>   DW_AT_data_member_location: 8
 <2><10b0>: Abbrev Number: 14 (DW_TAG_member)
    <10b1>   DW_AT_name        : (indirect string, offset: 0x7172): properties_ro
    <10b5>   DW_AT_decl_file   : 9
    <10b6>   DW_AT_decl_line   : 77
    <10b7>   DW_AT_type        : <0xb4>
    <10bb>   DW_AT_data_member_location: 12
 <2><10bc>: Abbrev Number: 14 (DW_TAG_member)
    <10bd>   DW_AT_name        : (indirect string, offset: 0x8e75): nb_properties_ro
    <10c1>   DW_AT_decl_file   : 9
    <10c2>   DW_AT_decl_line   : 77
    <10c3>   DW_AT_type        : <0x168>
    <10c7>   DW_AT_data_member_location: 16
 <2><10c8>: Abbrev Number: 14 (DW_TAG_member)
    <10c9>   DW_AT_name        : (indirect string, offset: 0xfce3): store
    <10cd>   DW_AT_decl_file   : 9
    <10ce>   DW_AT_decl_line   : 77
    <10cf>   DW_AT_type        : <0xb4>
    <10d3>   DW_AT_data_member_location: 20
 <2><10d4>: Abbrev Number: 14 (DW_TAG_member)
    <10d5>   DW_AT_name        : (indirect string, offset: 0xa441): operations
    <10d9>   DW_AT_decl_file   : 9
    <10da>   DW_AT_decl_line   : 77
    <10db>   DW_AT_type        : <0xb4>
    <10df>   DW_AT_data_member_location: 24
 <2><10e0>: Abbrev Number: 14 (DW_TAG_member)
    <10e1>   DW_AT_name        : (indirect string, offset: 0x2aab): multiplicity_id
    <10e5>   DW_AT_decl_file   : 9
    <10e6>   DW_AT_decl_line   : 77
    <10e7>   DW_AT_type        : <0x17e>
    <10eb>   DW_AT_data_member_location: 28
 <2><10ec>: Abbrev Number: 0
 <1><10ed>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10ee>   DW_AT_byte_size   : 4
    <10ef>   DW_AT_type        : <0x1051>
 <1><10f3>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f4>   DW_AT_name        : (indirect string, offset: 0x1c26): PassiveObject
    <10f8>   DW_AT_decl_file   : 10
    <10f9>   DW_AT_decl_line   : 19
    <10fa>   DW_AT_type        : <0x10fe>
 <1><10fe>: Abbrev Number: 13 (DW_TAG_structure_type)
    <10ff>   DW_AT_name        : (indirect string, offset: 0x1c26): PassiveObject
    <1103>   DW_AT_byte_size   : 44
    <1104>   DW_AT_decl_file   : 10
    <1105>   DW_AT_decl_line   : 39
    <1106>   DW_AT_sibling     : <0x118f>
 <2><110a>: Abbrev Number: 14 (DW_TAG_member)
    <110b>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <110f>   DW_AT_decl_file   : 10
    <1110>   DW_AT_decl_line   : 40
    <1111>   DW_AT_type        : <0xb6>
    <1115>   DW_AT_data_member_location: 0
 <2><1116>: Abbrev Number: 14 (DW_TAG_member)
    <1117>   DW_AT_name        : (indirect string, offset: 0xf0c0): classInfo
    <111b>   DW_AT_decl_file   : 10
    <111c>   DW_AT_decl_line   : 40
    <111d>   DW_AT_type        : <0x10ed>
    <1121>   DW_AT_data_member_location: 4
 <2><1122>: Abbrev Number: 14 (DW_TAG_member)
    <1123>   DW_AT_name        : (indirect string, offset: 0x9c44): part
    <1127>   DW_AT_decl_file   : 10
    <1128>   DW_AT_decl_line   : 40
    <1129>   DW_AT_type        : <0xe4f>
    <112d>   DW_AT_data_member_location: 8
 <2><112e>: Abbrev Number: 14 (DW_TAG_member)
    <112f>   DW_AT_name        : (indirect string, offset: 0x7172): properties_ro
    <1133>   DW_AT_decl_file   : 10
    <1134>   DW_AT_decl_line   : 40
    <1135>   DW_AT_type        : <0xb4>
    <1139>   DW_AT_data_member_location: 12
 <2><113a>: Abbrev Number: 14 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0x8e75): nb_properties_ro
    <113f>   DW_AT_decl_file   : 10
    <1140>   DW_AT_decl_line   : 40
    <1141>   DW_AT_type        : <0x168>
    <1145>   DW_AT_data_member_location: 16
 <2><1146>: Abbrev Number: 14 (DW_TAG_member)
    <1147>   DW_AT_name        : (indirect string, offset: 0xfce3): store
    <114b>   DW_AT_decl_file   : 10
    <114c>   DW_AT_decl_line   : 40
    <114d>   DW_AT_type        : <0xb4>
    <1151>   DW_AT_data_member_location: 20
 <2><1152>: Abbrev Number: 14 (DW_TAG_member)
    <1153>   DW_AT_name        : (indirect string, offset: 0xa441): operations
    <1157>   DW_AT_decl_file   : 10
    <1158>   DW_AT_decl_line   : 40
    <1159>   DW_AT_type        : <0xb4>
    <115d>   DW_AT_data_member_location: 24
 <2><115e>: Abbrev Number: 14 (DW_TAG_member)
    <115f>   DW_AT_name        : (indirect string, offset: 0x2aab): multiplicity_id
    <1163>   DW_AT_decl_file   : 10
    <1164>   DW_AT_decl_line   : 40
    <1165>   DW_AT_type        : <0x17e>
    <1169>   DW_AT_data_member_location: 28
 <2><116a>: Abbrev Number: 14 (DW_TAG_member)
    <116b>   DW_AT_name        : (indirect string, offset: 0x75d9): instance
    <116f>   DW_AT_decl_file   : 10
    <1170>   DW_AT_decl_line   : 40
    <1171>   DW_AT_type        : <0xb4>
    <1175>   DW_AT_data_member_location: 32
 <2><1176>: Abbrev Number: 14 (DW_TAG_member)
    <1177>   DW_AT_name        : (indirect string, offset: 0x2a86): instanceSize
    <117b>   DW_AT_decl_file   : 10
    <117c>   DW_AT_decl_line   : 40
    <117d>   DW_AT_type        : <0xef>
    <1181>   DW_AT_data_member_location: 36
 <2><1182>: Abbrev Number: 14 (DW_TAG_member)
    <1183>   DW_AT_name        : (indirect string, offset: 0x71f5): properties_rw
    <1187>   DW_AT_decl_file   : 10
    <1188>   DW_AT_decl_line   : 40
    <1189>   DW_AT_type        : <0xb4>
    <118d>   DW_AT_data_member_location: 40
 <2><118e>: Abbrev Number: 0
 <1><118f>: Abbrev Number: 4 (DW_TAG_typedef)
    <1190>   DW_AT_name        : (indirect string, offset: 0x209a): ActiveObject
    <1194>   DW_AT_decl_file   : 11
    <1195>   DW_AT_decl_line   : 24
    <1196>   DW_AT_type        : <0x119a>
 <1><119a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <119b>   DW_AT_name        : (indirect string, offset: 0x209a): ActiveObject
    <119f>   DW_AT_byte_size   : 80
    <11a0>   DW_AT_decl_file   : 11
    <11a1>   DW_AT_decl_line   : 66
    <11a2>   DW_AT_sibling     : <0x12bb>
 <2><11a6>: Abbrev Number: 14 (DW_TAG_member)
    <11a7>   DW_AT_name        : (indirect string, offset: 0x8c1d): name
    <11ab>   DW_AT_decl_file   : 11
    <11ac>   DW_AT_decl_line   : 67
    <11ad>   DW_AT_type        : <0xb6>
    <11b1>   DW_AT_data_member_location: 0
 <2><11b2>: Abbrev Number: 14 (DW_TAG_member)
    <11b3>   DW_AT_name        : (indirect string, offset: 0xf0c0): classInfo
    <11b7>   DW_AT_decl_file   : 11
    <11b8>   DW_AT_decl_line   : 67
    <11b9>   DW_AT_type        : <0x10ed>
    <11bd>   DW_AT_data_member_location: 4
 <2><11be>: Abbrev Number: 14 (DW_TAG_member)
    <11bf>   DW_AT_name        : (indirect string, offset: 0x9c44): part
    <11c3>   DW_AT_decl_file   : 11
    <11c4>   DW_AT_decl_line   : 67
    <11c5>   DW_AT_type        : <0xe4f>
    <11c9>   DW_AT_data_member_location: 8
 <2><11ca>: Abbrev Number: 14 (DW_TAG_member)
    <11cb>   DW_AT_name        : (indirect string, offset: 0x7172): properties_ro
    <11cf>   DW_AT_decl_file   : 11
    <11d0>   DW_AT_decl_line   : 67
    <11d1>   DW_AT_type        : <0xb4>
    <11d5>   DW_AT_data_member_location: 12
 <2><11d6>: Abbrev Number: 14 (DW_TAG_member)
    <11d7>   DW_AT_name        : (indirect string, offset: 0x8e75): nb_properties_ro
    <11db>   DW_AT_decl_file   : 11
    <11dc>   DW_AT_decl_line   : 67
    <11dd>   DW_AT_type        : <0x168>
    <11e1>   DW_AT_data_member_location: 16
 <2><11e2>: Abbrev Number: 14 (DW_TAG_member)
    <11e3>   DW_AT_name        : (indirect string, offset: 0xfce3): store
    <11e7>   DW_AT_decl_file   : 11
    <11e8>   DW_AT_decl_line   : 67
    <11e9>   DW_AT_type        : <0xb4>
    <11ed>   DW_AT_data_member_location: 20
 <2><11ee>: Abbrev Number: 14 (DW_TAG_member)
    <11ef>   DW_AT_name        : (indirect string, offset: 0xa441): operations
    <11f3>   DW_AT_decl_file   : 11
    <11f4>   DW_AT_decl_line   : 67
    <11f5>   DW_AT_type        : <0xb4>
    <11f9>   DW_AT_data_member_location: 24
 <2><11fa>: Abbrev Number: 14 (DW_TAG_member)
    <11fb>   DW_AT_name        : (indirect string, offset: 0x2aab): multiplicity_id
    <11ff>   DW_AT_decl_file   : 11
    <1200>   DW_AT_decl_line   : 67
    <1201>   DW_AT_type        : <0x17e>
    <1205>   DW_AT_data_member_location: 28
 <2><1206>: Abbrev Number: 14 (DW_TAG_member)
    <1207>   DW_AT_name        : (indirect string, offset: 0x75d9): instance
    <120b>   DW_AT_decl_file   : 11
    <120c>   DW_AT_decl_line   : 67
    <120d>   DW_AT_type        : <0xb4>
    <1211>   DW_AT_data_member_location: 32
 <2><1212>: Abbrev Number: 14 (DW_TAG_member)
    <1213>   DW_AT_name        : (indirect string, offset: 0x2a86): instanceSize
    <1217>   DW_AT_decl_file   : 11
    <1218>   DW_AT_decl_line   : 67
    <1219>   DW_AT_type        : <0xef>
    <121d>   DW_AT_data_member_location: 36
 <2><121e>: Abbrev Number: 14 (DW_TAG_member)
    <121f>   DW_AT_name        : (indirect string, offset: 0x71f5): properties_rw
    <1223>   DW_AT_decl_file   : 11
    <1224>   DW_AT_decl_line   : 67
    <1225>   DW_AT_type        : <0xb4>
    <1229>   DW_AT_data_member_location: 40
 <2><122a>: Abbrev Number: 14 (DW_TAG_member)
    <122b>   DW_AT_name        : (indirect string, offset: 0xbf31): stateMachine
    <122f>   DW_AT_decl_file   : 11
    <1230>   DW_AT_decl_line   : 68
    <1231>   DW_AT_type        : <0x12bb>
    <1235>   DW_AT_data_member_location: 44
 <2><1236>: Abbrev Number: 14 (DW_TAG_member)
    <1237>   DW_AT_name        : (indirect string, offset: 0xce6f): eventParamsSize
    <123b>   DW_AT_decl_file   : 11
    <123c>   DW_AT_decl_line   : 69
    <123d>   DW_AT_type        : <0xef>
    <1241>   DW_AT_data_member_location: 48
 <2><1242>: Abbrev Number: 14 (DW_TAG_member)
    <1243>   DW_AT_name        : (indirect string, offset: 0x89e6): eventPool
    <1247>   DW_AT_decl_file   : 11
    <1248>   DW_AT_decl_line   : 70
    <1249>   DW_AT_type        : <0x12c1>
    <124d>   DW_AT_data_member_location: 52
 <2><124e>: Abbrev Number: 14 (DW_TAG_member)
    <124f>   DW_AT_name        : (indirect string, offset: 0xd7f7): reorganize_buffer
    <1253>   DW_AT_decl_file   : 11
    <1254>   DW_AT_decl_line   : 71
    <1255>   DW_AT_type        : <0xb4>
    <1259>   DW_AT_data_member_location: 56
 <2><125a>: Abbrev Number: 14 (DW_TAG_member)
    <125b>   DW_AT_name        : (indirect string, offset: 0x124f): fireables
    <125f>   DW_AT_decl_file   : 11
    <1260>   DW_AT_decl_line   : 72
    <1261>   DW_AT_type        : <0x12c7>
    <1265>   DW_AT_data_member_location: 60
 <2><1266>: Abbrev Number: 14 (DW_TAG_member)
    <1267>   DW_AT_name        : (indirect string, offset: 0x6de): nbFireables
    <126b>   DW_AT_decl_file   : 11
    <126c>   DW_AT_decl_line   : 73
    <126d>   DW_AT_type        : <0x13c>
    <1271>   DW_AT_data_member_location: 64
 <2><1272>: Abbrev Number: 14 (DW_TAG_member)
    <1273>   DW_AT_name        : (indirect string, offset: 0x7d10): maxOutgoings
    <1277>   DW_AT_decl_file   : 11
    <1278>   DW_AT_decl_line   : 74
    <1279>   DW_AT_type        : <0x147>
    <127d>   DW_AT_data_member_location: 65
 <2><127e>: Abbrev Number: 14 (DW_TAG_member)
    <127f>   DW_AT_name        : (indirect string, offset: 0xfb5a): fireablesMax
    <1283>   DW_AT_decl_file   : 11
    <1284>   DW_AT_decl_line   : 75
    <1285>   DW_AT_type        : <0x13c>
    <1289>   DW_AT_data_member_location: 66
 <2><128a>: Abbrev Number: 14 (DW_TAG_member)
    <128b>   DW_AT_name        : (indirect string, offset: 0x523a): fireablesLength
    <128f>   DW_AT_decl_file   : 11
    <1290>   DW_AT_decl_line   : 76
    <1291>   DW_AT_type        : <0x152>
    <1295>   DW_AT_data_member_location: 67
 <2><1296>: Abbrev Number: 14 (DW_TAG_member)
    <1297>   DW_AT_name        : (indirect string, offset: 0xedd2): store_cs
    <129b>   DW_AT_decl_file   : 11
    <129c>   DW_AT_decl_line   : 77
    <129d>   DW_AT_type        : <0xf5d>
    <12a1>   DW_AT_data_member_location: 68
 <2><12a2>: Abbrev Number: 14 (DW_TAG_member)
    <12a3>   DW_AT_name        : (indirect string, offset: 0x54a): store_ep_params
    <12a7>   DW_AT_decl_file   : 11
    <12a8>   DW_AT_decl_line   : 78
    <12a9>   DW_AT_type        : <0xb4>
    <12ad>   DW_AT_data_member_location: 72
 <2><12ae>: Abbrev Number: 14 (DW_TAG_member)
    <12af>   DW_AT_name        : (indirect string, offset: 0x7f3): in_environment
    <12b3>   DW_AT_decl_file   : 11
    <12b4>   DW_AT_decl_line   : 79
    <12b5>   DW_AT_type        : <0xecd>
    <12b9>   DW_AT_data_member_location: 76
 <2><12ba>: Abbrev Number: 0
 <1><12bb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <12bc>   DW_AT_byte_size   : 4
    <12bd>   DW_AT_type        : <0x978>
 <1><12c1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <12c2>   DW_AT_byte_size   : 4
    <12c3>   DW_AT_type        : <0xf69>
 <1><12c7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <12c8>   DW_AT_byte_size   : 4
    <12c9>   DW_AT_type        : <0x147>
 <1><12cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <12ce>   DW_AT_name        : (indirect string, offset: 0x5583): entranceDetection_signal_parameters
    <12d2>   DW_AT_decl_file   : 12
    <12d3>   DW_AT_decl_line   : 28
    <12d4>   DW_AT_type        : <0x12d8>
 <1><12d8>: Abbrev Number: 10 (DW_TAG_structure_type)
    <12d9>   DW_AT_name        : (indirect string, offset: 0x5583): entranceDetection_signal_parameters
    <12dd>   DW_AT_byte_size   : 4
    <12de>   DW_AT_decl_file   : 12
    <12df>   DW_AT_decl_line   : 358
    <12e1>   DW_AT_sibling     : <0x12f2>
 <2><12e5>: Abbrev Number: 12 (DW_TAG_member)
    <12e6>   DW_AT_name        : id
    <12e9>   DW_AT_decl_file   : 12
    <12ea>   DW_AT_decl_line   : 359
    <12ec>   DW_AT_type        : <0xe4>
    <12f0>   DW_AT_data_member_location: 0
 <2><12f1>: Abbrev Number: 0
 <1><12f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <12f3>   DW_AT_name        : (indirect string, offset: 0x4162): exitDetection_signal_parameters
    <12f7>   DW_AT_decl_file   : 12
    <12f8>   DW_AT_decl_line   : 29
    <12f9>   DW_AT_type        : <0x12fd>
 <1><12fd>: Abbrev Number: 10 (DW_TAG_structure_type)
    <12fe>   DW_AT_name        : (indirect string, offset: 0x4162): exitDetection_signal_parameters
    <1302>   DW_AT_byte_size   : 4
    <1303>   DW_AT_decl_file   : 12
    <1304>   DW_AT_decl_line   : 364
    <1306>   DW_AT_sibling     : <0x1317>
 <2><130a>: Abbrev Number: 12 (DW_TAG_member)
    <130b>   DW_AT_name        : id
    <130e>   DW_AT_decl_file   : 12
    <130f>   DW_AT_decl_line   : 365
    <1311>   DW_AT_type        : <0xe4>
    <1315>   DW_AT_data_member_location: 0
 <2><1316>: Abbrev Number: 0
 <1><1317>: Abbrev Number: 4 (DW_TAG_typedef)
    <1318>   DW_AT_name        : (indirect string, offset: 0x8bd5): switchOn_signal_parameters
    <131c>   DW_AT_decl_file   : 12
    <131d>   DW_AT_decl_line   : 30
    <131e>   DW_AT_type        : <0x1322>
 <1><1322>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1323>   DW_AT_name        : (indirect string, offset: 0x8bd5): switchOn_signal_parameters
    <1327>   DW_AT_byte_size   : 0
    <1328>   DW_AT_decl_file   : 12
    <1329>   DW_AT_decl_line   : 370
 <1><132b>: Abbrev Number: 4 (DW_TAG_typedef)
    <132c>   DW_AT_name        : (indirect string, offset: 0xfd81): switchOff_signal_parameters
    <1330>   DW_AT_decl_file   : 12
    <1331>   DW_AT_decl_line   : 31
    <1332>   DW_AT_type        : <0x1336>
 <1><1336>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1337>   DW_AT_name        : (indirect string, offset: 0xfd81): switchOff_signal_parameters
    <133b>   DW_AT_byte_size   : 0
    <133c>   DW_AT_decl_file   : 12
    <133d>   DW_AT_decl_line   : 375
 <1><133f>: Abbrev Number: 4 (DW_TAG_typedef)
    <1340>   DW_AT_name        : (indirect string, offset: 0x1927): roadSignOn_signal_parameters
    <1344>   DW_AT_decl_file   : 12
    <1345>   DW_AT_decl_line   : 32
    <1346>   DW_AT_type        : <0x134a>
 <1><134a>: Abbrev Number: 18 (DW_TAG_structure_type)
    <134b>   DW_AT_name        : (indirect string, offset: 0x1927): roadSignOn_signal_parameters
    <134f>   DW_AT_byte_size   : 0
    <1350>   DW_AT_decl_file   : 12
    <1351>   DW_AT_decl_line   : 380
 <1><1353>: Abbrev Number: 4 (DW_TAG_typedef)
    <1354>   DW_AT_name        : (indirect string, offset: 0xcdb4): roadSignOff_signal_parameters
    <1358>   DW_AT_decl_file   : 12
    <1359>   DW_AT_decl_line   : 33
    <135a>   DW_AT_type        : <0x135e>
 <1><135e>: Abbrev Number: 18 (DW_TAG_structure_type)
    <135f>   DW_AT_name        : (indirect string, offset: 0xcdb4): roadSignOff_signal_parameters
    <1363>   DW_AT_byte_size   : 0
    <1364>   DW_AT_decl_file   : 12
    <1365>   DW_AT_decl_line   : 385
 <1><1367>: Abbrev Number: 4 (DW_TAG_typedef)
    <1368>   DW_AT_name        : (indirect string, offset: 0x5330): open_signal_parameters
    <136c>   DW_AT_decl_file   : 12
    <136d>   DW_AT_decl_line   : 34
    <136e>   DW_AT_type        : <0x1372>
 <1><1372>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1373>   DW_AT_name        : (indirect string, offset: 0x5330): open_signal_parameters
    <1377>   DW_AT_byte_size   : 0
    <1378>   DW_AT_decl_file   : 12
    <1379>   DW_AT_decl_line   : 390
 <1><137b>: Abbrev Number: 4 (DW_TAG_typedef)
    <137c>   DW_AT_name        : (indirect string, offset: 0x70d8): close_signal_parameters
    <1380>   DW_AT_decl_file   : 12
    <1381>   DW_AT_decl_line   : 35
    <1382>   DW_AT_type        : <0x1386>
 <1><1386>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1387>   DW_AT_name        : (indirect string, offset: 0x70d8): close_signal_parameters
    <138b>   DW_AT_byte_size   : 0
    <138c>   DW_AT_decl_file   : 12
    <138d>   DW_AT_decl_line   : 395
 <1><138f>: Abbrev Number: 4 (DW_TAG_typedef)
    <1390>   DW_AT_name        : (indirect string, offset: 0x1144): gateOpen_signal_parameters
    <1394>   DW_AT_decl_file   : 12
    <1395>   DW_AT_decl_line   : 36
    <1396>   DW_AT_type        : <0x139a>
 <1><139a>: Abbrev Number: 18 (DW_TAG_structure_type)
    <139b>   DW_AT_name        : (indirect string, offset: 0x1144): gateOpen_signal_parameters
    <139f>   DW_AT_byte_size   : 0
    <13a0>   DW_AT_decl_file   : 12
    <13a1>   DW_AT_decl_line   : 400
 <1><13a3>: Abbrev Number: 4 (DW_TAG_typedef)
    <13a4>   DW_AT_name        : (indirect string, offset: 0xee20): gateClosed_signal_parameters
    <13a8>   DW_AT_decl_file   : 12
    <13a9>   DW_AT_decl_line   : 37
    <13aa>   DW_AT_type        : <0x13ae>
 <1><13ae>: Abbrev Number: 18 (DW_TAG_structure_type)
